<HTML>
	<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<META NAME="generator" CONTENT="GoLive CyberStudio">
		<TITLE>ToonTalk program kan &ouml;vers&auml;ttas till Java applets</TITLE>
		<META NAME="Template" CONTENT="C:\PROGRAM FILES\MICROSOFT
OFFICE\OFFICE\html.dot">
	</HEAD>
	<BODY LINK="#0000FF" VLINK="#800080">
		<CENTER>
			<P><B><FONT SIZE="4">ToonTalk(TM) och Java(TM)</FONT></B></P>
		</CENTER>
		<P><FONT SIZE="4">ToonTalk kan g&ouml;ra en Java applet fr&aring;n ett
ToonTalk program. </FONT></P>
		<P><FONT SIZE="4">F&ouml;r att &ouml;vers&auml;tta n&aring;got till en
Java applet ska man plocka upp
		det, trycka p&aring; pause-tangenten och sedan klicka p&aring;
&quot;Komma tillbaka
		senare&quot;. Det du gjort d&aring; &auml;r, att du flyttat det
fr&aring;n ToonTalk
		in i Windows. Om allt fungerar ska en webbl&auml;sare &ouml;ppnas automatiskt
		och du kommer att f&aring; se ditt program bli uppspelat. F&ouml;r att du
		sj&auml;lv ska kunna prova detta kan du g&aring; till anteckningsboken och
		sl&aring; upp sidan 6, anteckningsboken f&ouml;r exempel, och p&aring; sidan 2
		plocka upp roboten som hela tiden l&auml;gger till 1. Tryck p&aring;
pause-tangenten
		och klicka p&aring; &quot;Komma tillbaka senare&quot;. N&auml;r din
applet dyker upp
		i din webbl&auml;sare, klicka p&aring; &quot;Start&quot; och du kan se
hur siffrorna
		blir st&ouml;rre. Det &auml;r bara robotar, lastbilar och bilder som kan
		skapa en Java applet om de plockas upp medan ToonTalk stannas.
		En robot kommer k&ouml;ras med en l&aring;da som &auml;r likadan som den
han tr&auml;nades
		med. N&auml;r du laddar upp en lastbil beh&ouml;ver du kanske trycka p&aring;
		F8 f&ouml;r att hindra den fr&aring;n att k&ouml;ra bort. Du kan
l&auml;gga ett textkort
		i lastbilen f&ouml;r att ge den ett namn. Om du vill att dina robotar
		ska anv&auml;nda en speciell anteckningsbok m&aring;ste du l&auml;gga en kopia
		av den anteckningsboken i lastbilen. F&ouml;r att ge ett namn till
		en applet som skapats av en bild (med robotar p&aring; baksidan) l&auml;gger
		du bara ett textkort p&aring; bildens baksida.</FONT></P>
		<P><FONT SIZE="4">En applet kan be anv&auml;ndaren att l&auml;gga in
v&auml;rden. Anta att du &ouml;vers&auml;tter
		n&aring;got till Java med ett <A
HREF="bird.htm">f&aring;gelbo</A> i en <A
HREF="box.htm">l&aring;da</A> (och <A
HREF="bird.htm">f&aring;geln</A> som tillh&ouml;r det
boet inte blir &ouml;versatt till Java) och du har
		satt en etikett under facket i l&aring;dan. N&auml;r d&aring; denna Java
applet
		beh&ouml;ver ett v&auml;rde och hittar f&aring;gelboet kommer den att be
anv&auml;ndaren
		om ett v&auml;rde genom att skriva etiketten. P&aring; samma s&auml;tt
&auml;r det
		med en f&aring;gel som &auml;r i ett fack med etikett och som f&aring;r
n&aring;got.
		D&aring; skrivs etiketten med en beskrivning av den sak f&aring;geln
f&aring;tt.
		Tanken &auml;r att f&aring;glar och bon anv&auml;nds f&ouml;r
meddelanden, i b&auml;gge
		riktningarna, mellan anv&auml;ndaren och den Java applet som &auml;r
aktuell.</FONT></P>
		<P><FONT SIZE="4">Denna m&ouml;jlighet kr&auml;ver en webbl&auml;sare som
klarar Java, t ex Microsoft
		Internet Explorer 4.0 (som finns p&aring; ToonTalk CD-ROM eller kan
		laddas ner fr&aring;n <A
HREF="http://www.microsoft.com/ie">www.microsoft.com/ie</A>) och Netscape
Navigator 4.0 (som kan laddas ner fr&aring;n <A
HREF="http://www.netscape.com/">www.netscape.com</A>). Kompilatorn f&ouml;r
Java till byte fungerar bara i Windows 95 eller
		NT. Det inneb&auml;r att ToonTalk f&ouml;r Windows 3.1 kan skapa Java, men
		att du beh&ouml;ver kompilera den p&aring; n&aring;got s&auml;tt. (Du kan
anv&auml;nda en
		<A HREF="http://www.innovation.ch/java/java_compile.htm">gratis
kompilatortj&auml;nst</A> p&aring; n&auml;tet.) </FONT></P>
		<P><FONT SIZE="4">Microsoft Internet Explorer (version 4.0 SP1) (som
ing&aring;r i den
		f&ouml;rsta utg&aring;van av Windows 98) ger ibland en &quot;Invalid Page
Fault&quot;
		n&auml;r man f&ouml;rs&ouml;ker k&ouml;ra en Java applet som skapats av ToonTalk.
		Ibland h&auml;nger sig webbl&auml;saren eller ger besked om ett Java error.
		Du kan markera &quot;Internet Options&quot; under &quot;View&quot; i
menyraden, klicka
		p&aring; Advanced fliken och rulla dig ner till to &quot;Java JIT compiler
		enabled&quot;. Var noga med att krysset  tas bort. Detta b&ouml;r
l&ouml;sa problemet
		men g&ouml;r samtidigt alla Java applets l&aring;ngsammare. Denna bugg i
		Internet Explorer har rapporterats till Microsoft. <A
HREF="mailto:Support@ToonTalk.com">Rapportera g&auml;rna alla problem med
JIT fr&aring;nslagen</A>. </FONT></P>
		<P><FONT SIZE="4">F&ouml;r att k&ouml;ra och se n&aring;gra demon av
program som &ouml;versatts fr&aring;n
		ToonTalk till Java, <A
HREF="javademo.htm">klicka h&auml;r
</A>.</FONT></P>
	</BODY>
</HTML>

