<html>
<head>
<title>Toon Talk - O Logo é uma tecnologia obsoleta? - Parte 2</title>
<link rel="stylesheet" type="text/css" href="../toontalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>

<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>
<p>
<table width=460 cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<a class="menu" href="toontalk.html" OnMouseOver="window.status=' In&iacute;cio'; return true">início</a><span class=bola> &#0149;</span>
<a class="menu" href="search.html" OnMouseOver="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<a class="menu" href="buy.html" OnMouseOver="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<a class="menu" href="doc.html" OnMouseOver="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<a class="menu" href="whatsnew.html" OnMouseOver="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<a class="menu" href="faq.html" OnMouseOver="window.status=' D&uacute;vidas'; return true">dúvidas</a><span class=bola> &#0149;</span>
<a class="menu" href="support.html" OnMouseOver="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<a class="menu" href="free.html" OnMouseOver="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<a class="menu" href="press.html" OnMouseOver="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<a class="menu" href="address.html" OnMouseOver="window.status=' Contato'; return true">contato</a>
<hr size=1>
    </td></tr>
</table>

<table width=100% cellpadding=5 cellspacing=0>
<tr bgcolor="#fedea0">
	<th><a class="menu" href="logo.html">PARTE 1</a></th>
	<th bgcolor="#cc9966"><b>PARTE 2</b></span></th>
	<th><a class="menu" href="logo3.html">PARTE 3</a></th>
	<th><a class="menu" href="logo4.html">PARTE 4</a></th>
	<th><a class="menu" href="logo5.html">PARTE 5</a></th>
</tr>
</table>

<h1><hr size=1>
O Logo é uma tecnologia obsoleta?<hr size=1></h1>

<p class=olho>
Esta &eacute; uma discuss&atilde;o que foi mantida na <a
href="news:comp.lang.logo">comp.lang.logo</a> (e na correspondente 
lista de discuss&atilde;o por e-mail de 16 de novembro a 2 de 
dezembro, em 1998. A discuss&atilde;o intitulada <a
href="http://el.www.media.mit.edu/logo-foundation/">O Logo é uma
tecnologia obsoleta?</a>

<p class=autor>
De Ken Kahn:

<p>
Ken, obrigado pela sua interessante mensagem sobre Toon Talk. Eu
provavelmente n&atilde;o terei tempo para uma an&aacute;lise cuidadosa por
enquanto mas pelo modo pelo qual voc&ecirc; o descreve n&atilde;o posso ver
muita diferen&ccedil;a do MicroWorlds ou outros produtos LCSI como "MY
Make Believe Castle" ( para crian&ccedil;as jovens). Quando voc&ecirc; contrasta
o Toon Talk com o Logo voc&ecirc; parece estar se referindo &agrave;s vers&otilde;es
antigas (pr&eacute;-MicroWorlds) do Logo. 

<p>
"Uma linguagem de programa&ccedil;&atilde;o &eacute; algo para "pensar com".
Pensamento com procedimento sequencial e vari&aacute;veis globais &eacute; o
que o Logo oferece. Eu estive pensando desta forma desde que
aprendi a programar em 1968. Mas foi maravilhoso quando em 1973
eu aprendi ( a maior parte com um professor do MIT chamado Carl
Hewitt) a pensar em termos do que ele chamava atores-objetos
concorrentes com passagem de mensagens."

<p>
Eu li Papert dizendo coisas similares, por exemplo, em seu artigo
"Epistemological Pluralism" (com Turkle) - que o que voc&ecirc; est&aacute;
descrevendo &eacute; a filosofia por detr&aacute;s do MicroWorlds.

<p>
"Ent&atilde;o em 1980 eu aprendi com o Prolog a pensar em programas
declarativamente em termos de predicados e demonstra&ccedil;&atilde;o de
teoremas. Prolog concorrente e seus sucessores me ensinaram a
pensar com atores e l&oacute;gica em conjunto. Eu n&atilde;o quero afirmar que
uma forma de pensar domina completamente as outras. Eu apenas
quero despertar a comunidade Logo para o fato de que h&aacute; muito
mais que pode ser "tomado de empr&eacute;stimo" da ci&ecirc;ncia da
computa&ccedil;&atilde;o."

<p>
A id&eacute;ia de construir , ao mesmo tempo, l&oacute;gica e intui&ccedil;&atilde;o em
programas, proporcionando uma diversidade de estilos de
aprendizagem, tamb&eacute;m &eacute; uma id&eacute;ia de Papert (vide o mesmo artigo)
e eu penso que isto &eacute; uma parte do projeto MicroWorlds.

<p>
"Em 1994 eu li um artigo de Sharon Yader em Logo Exchange
intitulado "Desencorajado? ...N&atilde;o se desespere!". Ela perguntava &agrave;
uma classe de calouros na universidade acerca de sua exposi&ccedil;&atilde;o ao
Logo. Uma grande percentagem havia sido exposta e quase todos
relataram a experi&ecirc;ncia como negativa. Nos anos 70 eu ensinei logo
e tamb&eacute;m observei os resultados do ensino de outras pessoas no
grupo de Logo do MIT. Era maravilhoso. Era "m&aacute;gico". Minha teoria
de como conciliar estes dois fatos &eacute; que as crian&ccedil;as podem obter
um n&iacute;vel excelente aprendendo Logo se ele &eacute; ensinado por um
professor que compreende profundamente tanto crian&ccedil;as quanto
programa&ccedil;&atilde;o. Eu penso que ao pesquisa informal de Sharon indica
que tais professores s&atilde;o raros."

<p>
A evid&ecirc;ncia aned&oacute;tica &eacute; que as crian&ccedil;as apreciam Toon Talk e o dominam
relativamente rapidamente. ( Vide <a href="http://www.toontalk.com/English/users.htm">www.toontalk.com/English/users.htm</a>)
Um grande projeto de pesquisa pan-europeu acabou de se iniciar no princ&iacute;pio do m&ecirc;s, que ir&aacute; construir o que n&oacute;s chamamos
"playgrounds" sobre o Toon Talk e o Logo. (vide  <a href="http://www.ioe.ac.uk/playground">www.ioe.ac.uk/playground</a>) Ele planeja fazer estudos cuidadosos
acerca de crian&ccedil;as utilizando ambos os sistemas. Eu estou quase apostando que Toon Talk despontar&aacute; primeiro.

<p>
Eu concordo com essa an&aacute;lise.

<p>
´Ent&atilde;o, como podemos dar &agrave;s crian&ccedil;as o poder e a m&aacute;gica da
programa&ccedil;&atilde;o quando tais professores n&atilde;o est&atilde;o dispon&iacute;veis?
Fazendo um ambiente de software no qual as crian&ccedil;as possam
descobrir e aprender programa&ccedil;&atilde;o por si mesmas. Toon Talk, eu
afirmo, &eacute; tal ambiente. As crian&ccedil;as podem aprender Toon Talk
explorando um ambiente seguro, auto-revelador, abrindo seu
caminho atrav&eacute;s de um jogo de quebra-cabe&ccedil;as interativo, assistindo
demos com narra&ccedil;&atilde;o, obtendo ajuda de um agente do programa, e
outras coisas. [ Eu escrevi um cap&iacute;tulo em um livro que acabou de ser
publicado este m&ecirc;s acerca deste t&oacute;pico. O livro &eacute; "The Design of
Children's Technology", editado por alison Druin, publicado por
Morgan Kaufman]. As primeiras indica&ccedil;&otilde;es s&atilde;o que isto realmente
funciona (vide <a HREF="http://www.toontalk.com/English/users.htm">www.toontalk.com/English/users.htm</a>).

<p>
Este argumento &eacute;, simultaneamente, verdadeiro e perigoso. Bons
programas construcionistas ser&atilde;o mais intuitivos para novos
usu&aacute;rios (verdadeiro) mas sempre haver&aacute; lugar para bons
professores para encontrar diversos meios para levar o usu&aacute;rio para
um n&iacute;vel mais elevado. Sugerir que isto pudesse ocorrer para o
programa em separado &eacute; perigoso. ( Eu gostaria de seguir a an&aacute;lise
de seu cap&iacute;tulo, mas n&atilde;o tenho tempo no momento). Eu penso que
uma solu&ccedil;&atilde;o melhor para o dilema &eacute; aperfei&ccedil;oar os cursos de
educa&ccedil;&atilde;o de professores pois o fator humano ser&aacute; sempre o
principal.

<p><hr size=1>

<p class=reply>
Em paralelo, "smarallel"- voc&ecirc; realmente cr&ecirc; que as crian&ccedil;as se
importam em que fundo os programas rodam?"

<p class=reply>
Eu suponho que tenha j&aacute; respondido parcialmente esta quest&atilde;o no
ponto n&uacute;mero 1 acimq. Mas o paralelismo n&atilde;o &eacute; apenas outra
ferramenta de pensamento, ele &eacute; tamb&eacute;m uma melhor forma de
programa&ccedil;&atilde;o. Por exemplo, um dos demos de Toon Talk &eacute; construir
um jogo de Pingue-pongue. Eu estou convencido que a melhor
maneira de estruturar programas &eacute; atrav&eacute;s de muitos processos
independendentes ( mas que se comunicam e est&atilde;o sincronizados).
No exemplo do pingue-pongue, a bola, a raquete, e o marcador de
escore s&atilde;o, cada um, programas paralelos. O mundo ao redor de
n&oacute;s est&aacute; rodando em paralelo e tentar copi&aacute;-lo ou simul&aacute;-lo
sequencialmente &eacute; desnecessariamente dif&iacute;cil."

<p class=reply>
Esta &eacute; uma grande quest&atilde;o. Se a resposta for sim, a abordagem de 
Toon Talk &eacute; definitivamente o caminho a se seguir, n&atilde;o havendo 
nenhuma d&uacute;vida a respeito. Em minha opini&atilde;o, &eacute; mais f&aacute;cil para a 
maioria das pessoas adotar o estilo de programa&ccedil;&atilde;o declarativa do 
que o estilo de programa&ccedil;&atilde;o concorrente, Por exemplo, a SQL, 
como utilizada em bancos de dados, &eacute; declarativa. Ela come&ccedil;a a ser 
utilizada universalmente nos dias de hoje. Ningu&eacute;m poderia dizer que 
as bases de dados relacionais s&atilde;o, atualmente, lentas; as pessoas 
apenas se preocupam acerca da "produtividade" que ela tem para 
oferecer.

<p class=reply>
Eu suponho que o que Ray quis dizer &eacute; que o Microworlds tamb&eacute;m
suporta o paralelismo. O que voc&ecirc; precisa demonstrar &eacute; que o Toon
Talk de alguma forma o faz melhor, ou seja, que a diferen&ccedil;a seja
&oacute;bvia para o usu&aacute;rio e n&atilde;o apenas para o sofisticado cientista da
computa&ccedil;&atilde;o. (embora eu esteja interessado pessoalmente em cada
explica&ccedil;&atilde;o , ou seja, uma expans&atilde;o de sua anterior explica&ccedil;&atilde;o muito
resumida).

<p class=reply>
Eu estou interessado em descobrir mais acerca de Toon Talk e sua
filosofia educacional. Estes breves coment&aacute;rios poder&atilde;o auxili&aacute;-lo a
endere&ccedil;ar algumas das reflex&otilde;es que encontrar&aacute; neste grupo de
discuss&atilde;o.

<p class=reply>
-- Bill Kerr


<p><hr size=1>

<p>De Gary S. Stager:

<p>
Brian,

<p>
Eu tive uma poderosa experi&ecirc;ncia ontem tentando utilizar um novo
ambiente de programa&ccedil;&atilde;o "mais simples" para crian&ccedil;as. Embora eu
estivesse tentando realizar uma tarefa muito simples, a falta de
eleg&acirc;ncia da interface obrigou-me a chamar um velho colega que
trabalha para a companhia que produz o programa. N&oacute;s dois
passamos a pr&oacute;xima hora tentando colaborar com o que deveria ter
sido um programa de 2 minutos pois n&atilde;o havia linguagem para
comunica&ccedil;&atilde;o no nosso programa. "Conecte o objeto azul ao canto
do &iacute;cone--- n&atilde;o aquele canto - eu disse o garfo..."

<p>
Uma das id&eacute;ias poderosas do Logo &eacute; que ele &eacute; compartilh&aacute;vel. Eu
fui recentemente relembrado de seu poder por um meu aluno que
ensina crian&ccedil;as latinas pequenas em L.A. Estas crian&ccedil;as da terceira
s&eacute;rie, falando ingl&ecirc;s limitado, est&atilde;o desconstruindo projetos criados
por garotos de escolas m&eacute;dias abastadas de Nova Iorque e
programando (ou pelo menos se sentindo suficientemente confiantes
de que podem tentar programar) seus pr&oacute;prios v&iacute;deo-games. O Logo
oferece &agrave;s crian&ccedil;as um ambiente no qual elas podem criar algo
compartilh&aacute;vel logo no princ&iacute;pio de sua utiliza&ccedil;&atilde;o do software, pois
ele permite m&uacute;ltiplas abordagens para resolver um problema.

<p><br>
<hr size=1>

<p>Gary S. Stager escreveu:

<p>
"Eu tive uma poderosa experi&ecirc;ncia ontem tentando utilizar um novo
ambiente de programa&ccedil;&atilde;o "mais simples" para crian&ccedil;as. Embora eu
estivesse tentando realizar uma tarefa muito simples, a falta de
eleg&acirc;ncia da interface obrigou-me a chamar um velho colega que
trabalha para a companhia que produz o programa. N&oacute;s dois
passamos a pr&oacute;xima hora tentando colaborar com o que deveria ter
sido um programa de 2 minutos pois n&atilde;o havia linguagem para
comunica&ccedil;&atilde;o no nosso programa. "Conecte o objeto azul ao canto
do &iacute;cone--- n&atilde;o aquele canto - eu disse o garfo..."

<p>
"Uma das id&eacute;ias poderosas do Logo &eacute; que ele &eacute; compartilh&aacute;vel." 

<p>
Sobre algumas coisas, como o Logo, s&atilde;o mais f&aacute;ceis de discutir ao
telefone ou por e-mail. Isso n&atilde;o &eacute; surpreendente, pois o Logo &eacute;
textual. Outras coisas, como o software que voc&ecirc; est&aacute; utilizando,
Toon Talk, e problemas, n&atilde;o s&atilde;o t&atilde;o adequados para discuss&otilde;es
puramente verbais. Minsky e Papert uma vez tentaram "compartilhar"
problemas atrav&eacute;s do telefone. Eles perceberam que era
extremamente dif&iacute;cil. 

<p>
Se voc&ecirc; e seu colega tinham um meio de conectar seus
computadores, ent&atilde;o ambos viram a mesma tela e talvez ambos
tinham um cursor do mouse para apontar, ent&atilde;o falar ao telefone
poderia ter sido muito produtivo. 

<p>
Mas a caracter&iacute;stica de ser compartilh&aacute;vel n&atilde;o &eacute; a mesma que ser
capaz de falar sobre ela ao telefone. As coisas que voc&ecirc; faz em Toon
Talk s&atilde;o compartilh&aacute;veis - voc&ecirc; pode mesmo coloc&aacute;-las em
mensagens por e-mail ou convert&ecirc;-las para aplicativos Java para
mostrar a qualquer um com um Navegador da web o que voc&ecirc; fez. E
estas coisas s&atilde;o compon&iacute;veis - uma caracter&iacute;stica muito importante.
O logo sequencial &eacute; compon&iacute;vel tamb&eacute;m-mas eu me pergunto qu&atilde;o
bem funciona a composi&ccedil;&atilde;o de processos paralelos do Microworlds
se a comunica&ccedil;&atilde;o &eacute; atrav&eacute;s de vari&aacute;veis globais.

<p>
Sauda&ccedil;&otilde;es, <br>

-ken kahn


<p><hr size=1>

<p>De <a HREF="mailto:luvisi@andru.sonoma.edu">luvisi@andru.sonoma.edu</a>:

<p>&quot;Ken Kahn&quot; &lt;<a
HREF="mailto:KenKahn@ToonTalk.com">KenKahn@ToonTalk.com</a>&gt; escreve: <br>
"Se voc&ecirc; e seu colega tinham um meio de conectar seus
computadores, ent&atilde;o ambos viram a mesma tela e talvez ambos
tinham um cursor do mouse para apontar, ent&atilde;o falar ao telefone
poderia ter sido muito produtivo."

<p>Vnc &eacute; tal esp&eacute;cie de software... <a
HREF="http://www.orl.co.uk/vnc/">http://www.orl.co.uk/vnc/</a> 

E, como muitos bons softwares, tem c&oacute;digo aberto. 

andru

<p><hr size=1>

<p>De Brian Harvey:

<p>
&quot;Bill Kerr&quot; &lt;<a
HREF="mailto:kerrb@senet.com.au">kerrb@senet.com.au</a>&gt; escreve: <br>
"Ent&atilde;o em 1980 eu aprendi com o Prolog a pensar em programas
declarativamente em termos de predicados e demonstra&ccedil;&atilde;o de
teoremas. Prolog concorrente e seus sucessores me ensinaram a
pensar com atores e l&oacute;gica em conjunto." 

<p>
"A id&eacute;ia de construir , ao mesmo tempo, l&oacute;gica e intui&ccedil;&atilde;o em
programas, proporcionando uma diversidade de estilos de
aprendizagem, tamb&eacute;m &eacute; uma id&eacute;ia de Papert (vide o mesmo artigo)
e eu penso que isto &eacute; uma parte do projeto MicroWorlds."

<p>
Isto n&atilde;o &eacute; muito justo. Qualquer linguagem de programa&ccedil;&atilde;o requer
pensamento l&oacute;gico, mas a Programa&ccedil;&atilde;o l&oacute;gica &eacute; ainda muito
diferente da programa&ccedil;&atilde;o procedural. A mudan&ccedil;a nos processos de
pensamento que &eacute; requerida &eacute; da mesma ordem ( embora em uma
dire&ccedil;&atilde;o diferente) do grau pelo qual o paralelismo massivo no
StarLogo &eacute; profundamente diferente da programa&ccedil;&atilde;o tradicional, e
mesmo do paralelismo limitado do Microworlds. 

<p>
Ken est&aacute; perfeitamente certo quanto n&atilde;o haver nenhum tra&ccedil;o de
Logo que seja remotamente como a programa&ccedil;&atilde;o l&oacute;gica.

<p><hr size=1>

<p>Bill Kerr escreveu:

<p>
"obrigado pela sua interessante mensagem sobre Toon Talk. Eu
provavelmente n&atilde;o terei tempo para uma an&aacute;lise cuidadosa por
enquanto mas pelo modo pelo qual voc&ecirc; o descreve n&atilde;o posso ver
muita diferen&ccedil;a do MicroWorlds ou outros produtos LCSI como "MY
Make Believe Castle" ( para crian&ccedil;as jovens). Quando voc&ecirc; contrasta
o Toon Talk com o Logo voc&ecirc; parece estar se referindo &agrave;s vers&otilde;es
antigas (pr&eacute;-MicroWorlds) do Logo."


<p>
Do ponto de vista de um cientista da computa&ccedil;&atilde;o, existem grandes
diferen&ccedil;as. Eles diferem tanto em sintaxe quanto em sem&acirc;ntica. O
Logo tem uma sintaxe textual. O Toon Talk tem uma sintaxe visual
animada. O Logo &eacute; uma linguagem prodedural sequencial. O Toon
Talk &eacute; uma linguagem concorrente orientada para objetos.

<p>
"Uma linguagem de programa&ccedil;&atilde;o &eacute; algo para "pensar com".
Pensamento com procedimento sequencial e vari&aacute;veis globais &eacute; o
que o Logo oferece. Eu estive pensando desta forma desde que
aprendi a programar em 1968. Mas foi maravilhoso quando em 1973
eu aprendi ( a maior parte com um professor do MIT chamado Carl
Hewitt) a pensar em termos do que ele chamava atores-objetos
concorrentes com passagem de mensagens."

<p>
"Eu li Papert dizendo coisas similares, por exemplo, em seu artigo
"Epistemological Pluralism" (com Turkle) - que o que voc&ecirc; est&aacute;
descrevendo &eacute; a filosofia por detr&aacute;s do MicroWorlds."

<p>
Eu aprendi muito de Seymour- inclusive esta id&eacute;ia. Talvez eu esteja
enganado, mas o Microworlds n&atilde;o altera muito o Logo. Ele adiciona
uma grande quantidade de inven&ccedil;&otilde;es de interface do usu&aacute;rio &uacute;teis e
uma no&ccedil;&atilde;o empobrecida, muito primitiva de processamento paralelo.
Eu n&atilde;o tenho ci&ecirc;ncia de nenhuma forma de sincronizar processos
paralelos no Microworlds. E o &uacute;nico meio pelo qual os processos
podem se comunicar s&atilde;o vari&aacute;veis globais. Esta &eacute; uma
modularidade pobre e pode levar a que seja extremamente dif&iacute;cil
detectar problemas. E em que sentido o Microworlds &eacute; orientado
para objetos?

<p>&gt; <br>
"A id&eacute;ia de construir , ao mesmo tempo, l&oacute;gica e intui&ccedil;&atilde;o em
programas, proporcionando uma diversidade de estilos de
aprendizagem, tamb&eacute;m &eacute; uma id&eacute;ia de Papert (vide o mesmo artigo)
e eu penso que isto &eacute; uma parte do projeto MicroWorlds."

<p>
L&oacute;gica/planejamento e intui&ccedil;&atilde;o/consertos est&atilde;o naquele artigo. E eu
n&atilde;o questiono que o Microworlds suporta ambos os estilos cognitivos
( assim como o Toon Talk). Mas existe um n&iacute;vel diferente, ao qual
estou tentando chegar. Eu estou destacando que h&aacute; um papel para
pensamento l&oacute;gico e declarativo como um meio de EXPRESSAR
programas, n&atilde;o apenas projet&aacute;-los e constru&iacute;-los.

<p>
"Este argumento &eacute;, simultaneamente, verdadeiro e perigoso. Bons
programas construcionistas ser&atilde;o mais intuitivos para novos
usu&aacute;rios (verdadeiro) mas sempre haver&aacute; lugar para bons
professores para encontrar diversos meios para levar o usu&aacute;rio para
um n&iacute;vel mais elevado. Sugerir que isto pudesse ocorrer para o
programa em separado &eacute; perigoso. ( Eu gostaria de seguir a an&aacute;lise
de seu cap&iacute;tulo, mas n&atilde;o tenho tempo no momento). Eu penso que
uma solu&ccedil;&atilde;o melhor para o dilema &eacute; aperfei&ccedil;oar os cursos de
educa&ccedil;&atilde;o de professores pois o fator humano ser&aacute; sempre o
principal."

<p>Eu concordo parcialmente. Mas tamb&eacute;m vejo o Toon Talk
funcionando no lar, quando n&atilde;o h&aacute; professor. O mais recente livro de
Seymour, "The Connected Family", enfatiza tamb&eacute;m o aprendizado
que ocorre em casa.

<p>
&gt; <br>
"Eu suponho que o que Ray quis dizer &eacute; que o Microworlds tamb&eacute;m
suporta o paralelismo. O que voc&ecirc; precisa demonstrar &eacute; que o Toon
Talk de alguma forma o faz melhor, ou seja, que a diferen&ccedil;a seja
&oacute;bvia para o usu&aacute;rio e n&atilde;o apenas para o sofisticado cientista da
computa&ccedil;&atilde;o. (embora eu esteja interessado pessoalmente em cada
explica&ccedil;&atilde;o , ou seja, uma expans&atilde;o de sua anterior explica&ccedil;&atilde;o muito
resumida)." <br>
&gt; 

<p>Eu toquei a reposta do sofisticado cientista da computa&ccedil;&atilde;o acima.
Eu planejo escrever uma resposta de 1 ou 2 p&aacute;ginas para a quest&atilde;o
em breve, e a enviarei assim que estiver pronta. 

<p>
"Eu estou interessado em descobrir mais acerca de Toon Talk e sua
filosofia educacional. Estes breves coment&aacute;rios poder&atilde;o auxili&aacute;-lo a
endere&ccedil;ar algumas das reflex&otilde;es que encontrar&aacute; neste grupo de
discuss&atilde;o."
Seus coment&aacute;rios foram &uacute;teis, obrigado.

<p>Sauda&ccedil;&otilde;es, <br>
-ken kahn 

<p><hr size=1>

<p>De Bill Kerr:

<p>Brian escreveu: <br>
"Ken est&aacute; perfeitamente certo quanto n&atilde;o haver nenhum tra&ccedil;o de
Logo que seja remotamente como a programa&ccedil;&atilde;o l&oacute;gica."
 </font></p>

<p>Eu n&atilde;o sei nada sobre o Prologo, ent&atilde;o posso ser corrigido. Minha
quest&atilde;o seria : O que ocorre com a l&oacute;gica de Toon Talk para que
esta seja, ao mesmo tempo, obvia e superior &agrave; l&oacute;gica do
Microworlds? &Eacute; uma id&eacute;ia poderosa como a de recurs&atilde;o que deve
ser incorporada aos softwares educacionais e sua exclus&atilde;o faz do
Logo uma "tecnologia antiga"? Ou &eacute; alguma coisa de interesse
principalmente para os cientistas da computa&ccedil;&atilde;o mas n&atilde;o para uma
audi&ecirc;ncia mais ampla? Minha sensa&ccedil;&atilde;o (admitidamente subjetiva) &eacute;
que o equil&iacute;brio entre l&oacute;gica e intui&ccedil;&atilde;o no Microworlds &eacute; quase
perfeito.

<p>-- Bill Kerr

<p><hr size=1>

<p>De Brian Harvey

<p>&quot;Bill Kerr&quot; &lt;<a
HREF="mailto:kerrb@senet.com.au">kerrb@senet.com.au</a>&gt; escreveu: <br>
&gt;Brian escreveu: <br>
"Ken est&aacute; perfeitamente certo quanto n&atilde;o haver nenhum tra&ccedil;o de
Logo que seja remotamente como a programa&ccedil;&atilde;o l&oacute;gica."
"Eu n&atilde;o sei nada sobre o Prologo, ent&atilde;o posso ser corrigido. Minha
quest&atilde;o seria : O que ocorre com a l&oacute;gica de Toon Talk para que
esta seja, ao mesmo tempo, obvia e superior &agrave; l&oacute;gica do
Microworlds? &Eacute; uma id&eacute;ia poderosa como a de recurs&atilde;o que deve
ser incorporada aos softwares educacionais e sua exclus&atilde;o faz do
Logo uma "tecnologia antiga"? Ou &eacute; alguma coisa de interesse
principalmente para os cientistas da computa&ccedil;&atilde;o mas n&atilde;o para uma
audi&ecirc;ncia mais ampla? Minha sensa&ccedil;&atilde;o (admitidamente subjetiva) &eacute;
que o equil&iacute;brio entre l&oacute;gica e intui&ccedil;&atilde;o no Microworlds &eacute; quase
perfeito."

<p>
Primeiramente, esque&ccedil;a sobre aquele "balan&ccedil;o entre l&oacute;gica e
intui&ccedil;&atilde;o". A programa&ccedil;&atilde;o l&oacute;gica n&atilde;o envolve nem mais nem menos
intui&ccedil;&atilde;o que a programa&ccedil;&atilde;o procedural.

<p>
Na programa&ccedil;&atilde;o procedural, voc&ecirc; informa um ALGORITMO ao
computador, que ele utilizar&aacute; para computar a resposta que voc&ecirc;
deseja. Primeiro fa&ccedil;a isso, depois aquilo, etc.

<p>
Na programa&ccedil;&atilde;o l&oacute;gica, voc&ecirc; informa alguns FATOS ao computador,
que voc&ecirc; conhece, e algumas REGRAS que podem ser utilizadas
para inferir novos fatos, e ent&atilde;o voc&ecirc; lhe faz quest&otilde;es, e o trabalho
do computador &eacute; descobrir como conseguir as respostas.

<p>
Como um exemplo cl&aacute;ssico, aqui est&aacute; um procedimento Logo para
anexar duas tabelas: 

<p>
to append :a :b if empty? :a [output :b] output fput (first
:a) (append bf :a :b) end

<p>
Por contraste, em programa&ccedil;&atilde;o l&oacute;gica voc&ecirc; deveria inserir estas
regras;

<p>
(append [] :b) = :b 

<p>
IF (append :a :b) = :c THEN (append (fput :x :a) :b) = (fput
:x :c)

<p>
( Isto n&atilde;o &eacute; realmente nenhuma linguagem l&oacute;gica particular; Estou
tentando utilizar o vocabul&aacute;rio e nota&ccedil;&atilde;o Logo para evitar criar a
nota&ccedil;&atilde;o.) Com estas regras, como com os procedimentos Logo,
voc&ecirc; pode Ter quest&otilde;es como

<p>
O que &eacute; (append [123] [4 5]?

<p>
Mas voc&ecirc; tamb&eacute;m pode ter quest&otilde;es como

<p>
Se (append [ 123] : x &eacute; [1 2 3 4 5], o que &eacute; :x?

<p>
Ou ainda

<p>
Se (append [ : x : y] &eacute; [ 1 2 3 4 5 ], o que s&atilde;o :x e : y? 

<p>
O que lhe dar&aacute; todas as seis respostas poss&iacute;veis! No Logo, voc&ecirc; n&atilde;o
pode " rodar um procedimento subjacente" como pode fazer com as
regras em uma linguagem l&oacute;gica.

<p>
A maneira pela qual funciona &eacute; que os inventores da programa&ccedil;&atilde;o
l&oacute;gica inventaram uma esp&eacute;cie de algoritmo universal, uma
generaliza&ccedil;&atilde;o do ajuste de padr&otilde;es.


<p>
A programa&ccedil;&atilde;o l&oacute;gica &eacute; um companheiro natural para a pesquisa de
banco de dados; ela &eacute; menos &oacute;bvia como aliada para programa&ccedil;&atilde;o
"side-effect-laden, embora muitos anos atr&aacute;s Ken Khan tenha escrito
um pacote de gr&aacute;ficos de tartaruga em Prolog, portanto seus
interesses atuais t&ecirc;m uma longa hist&oacute;ria.

<p>
A programa&ccedil;&atilde;o l&oacute;gica realmente &eacute; um meio muito diferente de
pensar acerca da programa&ccedil;&atilde;o, e ela, eu penso, desenvolve a mente
de maneira &uacute;til, seja ou n&atilde;o o usu&aacute;rio um cientista de computa&ccedil;&atilde;o. A
utiliza&ccedil;&atilde;o do Prolog como uma primeira linguagem para crian&ccedil;as tem
um uma longa hist&oacute;ria, n&atilde;o nos Estados Unidos, mas definitivamente
na Inglaterra - Richard Ennals escreveu um livro de Prolog para
crian&ccedil;as , eu suponho que em algum momento nos anos 70,mas
todos os meus livros ainda est&atilde;o encaixotados, portanto n&atilde;o posso
examin&aacute;-los agora ( eu acabei de me mudar!).

<p>
Resumo principal: Eu n&atilde;o penso que o Logo seja "obsoleto", mas
creio que h&aacute; mais de uma boa ferramenta de computador para
crian&ccedil;as!

<p><hr size=1>

<p>De Bill Kerr:

<p>
Brian Harvey escreveu:

<p>
" A programa&ccedil;&atilde;o l&oacute;gica realmente &eacute; um meio muito diferente de
pensar acerca da programa&ccedil;&atilde;o, e ela, eu penso, desenvolve a mente
de maneira &uacute;til, seja ou n&atilde;o o usu&aacute;rio um cientista de computa&ccedil;&atilde;o. A
utiliza&ccedil;&atilde;o do Prolog como uma primeira linguagem para crian&ccedil;as tem
um uma longa hist&oacute;ria, n&atilde;o nos Estados Unidos, mas definitivamente
na Inglaterra - Richard Ennals escreveu um livro de Prolog para
crian&ccedil;as"

<p>
Obrigado pela resposta informativa - parace como se o Prolog
pudesse ser um bom modo de dar sentido ao conceito de
engenharia reversa.

<p>-- Bill Kerr 

<p><hr size=1>

<p>De Bill Kerr:

<p>Ken Kahn escreveu: <br>
"Talvez eu esteja enganado, mas o Microworlds n&atilde;o altera muito o
Logo. Ele adiciona uma grande quantidade de inven&ccedil;&otilde;es de
interface do usu&aacute;rio &uacute;teis e uma no&ccedil;&atilde;o empobrecida, muito primitiva
de processamento paralelo. Eu n&atilde;o tenho ci&ecirc;ncia de nenhuma forma
de sincronizar processos paralelos no Microworlds."<br><br>

Eu penso que esse procedimento do Microworlds (da ajuda do MW,
e tamb&eacute;m realiz&aacute;-lo?) realiza processos paralelos sincronizados.:<br><br>

To sq-circ<br>

T1, pd launch [repeat 36 [fd 10 rt 10]]<br>

; t1 draws a circle<br>

t2, pd launch [repeat 4[ fd 50 rt 90]]<br>

; ts draws a square<br>

waituntil [ done?[repeat 36 [fd 10 rt 10]]]<br>

; the procedure does not continue until the circle is finished<br>

; so that the drawings of circles and square are synchronised<br>

t1, pu rt random 360 fd random 50<br>

t2, pu rt random 360 fd random 50<br>

; repositions turtles for next drawing<br>

sq- circ<br>

end<br>
 

"E o &uacute;nico meio pelo qual os processos podem se comunicar s&atilde;o
vari&aacute;veis globais. Esta &eacute; uma modularidade pobre e pode levar a
que seja extremamente dif&iacute;cil detectar problemas. E em que sentido
o Microworlds &eacute; orientado para objetos?"<br><br>

O Microworlds tem um primitivo "turtlesown" que lhe permite localizar
coisas como a velocidade ou a posi&ccedil;&atilde;o de um "turtle" que est&aacute;, por
exemplo, simulando um cavalo. Eu colarei na explica&ccedil;&atilde;o da ajuda do
MW, o que nos dar&aacute; alguma esp&eacute;cie de ponto para as discuss&otilde;es
posteriores. Eu n&agrave;o estou tentando sugerir que o MW &eacute; totalmente
orientado para objetos mas o c&oacute;digo pode residir em objetos como
cores, "turtles", bot&otilde;es. Isto d&aacute; aos estudantes uma introdu&ccedil;&atilde;o a
conceitos elementares e para crian&ccedil;as pequenas eu n&atilde;o posso ver
que a quest&atilde;o v&aacute; al&eacute;m. O MW e o Logo t&ecirc;m vari&aacute;veis locais as quais
poderiam ser a coisa principal, n&atilde;o? Minha impress&atilde;o principal a
partir de alguns java "oops" no in&iacute;cio deste ano &eacute; que tudo &eacute; dez
vezes mais dif&iacute;cil do que utilizando o Logo.<br><br>

Start of paste from MW help<br>

Turtlesown word<br>

Determina uma vari&aacute;vel para todos os "turtles" no projeto em
andamento. Esta vari&aacute;vel pode ent&atilde;o ser definida para um valor
espec&iacute;fico para cada "turtlle". Este comando tamb&eacute;m cria um novo
uso primitivo da defini&ccedil;&atilde;o da palavra seguida pelo nome da vari&aacute;vel
(por exemplo, turtlesown" velocidade cria um comando de ajuste de
velocidade como em t1, ajuste de velocidade 12). H&aacute; dois modos de
obter o valor de uma vari&aacute;vel de um "turtle" definido: voc&ecirc; pode
informar a um "turtle" e utilizar o nome da vari&aacute;vel para reportar o
valor ( por exemplo, t1, exibe a velocidade 12, neste exemplo) ou
voc&ecirc; pode utilizar o nome do "turtle" seguido por 's 9 por exemplo,
exibir t1's velocidade exibe 12).<br><br>

Utilize "remove" para remover uma vari&aacute;vel de um "turtle". Isto
remove a vari&aacute;vel nomeada para todos os "turtles" no projeto. Depois
de uma instru&ccedil;&atilde;o "turtlesown" , o valor da vari&aacute;vel &eacute; ajustado para a
lista vazia ( vide as tr&ecirc;s primeiras linhas do exemplo abaixo).<br><br>

Turtlesown "speed<br>

T1, show speed<br>

(empty list)<br>

t1, setspeed 10<br>

t2, setspeed 20<br>

t3, setspeed 5<br>

t1, show speed<br>

10<br>

show t2's "speed<br>

20<br>

everyone [fd speed]<br>

everyone [forever [fd speed]]<br>

Choose Stop All from the Edit menu.<br>

Remove "speed<br>

End of paste from MW help
<br>
<br>
-- Bill Kerr<br>

<p>

<hr size=1>
<a class="menu" href="toontalk.html">início</a> -
<a class="menu" href="search.html">busca</a> -
<a class="menu" href="buy.html">adquira</a> -
<a class="menu" href="doc.html">manual</a> -
<a class="menu" href="whatsnew.html">novidades</a> -
<a class="menu" href="faq.html">dúvidas</a> -
<a class="menu" href="support.html">suporte</a> -
<a class="menu" href="free.html">download</a> -
<a class="menu" href="press.html">imprensa</a> -
<a class="menu" href="address.html">contato</a>

</td></tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->