<html>
<head>
<title>Toon Talk - O Logo é uma tecnologia obsoleta? - Parte 1</title>
<link rel="stylesheet" type="text/css" href="../toontalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table width=460 cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<a class="menu" href="toontalk.html" OnMouseOver="window.status=' In&iacute;cio'; return true">início</a><span class=bola> &#0149;</span>
<a class="menu" href="search.html" OnMouseOver="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<a class="menu" href="buy.html" OnMouseOver="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<a class="menu" href="doc.html" OnMouseOver="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<a class="menu" href="whatsnew.html" OnMouseOver="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<a class="menu" href="faq.html" OnMouseOver="window.status=' D&uacute;vidas'; return true">dúvidas</a><span class=bola> &#0149;</span>
<a class="menu" href="support.html" OnMouseOver="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<a class="menu" href="free.html" OnMouseOver="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<a class="menu" href="press.html" OnMouseOver="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<a class="menu" href="address.html" OnMouseOver="window.status=' Contato'; return true">contato</a>
<hr size=1>
    </td></tr>
</table>


<table width=100% cellpadding=5 cellspacing=0>
<tr bgcolor="#fedea0">
	<th bgcolor="#cc9966"><b>PARTE 1</b></span></th>
	<th><a class="menu" href="logo2.html">PARTE 2</a></th>
	<th><a class="menu" href="logo3.html">PARTE 3</a></th>
	<th><a class="menu" href="logo4.html">PARTE 4</a></th>
	<th><a class="menu" href="logo5.html">PARTE 5</a></th>
</tr>
</table>

<h1><hr size=1>
O Logo é uma tecnologia obsoleta?<hr size=1></h1>

<p class=olho>
Esta &eacute; uma discuss&atilde;o que foi mantida na <a
href="news:comp.lang.logo">comp.lang.logo</a> (e na correspondente 
lista de discuss&atilde;o por e-mail de 16 de novembro a 2 de 
dezembro, em 1998. A discuss&atilde;o, intitulada <a
href="http://el.www.media.mit.edu/logo-foundation/" target=new_window>O "Logo é uma
tecnologia obsoleta?",</a> iniciou-se atrav&eacute;s da seguinte
mensagem:

<p class=autor>
De Ken Kahn:

<p>
Eu me recordo de um encontro de um grupo de Logo no MIT em 1977 no
qual Seymour Papert descreveu o Logo como uma tentativa de tomar as 
melhores id&eacute;ias da ci&ecirc;ncia da computa&ccedil;&atilde;o e torn&aacute;-las acess&iacute;veis para as crian&ccedil;as. A maioria daquelas id&eacute;ias vieram da linguagem de programa&ccedil;&atilde;o Lisp. Eu penso que essa foi uma escolha admir&aacute;vel quando foi feita, h&aacute; trinta anos. 

<p>
A ci&ecirc;ncia da computa&ccedil;&atilde;o avan&ccedil;ou e o Logo dificilmente sofreu qualquer transforma&ccedil;&atilde;o.
Realmente, a LCSI Microworlds Logo acrescenta algumas
cria&ccedil;&otilde;es de interface de usu&aacute;rio agrad&aacute;veis e uma forma muito aperfei&ccedil;oada de rodar programas em paralelo. (Programas concorrentes n&atilde;o podem realmente ser sincronizados e podem apenas se comunicar atrav&eacute;s de vari&aacute;veis globais.)
A StarLogo toma de empr&eacute;stimo id&eacute;ias da
ci&ecirc;ncia da computa&ccedil;&atilde;o, mas seu modelo SIMD de computa&ccedil;&atilde;o n&atilde;o &eacute; flex&iacute;vel o suficiente para a ampla variedade de coisas que as crian&ccedil;as
provavelmente desejar&atilde;o que os programas de computa&ccedil;&atilde;o fa&ccedil;am.
Ela &eacute; uma boa coisa apenas quando lida com problemas que s&atilde;o, naturalmente, "dados paralelos". A ObjectLogo e a MultiLogo foram tentativas de tomar de empr&eacute;stimo da ci&ecirc;ncia da computa&ccedil;&atilde;o, respectivamente, programa&ccedil;&atilde;o orientada para objetos e processamento paralelo. Mas elas
n&atilde;o conseguiram seus objetivos.

<p>
A Logo foi uma boa tentativa de "planejamento para crian&ccedil;as" das id&eacute;ias da Lisp.
E mais aplica&ccedil;&otilde;es modernas do Logo perduraram um pouco incluindo menus, bot&otilde;es, mouse, janelas e coisas semelhantes. Mas aqui a Logo est&aacute; tentanto apenas compreender sistemas como o Visual Basic.
E ambos os sistemas s&atilde;o falhos quando comparados &agrave; facilidade de uso das interfaces do usu&aacute;rio em computadores e videogames.

<p>
Durante os &uacute;ltimos 20 anos eu tentei, por quatro vezes, criar um novo e melhor sistema de programa&ccedil;&atilde;o para crian&ccedil;as que compartilhasse a vis&atilde;o pedag&oacute;gica/epistemol&oacute;gica/construtivista do Logo. Todas as vezes eu tentei seguir os objetivos originais do Logo atrav&eacute;s do "planejamento para crian&ccedil;as" das melhores id&eacute;ias da ci&ecirc;ncia da computa&ccedil;&atilde;o.
Primeiramente eu tentei introduzir programa&ccedil;&atilde;o orientada para objetos (o Smalltalk 72 estava fazendo o mesmo, mas era um segredo corporativo naquela &eacute;poca). Ent&atilde;o, a programa&ccedil;&atilde;o l&oacute;gica. Depois, a programa&ccedil;&atilde;o visual.

<p>
O ToonTalk (<a href="http://www.toontalk.com/">www.toontalk.com</a>)
&eacute; minha tentativa mais recente. Ele &eacute;
baseado no que eu chamo de "programa&ccedil;&atilde;o animada", na qual a crian&ccedil;a
faz toda a sua programa&ccedil;&atilde;o atrav&eacute;s da manipula&ccedil;&atilde;o de objetos concretos
dentro de um mundo animado similar a um game. O Toon Talk &eacute; uma
linguagem de uso geral na qual a crian&ccedil;a programa treinando rob&ocirc;s, dando
mensagens para que p&aacute;ssaros as entreguem, manipulando caixas, grupos
de textos e de n&uacute;meros, utilizando ferramentas animadas, carregando
caminh&otilde;es, entre outras coisas. A crian&ccedil;a &eacute; um personagem neste mundo e
pode at&eacute; mesmo voar em seu helic&oacute;ptero para viajar entre casas ou para
ter uma vista geral do andamento de sua computa&ccedil;&atilde;o.

<p>
O Toon Talk toma de empr&eacute;stimo id&eacute;ias da ci&ecirc;ncia da computa&ccedil;&atilde;o acerca
de como programar com processos independentes de comunica&ccedil;&atilde;o. Tudo
ocorre em paralelo no Toon Talk. Existem modos de expressar a gera&ccedil;&atilde;o,
comunica&ccedil;&atilde;o, sincroniza&ccedil;&atilde;o e t&eacute;rmino de processos. Ele tamb&eacute;m toma
empr&eacute;stimos da pesquisa de programa&ccedil;&atilde;o visual e demonstrativa.

<p>
A evid&ecirc;ncia aned&oacute;tica &eacute; que as crian&ccedil;as apreciam o Toon Talk e o dominam. (Vide <a href="http://www.toontalk.com/English/users.htm">www.toontalk.com/English/users.htm</a>)
Um grande projeto de pesquisa pan-europeu acabou de se iniciar no princ&iacute;pio do m&ecirc;s, que ir&aacute; construir o que n&oacute;s chamamos
"playgrounds" sobre o Toon Talk e a Logo (vide  <a href="http://www.ioe.ac.uk/playground">www.ioe.ac.uk/playground</a>). Ele planeja fazer estudos cuidadosos
acerca de crian&ccedil;as utilizando ambos os sistemas. Eu estou quase apostando que o Toon Talk despontar&aacute; primeiro.

<p>
Eu penso que o Logo &eacute; uma grande coisa &#150; apenas creio que
poderia haver muito mais do que ele &eacute;. 

<p>
Sauda&ccedil;&otilde;es,<br>
-Ken 

<p><hr size=1>

<p class=autor>De Ken Kahn:

<p>
Eu recebi uma r&eacute;plica ao meu mail de Wen Su (<a
href="mailto:wens@ncct.sps.mot.com">wens@ncct.sps.mot.com</a>) e com a permiss&atilde;o dele estou enviando sua mensagem e minha
resposta a ela. 

<p class=reply>
Wen Su escreveu: <br>
Deveria apenas a nova gera&ccedil;&atilde;o de programa&ccedil;&atilde;o concorrente para
aprendizado e programa&ccedil;&atilde;o de estilo declarativo omitir
completamente a programa&ccedil;&atilde;o seq&uuml;encial "tradicional"? 

<p class=reply>
Esta &eacute; uma grande quest&atilde;o. Se a resposta for sim, a abordagem do 
Toon Talk &eacute; definitivamente o caminho a se seguir, n&atilde;o havendo 
nenhuma d&uacute;vida a respeito. Em minha opini&atilde;o, &eacute; mais f&aacute;cil para a 
maioria das pessoas adotar o estilo de programa&ccedil;&atilde;o declarativa do 
que o estilo de programa&ccedil;&atilde;o concorrente. Por exemplo, a SQL, 
como utilizada em bancos de dados, &eacute; declarativa. Ela come&ccedil;a a ser 
utilizada universalmente nos dias de hoje. Ningu&eacute;m poderia dizer que 
as bases de dados relacionais s&atilde;o, atualmente, lentas; as pessoas 
apenas se preocupam acerca da "produtividade" que ela tem para 
oferecer.

<p class=reply>
Esta &eacute; uma grande quest&atilde;o, eu concordo. Eu considero valioso que
as crian&ccedil;as aprendam diferentes paradigmas de programa&ccedil;&atilde;o. Entre eles est&atilde;o: 

<p class=reply>
1. Linguagens concorrentes orientadas para objetos como Toon
Talk. 2. Linguagens de procedimentos seq&uuml;enciais como o Logo. 3. Linguagens de programa&ccedil;&atilde;o l&oacute;gicas ou declarativas
como a Prolog. (Vide a recente mensagem de Brian Harvey. Eu deveria talvez clarificar que embora o Toon Talk tenha tomado de
empr&eacute;stimo muitas id&eacute;ias da programa&ccedil;&atilde;o l&oacute;gica, ele n&atilde;o possui a busca agrad&aacute;vel e as capacidades subjacentes de
rodar programas da Prolog que Brian descreveu.) 4. Paralelismo de dados como a StarLogo. 5.Outras. Talvez
programa&ccedil;&atilde;o funcional pura. Ou sistemas de produ&ccedil;&atilde;o como o Stagecast Creator (anteriormente conhecido como KidSim e
Cocoa). 

<p class=reply>
Embora eu creia que em um mundo ideal as crian&ccedil;as devessem
aprender todas estas diferentes formas de pensamento acerca da
programa&ccedil;&atilde;o, o mundo real tem recursos limitados. Se eu tivesse de
priorizar estas formas de pensar a respeito da programa&ccedil;&atilde;o, eu me
fixaria na ordem que listei acima. Outras pessoas podem preferir
outras ordens. Que crit&eacute;rios dever&iacute;amos empregar para decidir a
quest&atilde;o? Naturalidade? Generalidade? Escalabilidade? Eleg&acirc;ncia?
Popularidade atual entre os programadores profissionais?
Popularidade entre cientistas da computa&ccedil;&atilde;o? Outra quest&atilde;o &eacute;: qual
delas deve ser aprendida primeiro? E qual delas tem as melhores
chances de ser &uacute;til para compreender ou solucionar problemas em
outros dom&iacute;nios al&eacute;m da computa&ccedil;&atilde;o?

<p class=reply>
Quando eu li uma mensagem em seu web site: "Axioma 1: quanto
mais voc&ecirc; sabe sobre C/C++, menos voc&ecirc; sabe acerca do Toon
Talk", eu sorri, mas n&atilde;o posso concordar mais do que isso. Isto me
recorda um ditado de tempos atr&aacute;s, quando C++ e object C estavam
sendo apresentadas: uma pessoa que gosta de Object C tende a
n&atilde;o apreciar C++, e viceversa. Eu espero que algo similar n&atilde;o
ocorra para Logo e Toon Talk: uma pessoa que aprecia Logo tende
a n&atilde;o gostar do Toon Talk, e vice-versa. Isso &eacute; apenas uma piada,
aqui.

<p class=reply>
Falando s&eacute;rio, entretanto, eu creio que existe uma for&ccedil;a que opera
atr&aacute;s disto: muitas pessoas "m&eacute;dias" tendem a gostar do que j&aacute;
conhecem, mesmo embora o que elas j&aacute; conhecem n&atilde;o seja t&atilde;o
bom quanto a coisa nova. Se isto for verdadeiro, tal fato trabalhar&aacute;
contra a aceita&ccedil;&atilde;o do Toon Talk, pois as id&eacute;ias do Logo s&atilde;o mais
familiares para a maioria das pessoas (especialmente para os
assim chamados professores de tecnologia). Por outro lado, o Toon
Talk pode ser mais atraente para as crian&ccedil;as. Se Toon Talk puder
ser t&atilde;o divertido quanto, digamos, SNE's ZELDA LTP, ou o Zelda-64
que ser&aacute; lan&ccedil;ado em uma semana ou duas, ele definitivamente
poder&aacute; ganhar a "guerra". Mas aqueles "cachorros velhos" da
tecnologia (talvez eu seja um deles, pois fui treinado para ser um
programador C) podem estar no caminho, e seja necess&aacute;rio
encontrar uma estrat&eacute;gia para faz&ecirc;-los se sentir em casa neste novo ambiente. 

<p class=reply>
Eu concordo que muitas pessoas apreciam o que elas j&aacute; conhecem.
Isto pode significar que os professores n&atilde;o dar&atilde;o ao Toon Talk a
oportunidade que ele merece. Mas que voc&ecirc; destaque o que atrai as
crian&ccedil;as tamb&eacute;m &eacute; importante aqui. O Nintendo SNES's Zelda foi
uma fonte de id&eacute;ias e inspira&ccedil;&atilde;o para a constru&ccedil;&atilde;o do Toon Talk. Eu
n&atilde;o imagino que me aproximei do charme e apelo daquele jogo, mas
creio que me aproximei mais do que qualquer outro programa
"educacional" de que eu tenha conhecimento.

<p class=reply>
Esta &eacute; apenas a reflex&atilde;o de um novato. Eu ainda estou lendo os
dados acerca do Toon Talk em seu web site e posso decidir a
solicitar uma c&oacute;pia dele. Meu filho de 10 anos de idade est&aacute;
familiarizado com o MicroWorlds e posso desejar que ele jogue Toon
Talk algum dia. Zelda LTP no SNS foi seu jogo amado quando ele
tinha cerca de 7 anos. Nestes dias, ele tem jogado os assim
chamados jogos de estrat&eacute;gia em tempo real no PC.

<p class=reply>
Sauda&ccedil;&otilde;es, <br>
- Wen Su 

<p>
Grato por seus criteriosos coment&aacute;rios. 

<p>
Grato, <br>
-ken kahn 

<p><hr size=1>

<p>De Ehud Lamm:

<p>"Toon Talk versus Logo". Antes de dizer mais uma palavra, devo
admitir que ainda n&atilde;o chequei o site de Toon Talk. Mas...<br>
<br>
Certa vez eu pensei em fazer um pequeno experimento e escrever
um artigo comparando como as pessoas "pensam" com o TIM ( The
Incredible Machine, um jogo de computador) e como elas pensam
com o Logo.<br>
<br>
Eu acredito que al&eacute;m de tudo o mais, uma das maiores for&ccedil;as do
Logo &eacute; que ele &eacute; uma linguagem. <br>
<br>
Quando eu considero o modo pelo qual meu pensamento se
transformou atrav&eacute;s dos anos, creio que o ponto mais crucial foi a
compreens&atilde;o do conceito de LINGUAGEM. Este conceito, e a
sensa&ccedil;&atilde;o intuitiva que eu tenho dele, me auxiliaram a estudar ci&ecirc;ncia
da computa&ccedil;&atilde;o e tamb&eacute;m a refletir sobre outras quest&otilde;es. O Logo foi
uma das minhas primeiras exposi&ccedil;&otilde;es &agrave; linguagem. Na realidade,
uma linguagem de computa&ccedil;&atilde;o e n&atilde;o uma l&iacute;ngua humana, mas n&atilde;o
menos uma linguagem onde voc&ecirc; tem de tentar colocar uma sintaxe
linear em suas id&eacute;ias. Um sistema no qual a sem&acirc;ntica est&aacute; unida &agrave;
sintaxe.<br>
<br>
Eu tamb&eacute;m penso que sendo uma linguagem de computador, o Logo
presta aux&iacute;lio ao fornecer um bom m&eacute;todo para estruturar algoritmos
em partes auto-contidas, e na constru&ccedil;&atilde;o de estruturas complexas.<br>
<br>
Eu procurei por outras id&eacute;ias ( e h&aacute; muitas id&eacute;ias na tentativa de
descobrir um m&eacute;todo mais adequado para programar um
computador, al&eacute;m de utilizar uma linguagem de computador), e fiquei
sempre insatisfeito. Eu queria a flexibilidade, generalidade e
eleg&acirc;ncia do Logo. <br>
<br>
Eu penso que a grande coisa acerca do Logo &eacute; que ela n&atilde;o &eacute;
realmente um ambiente protetor. Ela &eacute; REAL. Voc&ecirc; pode obter
labirintos infinitos, voc&ecirc; pode causar danos. Voc&ecirc; tem a coisa real
sob suas m&atilde;os. As crian&ccedil;as n&atilde;o deveriam pagar por menos. <br>
<br>
(Nota: Este texto n&atilde;o &eacute; contra o Toon Talk, sobre o qual, como disse,
n&atilde;o sei nada. &Eacute; apenas um coment&aacute;rio geral sobre as linguagens de
computador como sendo superiores a qualquer outra forma de
ensinar as crian&ccedil;as atrav&eacute;s de computadores). <br>
<br>
( Segunda Nota. Isto est&aacute; de certa forma conectado ao tema do
aprendizado "Hands-On". Uma curta exposi&ccedil;&atilde;o sobre este t&oacute;pico
pode ser encontrada nos arquivos de meu Web site.) <br>
<br>
Ehud Lamm <a href="mailto:mslamm@mscc.huji.ac.il">mslamm@mscc.huji.ac.il</a><br>
<a href="http://www2.cybercities.com/e/ehud">http://www2.cybercities.com/e/ehud</a> - Algo do trabalho de MIScologista.


<p><br>
<hr size=1>

<p>De Ken Kahn:

<p>Ehud Lamm escreveu na mensagem...<br>
"Eu Certa vez eu pensei em fazer um pequeno experimento e
escrever um artigo comparando como as pessoas "pensam" com o
TIM ( The Incredible Machine, um jogo de computador) e como elas
pensam com o Logo."<br>
&gt;<br>
Parece interessante. Eu o lerei, se voc&ecirc; escrev&ecirc;-lo.<br>
<br>
"Eu acredito que al&eacute;m de tudo o mais, uma das maiores for&ccedil;as do
Logo &eacute; que ele &eacute; uma linguagem.<br>
&gt;<br>
Quando eu considero o modo pelo qual meu pensamento se
transformou atrav&eacute;s dos anos, creio que o ponto mais crucial foi a
compreens&atilde;o do conceito de LINGUAGEM. Este conceito, e a
sensa&ccedil;&atilde;o intuitiva que eu tenho dele, me auxiliaram a estudar ci&ecirc;ncia
da computa&ccedil;&atilde;o e tamb&eacute;m a refletir sobre outras quest&otilde;es. O Logo foi
uma das minhas primeiras exposi&ccedil;&otilde;es &agrave; linguagem. Na realidade,
uma linguagem de computa&ccedil;&atilde;o e n&atilde;o uma l&iacute;ngua humana, mas n&atilde;o
menos uma linguagem onde voc&ecirc; tem de tentar colocar uma sintaxe
linear em suas id&eacute;ias. Um sistema no qual a sem&acirc;ntica est&aacute; unida &agrave;
sintaxe."
&gt;<br><br>
Aqui &eacute; talvez o ponto em que precisamos de alguns fil&oacute;sofos para
nos aprofundar. Por algum tempo, linguagens de sinais n&atilde;o eram
aceitas totalmente como linguagens- e agora s&atilde;o. As pessoas falam
acerca da linguagem de um filme ( referindo-se &agrave; sintaxe de
close-ups, cortes, dissolu&ccedil;&otilde;es, etc.) &Eacute; o Toon Talk realmente uma
linguagem? Ele tem uma sintaxe, muito menos uma linear? Eu n&atilde;o
estou certo que linguagem &eacute; a melhor palavra para descrever Toon
Talk, mas eu estou seguro que ele compartilha as propriedades
interessantes que as linguagens de programa&ccedil;&atilde;o possuem.<br>
<br>
"Eu tamb&eacute;m penso que sendo uma linguagem de computador, a
Logo presta aux&iacute;lio ao fornecer um bom m&eacute;todo para estruturar
algoritmos em partes auto-contidas, e na constru&ccedil;&atilde;o de estruturas
complexas."<br>
&gt;<br>
Idem para Toon Talk.<br>
<br>
"Eu procurei por outras id&eacute;ias ( e h&aacute; muitas id&eacute;ias na tentativa de
descobrir um m&eacute;todo mais adequado para programar um
computador, al&eacute;m de utilizar uma linguagem de computador), e fiquei
sempre insatisfeito. Eu queria a flexibilidade, generalidade e
eleg&acirc;ncia do Logo."<br>
&gt;<br>
Toon Talk &eacute; flex&iacute;vel e gen&eacute;rico. Eu o considero elegante tamb&eacute;m.<br>
<br>
"Eu penso que a grande coisa acerca do Logo &eacute; que ela n&atilde;o &eacute;
realmente um ambiente protetor. Ela &eacute; REAL. Voc&ecirc; pode obter
labirintos infinitos, voc&ecirc; pode causar danos. Voc&ecirc; tem a coisa real
sob suas m&atilde;os. As crian&ccedil;as n&atilde;o deveriam pagar por menos."
<br>
&gt;<br>
Eu concordo e Toon Talk &eacute; real da mesma forma que Logo o &eacute;.<br>
<br>
Sauda&ccedil;&otilde;es,<br>
<br>
-ken kahn (<a href="http://www.toontalk.com/">www.toontalk.com</a>)

<p><hr size=1>

<p>De Ehud Lamm:

<p>Na Quinta-feira, 26 de Novembro de 1998, Ken Kahn escreveu:<br>
<br>
" Ehud Lamm escreveu na mensagem...<br>

"Eu Certa vez eu pensei em fazer um pequeno experimento e
escrever um artigo comparando como as pessoas "pensam" com o
TIM ( The Incredible Machine, um jogo de computador) e como elas
pensam com o Logo."
<br>
&gt; &gt;<br>
Parece interessante. Eu o lerei, se voc&ecirc; escrev&ecirc;-lo."<br>
<br>
Talvez eu tenho tempo para escrev&ecirc;-lo. Se o fizer, voc&ecirc; saber&aacute;!<br>
<br>
&gt; <br>
"Eu acredito que al&eacute;m de tudo o mais, uma das maiores for&ccedil;as do
Logo &eacute; que ele &eacute; uma linguagem.
&gt; &gt;<br>
Quando eu considero o modo pelo qual meu pensamento se
transformou atrav&eacute;s dos anos, creio que o ponto mais crucial foi a
compreens&atilde;o do conceito de LINGUAGEM. Este conceito, e a
sensa&ccedil;&atilde;o intuitiva que eu tenho dele, me auxiliaram a estudar ci&ecirc;ncia
da computa&ccedil;&atilde;o e tamb&eacute;m a refletir sobre outras quest&otilde;es. O Logo foi
uma das minhas primeiras exposi&ccedil;&otilde;es &agrave; linguagem. Na realidade,
uma linguagem de computa&ccedil;&atilde;o e n&atilde;o uma l&iacute;ngua humana, mas n&atilde;o
menos uma linguagem onde voc&ecirc; tem de tentar colocar uma sintaxe
linear em suas id&eacute;ias. Um sistema no qual a sem&acirc;ntica est&aacute; unida &agrave;
sintaxe."

Aqui &eacute; talvez o ponto em que precisamos de alguns fil&oacute;sofos para
nos aprofundar. Por algum tempo, linguagens de sinais n&atilde;o eram
aceitas totalmente como linguagens- e agora s&atilde;o. As pessoas falam
acerca da linguagem de um filme ( referindo-se &agrave; sintaxe de
close-ups, cortes, dissolu&ccedil;&otilde;es, etc.) &Eacute; o Toon Talk realmente uma
linguagem? Ele tem uma sintaxe, muito menos uma linear? Eu n&atilde;o
estou certo que linguagem &eacute; a melhor palavra para descrever Toon
Talk, mas eu estou seguro que ele compartilha as propriedades
interessantes que as linguagens de programa&ccedil;&atilde;o possuem."
<br>
<br>
Eu tendo a me considerar mais como fil&oacute;sofo do que qualquer outra
coisa ( mesmo sendo meu campo de trabalho e estudos a ci&ecirc;ncia da
computa&ccedil;&atilde;o, at&eacute; agora.)<br>
<br>
Eu n&atilde;o tentarei definir o que a linguagem &eacute;, desde que essa &eacute;
realmente uma quest&atilde;o &aacute;rdua. Mas eu penso que algumas das
observa&ccedil;&otilde;es s&atilde;o inadequadas.<br>
<br>
A linguagem de sinais era considerada uma forma n&atilde;o-verbal,
abaixo da comunica&ccedil;&atilde;o humana, at&eacute; que se atentasse para as
pessoas que tentassem aprend&ecirc;-la, e se descobrisse que ela possui
as complexidades das outras linguagens. Veja o livro de Oliver Sack
a respeito, e se voc&ecirc; estiver interessado em mais detalhes, vide
Ursula Bellugi (A grafia est&aacute; incorreta, tenho certeza. Desculpe)
<br>
<br>
Mas n&atilde;o &eacute; imposs&iacute;vel ver claramente quando o termo linguagem &eacute;
usado literalmente e quando &eacute; utilizado metaforicamente. "A
Linguagem do Cinema" n&atilde;o &eacute; o mesmo que a "Linguagem utilizada
na Fran&ccedil;a". Os conceitos n&atilde;o s&atilde;o os mesmos.
<br>
<br>
O que eu considero importante em linguagens de programa&ccedil;&atilde;o &eacute;
que tenham uma sintaxe clara ( mesmo quando gr&aacute;fica) E sem&acirc;ntica
clara.
 <br>
<br>
Eu tamb&eacute;m quero algumas das coisas com as quais estamos
habituados em linguagens de programa&ccedil;&atilde;o, tais como suporte para
estruturas de controle comuns ( Looping, ramifica&ccedil;&otilde;es, recurs&atilde;o), e
estruturas de dados ( tabelas s&atilde;o excelentes!)
<br>
<br>
Uma das caracter&iacute;sticas b&aacute;sicas que t&ecirc;m as linguagens &eacute; a
capacidade para construir estruturas complexas a partir da base.
Voc&ecirc; pode utilizar palavras em senten&ccedil;as, senten&ccedil;as em par&aacute;grafos,
etc... Em linguagens de programa&ccedil;&atilde;o voc&ecirc; pode definir
procedimentos e utiliz&aacute;-los ao inv&eacute;s de codific&aacute;-los novamente. Eu
considero esse aspecto de de gerenciar o pensamento ( pala
defini&ccedil;&atilde;o de "conceitos") e a complexidade como altamente
importante. Eu imagino que &eacute; uma das coisas b&aacute;sicas que eu
aprendi do Logo.
 <br>
<br>
Ehud Lamm&nbsp;&nbsp;&nbsp;&nbsp; <a href="mailto:mslamm@mscc.huji.ac.il">mslamm@mscc.huji.ac.il</a><br>
<a href="http://www2.cybercities.com/e/ehud/">http://www2.cybercities.com/e/ehud/</a>
&nbsp;&nbsp;&nbsp; Assine a mailing list hoje! <br>


<p><hr size=1>

<p>De Dale R. Reed:

<p>"Eu penso que o Logo &eacute; uma grande coisa - apenas creio que poderia haver
muito mais do que ele &eacute;." 

<p>Ken, eu acabei de surfar por seu site e encomendar o Toon Talk. 

<p>Mas eu devo admitir que eu ( um engenheiro eletromagn&eacute;tico aposentado de 63
anos de idade) tenho estado mais interessado em criar fractais e problemas e
padr&otilde;es moir&eacute; e outros objetos que vi na M&atilde;e Natureza ou imaginei. E eu n&atilde;o
acho que tenha mudado muito nesses julgamentos nos &uacute;ltimos 50 anos. 

<p>Eu me mantive pensando em tra&ccedil;ar problemas com o Logo exatamente como
eu costumava pensar acerca de correntes el&eacute;tricas que eu estava projetando e
sendo respons&aacute;vel pela prote&ccedil;&atilde;o contra a sua redistribui&ccedil;&atilde;o (em freq&uuml;&ecirc;ncia e
tempo) atrav&eacute;s do composto de grafite e do estabilizador horizontal de alum&iacute;nio
do fly- by-wire 777 projetado. As correntes el&eacute;tricas no passado e agora os
problemas e padr&otilde;es moir&eacute; moveram minha mente durante noites de sono
inquietas. 

<p>Eu n&atilde;o aprecio jogos e n&atilde;o acho o Microworlds t&atilde;o divertido. Era Ok quando
meu neto pequeno vivia pr&oacute;ximo e costumava sentar em meu colo e pod&iacute;amos
criar mundos imagin&aacute;rios com c&atilde;es e &aacute;rvores e luas, mas ele mora agora h&aacute;
duas de autom&oacute;vel e est&aacute; crescendo muito rapidamente, portanto o que eu
desejo atualmente &eacute; um modo eficiente e poderoso de criar meus pr&oacute;prios
projetos. 

<p>Alguma coisa que force minha mente a prestar aten&ccedil;&atilde;o a detalhes e me ofere&ccedil;a
a capacidade de criar algo interessante que Katy e eu possamos apreciar. O
MSWLogo funciona muito bem para os meus prop&oacute;sitos. Eu aposto que n&atilde;o
sou t&atilde;o diferente de muitos jovens. 

<p>Mas Ken, eu aprecio coisas novas e darei uma chance a Toon Talk. 

<p>Dale --- $ <a href="mailto:dale-reed@worldnet.att.net">dale-reed@worldnet.att.net</a>&nbsp;
Seattle, Washington U.S.A. $ 

<p><hr size=1>

<p>De Ray Catzel:

<p>Eu sou um &aacute;vido defensor do Microworlds devido ao consider&aacute;vel
sucesso que experimentei aprimorando centenas de crian&ccedil;as
atrav&eacute;s dos &uacute;ltimos anos. 

<p>Uma das grandes vantagens do Microworlds &eacute; sua capacidade de
atravessar o intervalo entre objetos que s&atilde;o significativos para as
crian&ccedil;as e os c&oacute;digos de programas. Voc&ecirc; pode prosseguir com
c&oacute;digos m&iacute;nimos para os mais jovens e proporcionar projetos muito
desafiadores (e mais abstratos) para as crian&ccedil;as mais velhas. 

<p>Eu dei uma olhada r&aacute;pida no Toon Talk e n&atilde;o encontrei a
capacidade de migrar suavemente de "dar instru&ccedil;&otilde;es aos objetos"
para codificar a sintaxe. 

<p>Eu n&atilde;o tenho cr&iacute;ticas &agrave; "velha" tecnologia se ela &eacute; est&aacute;vel e atinge os
objetivos de aprendizagem. Em paralelo, "smarallel"- voc&ecirc; realmente
cr&ecirc; que as crian&ccedil;as se importam em que fundo os programas
rodam? 

<p>Divirta-se! 

<p>Ray Catzel, Presidente, ComputerPals Inc. 

<p>Web Site: <a href="http://www.computerpals.on.ca/~pals">http://www.computerpals.on.ca/~pals</a>


<p>Email: <a href="mailto:learn@computerpals.on.ca">learn@computerpals.on.ca</a>


<p><hr size=1>

<p>De Ken Kahn:

<p>ROY CATZEL escreveu: <br>
" Uma das grandes vantagens do Microworlds &eacute; sua capacidade de
atravessar o intervalo entre objetos que s&atilde;o significativos para as
crian&ccedil;as e os c&oacute;digos de programas. Voc&ecirc; pode prosseguir com
c&oacute;digos m&iacute;nimos para os mais jovens e proporcionar projetos muito
desafiadores (e mais abstratos) para as crian&ccedil;as mais velhas.
<br>
&gt; <br>
Eu dei uma olhada r&aacute;pida no Toon Talk e n&atilde;o encontrei a
capacidade de migrar suavemente de "dar instru&ccedil;&otilde;es aos objetos"
para codificar a sintaxe." <br>
&gt; 

<p>Eu concordo que se desejem programas que cubram uma vasta
gama de capacidades e ambi&ccedil;&otilde;es. Eu creio que Toon Talk faz isto
desde que algu&eacute;m pode simplesmente jogar com Toon Talk e talvez
colocar em conjunto alguns objetos constru&iacute;dos por outros ou explorar
s&eacute;rios t&oacute;picos da ci&ecirc;ncia da computa&ccedil;&atilde;o-por exemplo construindo
uma esp&eacute;cie de r&aacute;pido programa paralelo que &eacute; subjacente de forma
que algu&eacute;m pode ver a totalidade da computa&ccedil;&atilde;o como significativa.
 

<p>Mas eu n&atilde;o atribuo muito valor &agrave; "codificar a sintaxe". O que eu
valorizo s&atilde;o os conceitos subjacentes-vari&aacute;veis, recurs&atilde;o,
estruturas de dados, condicionais, etc. Isso aparece se voc&ecirc; procurar
seriamente se h&aacute; um meio de ultrapassar o intervalo entre Toon Talk
e o c&oacute;digo de sintaxe.
 

<p><br>
Toon Talk pode gerar um aplicativo Java ou o que quer que voc&ecirc;
tenha programado em Toon Talk. <br>
&gt; 

<p>E Jim Muller escreveu: <br>
"Afirma&ccedil;&atilde;o fascinante...mas voc&ecirc; pode colocar outra quest&atilde;o. Por
que Logo deve ser "mais do que ele &eacute;?"


<p><br>
"Quando voc&ecirc; v&ecirc; a m&aacute;gica que o Logo pode acrescentar ao
auto-conhecimento de uma crian&ccedil;a pequena, o que mais n&oacute;s
poder&iacute;amos pedir?"


<p>Eu posso pensar em duas repostas: 

<p>   1.Uma linguagem de programa&ccedil;&atilde;o &eacute; algo para "pensar com".
     Pensamento com procedimento sequencial e vari&aacute;veis globais
     &eacute; o que o Logo oferece. Eu estive pensando desta forma
     desde que aprendi a programar em 1968. Mas foi maravilhoso
     quando em 1973 eu aprendi ( a maior parte com um professor
     do MIT chamado Carl Hewitt) a pensar em termos do que ele
     chamava atores-objetos concorrentes com passagem de
     mensagens. Ent&atilde;o em 1980 eu aprendi com o Prolog a pensar
     em programas declarativamente em termos de predicados e
     demonstra&ccedil;&atilde;o de teoremas. Prolog concorrente e seus
     sucessores me ensinaram a pensar com atores e l&oacute;gica em
     conjunto. Eu n&atilde;o quero afirmar que uma forma de pensar
     domina completamente as outras. Eu apenas quero despertar
     a comunidade Logo para o fato de que h&aacute; muito mais que pode
     ser "tomado de empr&eacute;stimo" da ci&ecirc;ncia da computa&ccedil;&atilde;o. 
   2.Em 1994 eu li um artigo de Sharon Yader em Logo Exchange
     intitulado "Desencorajado? ...N&atilde;o se desespere!". Ela
     perguntava &agrave; uma classe de calouros na universidade acerca
     de sua exposi&ccedil;&atilde;o ao Logo. Uma grande percentagem havia
     sido exposta e quase todos relataram a experi&ecirc;ncia como
     negativa. Nos anos 70 eu ensinei logo e tamb&eacute;m observei os
     resultados do ensino de outras pessoas no grupo de Logo do
     MIT. Era maravilhoso. Era "m&aacute;gico". Minha teoria de como
     conciliar estes dois fatos &eacute; que as crian&ccedil;as podem obter um
     n&iacute;vel excelente aprendendo Logo se ele &eacute; ensinado por um
     professor que compreende profundamente tanto crian&ccedil;as
     quanto programa&ccedil;&atilde;o. Eu penso que ao pesquisa informal de
     Sharon indica que tais professores s&atilde;o raros.
 

<p>Ent&atilde;o, como podemos dar &agrave;s crian&ccedil;as o poder e a m&aacute;gica da
programa&ccedil;&atilde;o quando tais professores n&atilde;o est&atilde;o dispon&iacute;veis?
Fazendo um ambiente de software no qual as crian&ccedil;as possam
descobrir e aprender programa&ccedil;&atilde;o por si mesmas. Toon Talk, eu
afirmo, &eacute; tal ambiente. As crian&ccedil;as podem aprender Toon Talk
explorando um ambiente seguro, auto-revelador, abrindo seu
caminho atrav&eacute;s de um jogo de quebra-cabe&ccedil;as interativo, assistindo
demos com narra&ccedil;&atilde;o, obtendo ajuda de um agente do programa, e
outras coisas. [ Eu escrevi um cap&iacute;tulo em um livro que acabou de ser
publicado este m&ecirc;s acerca deste t&oacute;pico. O livro &eacute; "The Design of
Children's Technology", editado por alison Druin, publicado por
Morgan Kaufman]. As primeiras indica&ccedil;&otilde;es s&atilde;o que isto realmente
funciona (vide <a href="http://www.toontalk.com/English/users.htm">www.toontalk.com/English/users.htm</a>). 

<p>E Ray escreveu: <br>
"Em paralelo, "smarallel"- voc&ecirc; realmente cr&ecirc; que as crian&ccedil;as se
importam em que fundo os programas rodam?" 

<p>Eu suponho que tenha j&aacute; respondido parcialmente esta quest&atilde;o no
ponto n&uacute;mero 1 acimq. Mas o paralelismo n&atilde;o &eacute; apenas outra
ferramenta de pensamento, ele &eacute; tamb&eacute;m uma melhor forma de
programa&ccedil;&atilde;o. Por exemplo, um dos demos de Toon Talk &eacute; construir
um jogo de Pingue-pongue. Eu estou convencido que a melhor
maneira de estruturar programas &eacute; atrav&eacute;s de muitos processos
independendentes ( mas que se comunicam e est&atilde;o sincronizados).
No exemplo do pingue-pongue, a bola, a raquete, e o marcador de
escore s&atilde;o, cada um, programas paralelos. O mundo ao redor de
n&oacute;s est&aacute; rodando em paralelo e tentar copi&aacute;-lo ou simul&aacute;-lo
sequencialmente &eacute; desnecessariamente dif&iacute;cil.
 

<p>Sauda&ccedil;&otilde;es, 

<p>-ken kahn 

<p><hr size=1>

<p>De Brian Harvey

<p>&quot;Ken Kahn&quot; &lt;<a
href="mailto:KenKahn@ToonTalk.com">KenKahn@ToonTalk.com</a>&gt; escreve: <br>
"Mas eu n&atilde;o atribuo muito valor &agrave; "codificar a sintaxe". O que eu
valorizo s&atilde;o os conceitos subjacentes-vari&aacute;veis, recurs&atilde;o,
estruturas de dados, condicionais, etc." 

<p>Eu concordo com isto, neste amplo n&iacute;vel de abstra&ccedil;&atilde;o. A quest&atilde;o &eacute;
qual nota&ccedil;&atilde;o ( falando de modo geral) torna as id&eacute;ias mais
acess&iacute;veis. Algo como uma condicional pode prazerosamente ser
representada pictoricamente. A recurs&atilde;o &eacute; um pouco mais dif&iacute;cil,
porque ( eu suponho) de forma a tornar algo auto-referente ela deve
ter um nome. A melhor vers&atilde;o pict&oacute;rica que j&aacute; vi &eacute; a antiga "slot
machine" de Radia Perlman, na qual os nomes dos procedimentos
eram cores, e eram invocados por cart&otilde;es coloridos. Eu considero a
tentativa das BBN Function Machines menos convincentes; voc&ecirc; tem
de perceber que uma caixa dentro de outra tem o mesmo nome, o
que n&atilde;o &eacute; realmente melhor do que o texto. Eu estarei interessado
em ver (amanh&atilde;) como Toon Talk o realiza-a documenta&ccedil;&atilde;o sem o
programa real me deixou muito confuso.
 

<p>Eu suponho que o texto receba golpes estes dias. N&oacute;s
costum&aacute;vamos n&atilde;o ter nada al&eacute;m de texto, e todos reagiram de
forma exagerada. O texto ainda &eacute; um meio realmente expressivo!
Mesmo para emo&ccedil;&otilde;es, deixemos os programas de computadores
sozinhos. 

<p><br>
"Pensar com procedimentos sequenciais e vari&aacute;veis globais &eacute; o que
Logo oferece".
 

<p>Ei, n&atilde;o &eacute; justo, Logo tem vari&aacute;veis locais! Mas eu concordo que
existem outros paradigmas de programa&ccedil;&atilde;o valiosos. 

<p><hr size=1>

<p>De Jim Muller:

<p>&gt;(snip) <br>
&gt; <br>
" Eu penso que o Logo &eacute; uma grande coisa - apenas creio que
poderia haver muito mais do que ele &eacute;." <br>
&gt; 

<p>Ken ==&gt; 

<p>"Afirma&ccedil;&atilde;o fascinante...mas voc&ecirc; pode colocar outra quest&atilde;o. Por
que Logo deve ser "mais do que ele &eacute;?" 

<p>"Quando voc&ecirc; v&ecirc; a m&aacute;gica que o Logo pode acrescentar ao
auto-conhecimento de uma crian&ccedil;a pequena, o que mais n&oacute;s
poder&iacute;amos pedir?" 

<p>Sauda&ccedil;&otilde;es...Jim Muller 

<p>Jim Muller THE GREAT LOGO ADVENTURE em <a
href="http://www.cyberramp.net/~jmul">http://www.cyberramp.net/~jmul</a> 

<p><hr size=1>

<p>De Ken Kahn

<p>Dale R.Reed escreveu <br>
&gt; <br>
"Ken, eu acabei de surfar por seu site e encomendar o Toon Talk."
<br>
Grato. Eu espero que voc&ecirc; o aprecie. 
 <br>
&gt; <br>
"Eu n&atilde;o aprecio jogos e n&atilde;o acho o Microworlds t&atilde;o divertido. Era
Ok quando meu neto pequeno vivia pr&oacute;ximo e costumava sentar em
meu colo e pod&iacute;amos criar mundos imagin&aacute;rios com c&atilde;es e &aacute;rvores
e luas, mas ele mora agora h&aacute; duas de autom&oacute;vel e est&aacute; crescendo
muito rapidamente, portanto o que eu desejo atualmente &eacute; um modo
eficiente e poderoso de criar meus pr&oacute;prios projetos."
 <br>
&gt; 

<p>Eu costumava apreciar muito os jogos antes que eu descobrisse a
programa&ccedil;&atilde;o de computadores. A programa&ccedil;&atilde;o &eacute; como um jogo,
apenas mais desafiadora e com o final em aberto. Enquanto eu
projetava o Toon Talk, eu descobri que os jogos eram uma grande
fonte de id&eacute;ias sobre como fazer as coisas mais simples ou mais
divertidas sem torn&aacute;-las sem interesse.


<p>" Alguma coisa que force minha mente a prestar aten&ccedil;&atilde;o a detalhes
e me ofere&ccedil;a a capacidade de criar algo interessante que Katy e eu
possamos apreciar. O MSWLogo funciona muito bem para os meus
prop&oacute;sitos. Eu aposto que n&atilde;o sou t&atilde;o diferente de muitos jovens."
 

<p><br>
Eu penso que a capacidade de "criar alguma coisa interessante"&eacute; a
coisa mais importante acerca de Logo e Toon Talk. 

<p>"Mas Ken, eu aprecio coisas novas e darei uma chance a Toon Talk." 

<p>Esta &eacute; uma boa atitude. 

<p>-ken kahn 

<p>

<hr size=1><div align=center>
<a class="menu" href="toontalk.html">início</a><span class=bola> &#0149;</span>
<a class="menu" href="search.html">busca</a><span class=bola> &#0149;</span>
<a class="menu" href="buy.html">compra</a><span class=bola> &#0149;</span>
<a class="menu" href="doc.html">manual</a><span class=bola> &#0149;</span>
<a class="menu" href="whatsnew.html">novidades</a><span class=bola> &#0149;</span>
<a class="menu" href="faq.html">dúvidas</a><span class=bola> &#0149;</span>
<a class="menu" href="support.html">suporte</a><span class=bola> &#0149;</span>
<a class="menu" href="free.html">download</a><span class=bola> &#0149;</span>
<a class="menu" href="press.html">imprensa</a><span class=bola> &#0149;</span>
<a class="menu" href="address.html">contato</a></div></td>

</tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->
