<html>
<head>
<title>ToonTalk - Você pode treinar rob&ocirc;s para cumprir suas ordens</title>
<link rel="stylesheet" type="text/css" href="../toontalk.css">
</head>

<body link="#0000ff" vlink="#800080" bgcolor="#ffffff">

<div align="center">
<a name="topo"></a>
<table width=468 cellspacing=0 cellpadding=0 border=0><tr><td>

<p>
<table width=460 cellspacing=0 cellpadding=0 border=0><tr><td>
<div align=center>
<a class="menu" href="toontalk.html" OnMouseOver="window.status=' In&iacute;cio'; return true">início</a><span class=bola> &#0149;</span>
<a class="menu" href="search.html" OnMouseOver="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<a class="menu" href="buy.html" OnMouseOver="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<a class="menu" href="doc.html" OnMouseOver="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<a class="menu" href="whatsnew.html" OnMouseOver="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<a class="menu" href="faq.html" OnMouseOver="window.status=' D&uacute;vidas'; return true">dúvidas</a><span class=bola> &#0149;</span>
<a class="menu" href="support.html" OnMouseOver="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<a class="menu" href="free.html" OnMouseOver="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<a class="menu" href="press.html" OnMouseOver="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<a class="menu" href="address.html" OnMouseOver="window.status=' Contato'; return true">contato</a>
<hr size=1>
    </td></tr>
</table>

<h2>Você pode treinar rob&ocirc;s para cumprir <br> suas ordens</h2>

<p>Dentro da <a href="Tooly.html">Porta-Treco</a> voc&ecirc; encontrar&aacute; uma grande pilha de rob&ocirc;s. Se voc&ecirc; 
retirar um ver&aacute; que ele tem uma <a href="bubble.html">mente</a> vazia. Voc&ecirc; pode come&ccedil;ar a treinar um rob&ocirc; novo colocando uma caixa nele.
Voc&ecirc; entrar&aacute; nos pensamentos do rob&ocirc; e o controlar&aacute;. Voc&ecirc; pode faz&ecirc;-lo apanhar coisas, usar ferramentas e colocar coisas.
Ele se lembrar&aacute; de tudo. Voc&ecirc; pode trein&aacute;-lo 
para retirar coisas, ou colocar coisas, em uma caixa, da qual ele se lembrar&aacute; qual era a abertura correta contando a partir do lado esquerdo dela.
Uma vez que voc&ecirc; tenha acabado de trein&aacute;-lo, pressione o bot&atilde;o <i>escape</i> (normalmente chamado <i>Esc</i>).

<p>Voc&ecirc; pode ent&atilde;o fazer o rob&ocirc; 
repetir o que o treinou para fazer, dando-lhe novamente a caixa. Quando ele 
tiver terminado, ele tentar&aacute; faz&ecirc;-lo de novo se a caixa ainda se ajustar &agrave; <a href="bubble.html">caixa em sua mente.</a>

<p><b>Dica.</b> Os rob&ocirc;s s&atilde;o realmente 
exigentes. Eles apenas trabalhar&atilde;o em uma caixa como aquela na sua mente. Felizmente, voc&ecirc; pode utilizar <a href="dusty.html">Asper</a> para aspirar as coisas de uma caixa em uma mente.
Uma boa id&eacute;ia &eacute; aspirar apenas o suficiente para fazer o rob&ocirc; trabalhar quando voc&ecirc; desejar que o fa&ccedil;a. Algumas vezes &eacute; mais f&aacute;cil aspirar a caixa da mente, expeli-la, alter&aacute;-la e ent&atilde;o coloc&aacute;-la de volta na mente.

<p><b>Equipes de rob&ocirc;s.</b> Voc&ecirc; pode fazer 
uma equipe de rob&ocirc;s colocando-os uns sobre os outros. Quando voc&ecirc; d&aacute; uma caixa &agrave; equipe, o rob&ocirc; na frente v&ecirc; se ela se ajusta &agrave; sua mente.
Se isso ocorre, ele come&ccedil;ar&aacute; a trabalhar nela e os outros membros da equipe sair&atilde;o do caminho. Se ela n&atilde;o se ajustar, ele a passar&aacute; para o pr&oacute;ximo rob&ocirc; da fila.
Se houver algo faltando na caixa ou houver um ninho onde o rob&ocirc; esperava por algo mais, ent&atilde;o ele esperar&aacute;. Quando a caixa for preenchida ou o ninho coberto, ele come&ccedil;ar&aacute; novamente.

<p><b>Dica.</b> Se voc&ecirc; deseja que o rob&ocirc; 
fa&ccedil;a alguma coisa apenas se algo <i>n&atilde;o</i> estiver l&aacute;, ent&atilde;o voc&ecirc; pode fazer que o rob&ocirc; na frente dele verifique algo como o n&uacute;mero 42 e que o rob&ocirc; atr&aacute;s dele n&atilde;o receba a caixa para trabalhar a menos que o n&uacute;mero seja diferente de 42.
  
<p>Em qualquer lugar que voc&ecirc; precise de um rob&ocirc; 
para trabalhar voc&ecirc; pode utilizar uma equipe de rob&ocirc;s. 
Portanto, voc&ecirc; pode colocar uma equipe em um <a href="truck.html">caminh&atilde;o</a>ou colocar uma equipe atr&aacute;s de uma <a href="picture.html">imagem.</a> 
A melhor maneira de desmanchar uma equipe &eacute; utilizar <a href="dusty.html">Asper</a> para separ&aacute;-los.

<p><b>Dica.</b> Se voc&ecirc; treinou um rob&ocirc; para fazer quase a coisa certa, mas se atrapalhou um pouco, voc&ecirc; pode ent&atilde;o re-treinar o rob&ocirc;. Apenas esvazie a caixa da mente do rob&ocirc;, coloque-a para fora e ent&atilde;o coloque a caixa no rob&ocirc; (tome cuidado para n&atilde;o coloc&aacute;-la de volta na mente do rob&ocirc;).
Voc&ecirc; re-entrar&aacute; na mente do rob&ocirc;, mas desta vez o rob&ocirc; ir&aacute; refazer aquilo que foi treinado at&eacute; que voc&ecirc; clique o mouse ou um bot&atilde;o do teclado. Ent&atilde;o, voc&ecirc; pode continuar o treinamento como de h&aacute;bito.

<p><b>Dica Avan&ccedil;ada.</b> Voc&ecirc; n&atilde;o pode treinar um rob&ocirc; para dar alguma coisa para outros rob&ocirc;s, mas voc&ecirc; pode treinar um rob&ocirc; para carregar um caminh&atilde;o com outros rob&ocirc;s.
Os cientistas da computa&ccedil;&atilde;o descreveriam isso dizendo que embora voc&ecirc; n&atilde;o possa fazer uma chamada de procedimento, voc&ecirc; pode fazer uma gera&ccedil;&atilde;o de processo mais geral. Se voc&ecirc; quer obter de volta alguma coisa dos rob&ocirc;s, ent&atilde;o combine-os para dar uma resposta para um p&aacute;ssaro.

<p><b>Dica Avan&ccedil;ada</b>. Quando voc&ecirc; treina um rob&ocirc; para dar alguma coisa para um p&aacute;ssaro, o p&aacute;ssaro voa e retorna de m&atilde;os vazias (de unhas vazias?).
Mas durante o treinamento o p&aacute;ssaro n&atilde;o leva coisas para seu ninho uma vez que quando o rob&ocirc; est&aacute; operando ele pode ser um p&aacute;ssaro diferente. Se voc&ecirc; precisar computar alguma coisa utilizando algo colocado em um ninho por um p&aacute;ssaro, ent&atilde;o voc&ecirc; precisar&aacute;, pelo menos, de dois rob&ocirc;s.
Um para dar ao p&aacute;ssaro o item e outro para trabalhar no item resultante no ninho. Um bom truque &eacute; dar a caixa ao primeiro rob&ocirc; depois de trein&aacute;-lo para produzir a caixa que voc&ecirc; deseja para treinar o segundo rob&ocirc;.

<p><b>Dica Avan&ccedil;ada.</b> Os cientistas da computa&ccedil;&atilde;o 
falam sobre programas <i>recursivos</i> &#150; programas que se utilizam a si mesmos. 
Aqui est&aacute; como voc&ecirc; pode fazer programas recursivos no Toon Talk. Coloque um rob&ocirc; novo em uma p&aacute;gina em branco de sua <a href="notebook.html">agenda</a> principal.
Ent&atilde;o treine outro rob&ocirc; para, entre outras coisas, encontrar 
a p&aacute;gina com o rob&ocirc; salvo. Treine o rob&ocirc; para colocar uma c&oacute;pia do rob&ocirc; na agenda em um caminh&atilde;o junto com uma caixa para que ele trabalhe.
Depois de terminar o treinamento de seu rob&ocirc;, encontre a p&aacute;gina na qual salvou o rob&ocirc;. Utilize <a href="dusty.html">Asper</a> para remover o rob&ocirc; e coloque em seu lugar o rob&ocirc; que voc&ecirc; acabou de treinar.

<p>O fatorial de um n&uacute;mero (1 vezes 2 vezes 3 e assim por diante, at&eacute; o seu n&uacute;mero) pode ser calculado recursivamente 
ou <i>iterativamente </i> (repetidamente, sem utilizar recurs&atilde;o).
<a href="robot.html">Clique aqui</a> para encontrar rob&ocirc;s que calculam o fatorial utilizando uma vez a recurs&atilde;o. 
<a href="robot.html">Clique aqui</a> para encontrar rob&ocirc;s que calculam o fatorial utilizando duplamente a recurs&atilde;o. Os rob&ocirc;s que calculam o fatorial sem utilizar recurs&atilde;o podem ser encontrados na p&aacute;gina 12 da agenda de exemplos que est&aacute; na p&aacute;gina 6 de sua agenda principal.

<p><b>Dica Avan&ccedil;ada.</b> Voc&ecirc; pode colocar 
rob&ocirc;s em caixas e ainda treinar outros rob&ocirc;s para manipular aqueles. Os cientistas da computa&ccedil;&atilde;o chamam a isso <i>metaprograma&ccedil;&atilde;o.</i> Os rob&ocirc;s n&atilde;o podem treinar outros rob&ocirc;s, mas podem re-arranjar equipes, remover, editar e mudar de lugar as caixas em suas mentes, e assim por diante. 
<a href="robot.html">Colocar uma equipe de rob&ocirc;s em uma caixa vazia</a> separa a equipe &#150; um rob&ocirc; por abertura da caixa. Um 
rob&ocirc; em uma caixa em uma mente apenas se ajustar&aacute; a outro rob&ocirc; com o mesmo nome. Voc&ecirc; pode utilizar Asper para &quot;apagar&quot; um rob&ocirc; de forma que ele apenas se ajustar&aacute; a qualquer rob&ocirc;.

<p>Voc&ecirc; pode tamb&eacute;m treinar um rob&ocirc; 
para apanhar uma equipe de rob&ocirc;s de uma caixa e coloc&aacute;-la em conjunto em um caminh&atilde;o com uma caixa para que eles trabalhem nela. Os cientistas da computa&ccedil;&atilde;o chamam isso de <i>programa&ccedil;&atilde;o de ordem elevada</i>. H&aacute; uma forma de combinar programa&ccedil;&atilde;o de ordem elevada e programa&ccedil;&atilde;o recursiva &#150; veja se voc&ecirc; pode descobrir como.

<p>
<hr size=1><div align=center>
<a class="menu" href="toontalk.html" OnMouseOver="window.status=' In&iacute;cio'; return true">início</a><span class=bola> &#0149;</span>
<a class="menu" href="search.html" OnMouseOver="window.status=' Busca'; return true">busca</a><span class=bola> &#0149;</span>
<a class="menu" href="buy.html" OnMouseOver="window.status=' Compra'; return true">compra</a><span class=bola> &#0149;</span>
<a class="menu" href="doc.html" OnMouseOver="window.status=' Manual'; return true">manual</a><span class=bola> &#0149;</span>
<a class="menu" href="whatsnew.html" OnMouseOver="window.status=' Novidades'; return true">novidades</a><span class=bola> &#0149;</span>
<a class="menu" href="faq.html" OnMouseOver="window.status=' D&uacute;vidas'; return true">dúvidas</a><span class=bola> &#0149;</span>
<a class="menu" href="support.html" OnMouseOver="window.status=' Suporte'; return true">suporte</a><span class=bola> &#0149;</span>
<a class="menu" href="free.html" OnMouseOver="window.status=' Download'; return true">download</a><span class=bola> &#0149;</span>
<a class="menu" href="press.html" OnMouseOver="window.status=' Imprensa'; return true">imprensa</a><span class=bola> &#0149;</span>
<a class="menu" href="address.html" OnMouseOver="window.status=' Contato'; return true">contato</a></div></td>

</tr></table>
</div>
</body></html>

<!--  FuturArte Editora Ltda.                                     Divertire  -->