<HTML>

<HEAD>

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">

<META NAME="Generator" CONTENT="Microsoft Word 97">

<TITLE>Att hantera onormala avbrott i ToonTalk</TITLE>

<META NAME="Version" CONTENT="8.0.4308">

<META NAME="Date" CONTENT="7/8/97">

<META NAME="Template" CONTENT="C:\Program Files\Microsoft
Office\Office\HTML.DOT">

</HEAD>

<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">



<B><FONT SIZE=4><P ALIGN="CENTER">Om ToonTalk pl&ouml;tsligt kraschar</P>

</B></FONT><P>Om ToonTalk pl&ouml;tsligt kraschar finns det flera
t&auml;nkbara orsaker. B&ouml;rja med att kolla om du kan g&ouml;ra samma
sak igen f&ouml;r att f&aring; det att krascha.</P>



<UL>

<LI>ToonTalk har inte installerats p&aring; r&auml;tt s&auml;tt. Detta
&auml;r inte s&auml;rskilt troligt om ToonTalk fungerat bra tidigare. Att
installera om g&aring;r naturligtvis bra. </LI>

<LI>ToonTalk har f&ouml;r lite minne eller h&aring;rddiskutrymme.
Kontrollera att din maskin har tillr&auml;ckligt med minne och
h&aring;rddiskutrymme. </LI>

<LI>Du har kanske flera versioner av ToonTalk. Klicka p&aring; "Set
Options" n&auml;r du startat ToonTalk och om du f&aring;r fr&aring;gan
vilken version du vill k&ouml;ra kan du prova att byta version f&ouml;r att
se om det hj&auml;lper. </LI>

<LI>ToonTalk kan k&ouml;ras antingen i fullsk&auml;rmsl&auml;ge eller  i
ett f&ouml;nster. Pr&ouml;va om problemet best&aring;r i b&aring;da
l&auml;gena. Klicka p&aring; "Set Options" n&auml;r du startat ToonTalk
f&ouml;r att st&auml;lla in detta. </LI>

<LI>32 bitars versionen av ToonTalk anv&auml;nder sig av Microsofts
DirectX speltill&auml;gg f&ouml;r Windows. Om du k&ouml;r 32 bitars
versionen m&aring;ste du f&ouml;rs&auml;kra dig om att ha den senaste
versionen av DirectX och dess drivrutiner. Mera information kan du f&aring;
h&auml;r <A
HREF="http://www.microsoft.com/directx">www.microsoft.com/directx</A>.
</LI>

<LI>16 bitars versionen kan f&aring; problem med en del &auml;ldre
ljudkort. Prova med att st&auml;nga av ljudeffekter i "Set Options"
n&auml;r du startat ToonTalk. </LI>

<LI>P&aring; vissa datorer och ToonTalk-inst&auml;llningar kan
sk&auml;rmen bli svart, b&ouml;rja "sn&ouml;a" eller flimra. F&ouml;r att
l&ouml;sa det problemet kan du via Kontrollpanelen &auml;ndra Windows att
anv&auml;nda 256 f&auml;rger.</LI></UL>



<P>Kom ih&aring;g att ToonTalk visar ett felmeddelande n&auml;sta
g&aring;ng det k&ouml;rs, om datorn st&auml;ngdes av medan ToonTalk var
ig&aring;ng. Du b&ouml;r alltid avsluta ToonTalk genom att trycka p&aring;
"Pause".</P>

<P>Rapportera g&auml;rna om problem som inte upph&ouml;r  genom att
kontakta <A
HREF="mailto:support@toontalk.com">support@toontalk.com</A>.</P>

<P>Om du har uppkoppling till Internet kan du <A
HREF="http://www.toontalk.com/English/abnormal.htm">klicka h&auml;r</A>
f&ouml;r att f&aring; uppdaterad information om
probleml&ouml;sning.</P></BODY>

</HTML>



