<HTML>

<HEAD>

<TITLE>Adults ask "What is ToonTalk?"</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
ToonTalk &auml;r en helt ny slags progamvara - en lekfull animerad
v&auml;rld f&ouml;r barn d&auml;r de kan k&ouml;ra och konstruera
egna datorprogram.
<P>
Att programmera datorer inneb&auml;r att man skapar, f&aring;r
sj&auml;lvf&ouml;rtroende och f&ouml;r med sig en er&ouml;vring
av en ny tankev&auml;rld, som ger l&aring;ngsiktigt goda resultat.
Man kan g&ouml;ra en h&auml;pnadsv&auml;ckande m&auml;ngd program
p&aring; olka omr&aring;den - spel, musik, matematik, animation,
simulering, naturvetenskap, robotteknik, utbildning mm. Sj&auml;lva
<A HREF="think.htm" >tankeprocessen</A> f&ouml;r att bygga program
utvecklar f&ouml;rm&aring;gan att analysera och ge n&aring;got
en tydlig form. Elever f&aring;r en djuparef&ouml;rstst&aring;else
f&ouml;r det aktuella &auml;mnet, eftersom de beh&ouml;ver anv&auml;nda
det inl&auml;rda stoffet p&aring; ett meningsfullt s&auml;tt n&auml;r
de bygger sina program.  Dessutom &auml;r sj&auml;lva programmeringen
ett v&auml;rdefullt &auml;mne att beh&auml;rska i sig.
<P>
Men programmering kan vara sv&aring;rt - sv&aring;rt att l&auml;ra
sig och sv&aring;rt att genomf&ouml;ra. Programmerare beh&ouml;ver
i allm&auml;nhet l&auml;ra sig n&aring;gon form av programmeringsspr&aring;k
som &auml;r fullt av abstrakta begrepp som variabler, procedurer,
fl&ouml;deskontroll, datastrukturer, modulering och upprepning.
Vissa elever kan l&auml;ra sig spr&aring;k som <A HREF="logo.htm" >Logo</A>
eller Basic, i synnerhet om de f&aring;r hj&auml;lp av en duktig
och engagerad l&auml;rare, men de flesta tycker det &auml;r frustrerande
och tr&aring;kigt. Att f&ouml;rst&aring; de tankestrukturer som
ligger bakom datorprogrammering &auml;r inte bara sv&aring;rt
f&ouml;r eleverna utan ocks&aring; f&ouml;r deras l&auml;rare.
<P>
Med ToonTalk &auml;r det annorlunda. Det &auml;r inte bara l&auml;tt
att l&auml;ra sig - det &auml;r roligt ocks&aring;! Till sin uppl&auml;ggning
p&aring;minner det mycket om dataspel med tilltalande grafik,
animationer, en virtuell v&auml;rld att utforska och animerade
figurer som man styr och f&aring;r hj&auml;lp av. Utan att ge
avkall p&aring; de fantastiska variationsm&ouml;jligheterna i
programmering ger ToonTalk eleverna en m&ouml;jlighet att slippa
sv&aring;ra abstraktioner och i st&auml;llet arbeta p&aring; ett
konkret s&auml;tt. I ToonTalk g&ouml;r man program genom att l&auml;ra
upp robotar.
<P>
Kommunikation mellan programelement sker med hj&auml;lp av brevduvor
som tar det dom f&aring;r till sina bon. Aritmetiska operationer
utf&ouml;rs av en liten mus med en stor hammare. Lokala variabler
har ersatts av block med l&aring;dor som kan fyllas p&aring; och
t&ouml;mmas. Eleven/programmeraren g&aring;r ocks&aring; in i
den virtuella v&auml;rlden och styr en animerad liten m&auml;nniska.
Det g&aring;r att f&aring; en &ouml;verblick genom att stiga in
i en helikopter och flyga &ouml;ver den stad som byggts, f&ouml;r
att sedan landa, stiga ur och g&aring; in i hus och uppleva eller
sj&auml;lv skapa program. En verktygsl&aring;da som &auml;r fylld
med siffror, bokst&auml;ver, l&aring;dor, lastbilar, v&aring;gar,
bomber och m&aring;nga andra saker f&ouml;ljer alltid med i den
lilla animerade m&auml;nniskans sl&auml;pt&aring;g.
<P>
ToonTalk &auml;r en v&auml;rld d&auml;r elever i olika &aring;ldrar
kan konstruera program p&aring; olika niv&aring;er av sv&aring;righet
och komplexitet. En yngre elev kommer kanske l&auml;ra en robot
att r&auml;kna eller st&auml;ndigt dubblera ett tal medan en &auml;ldre
elev skapar ett program som alstrar primtal, bygger ett bordtennisspel
eller en slumptalsgenerator. Fast&auml;n ToonTalk har skapats
med tanke p&aring; yngre elever &auml;r det baserat p&aring; en
modell f&ouml;r avancerad programmering och har anv&auml;nts p&aring;
h&ouml;g niv&aring; inom universitetsutbildningen f&ouml;r att
l&auml;ra ut samverkande algoritmer.<BR>

</BODY>

</HTML>
