<HTML>

<HEAD>

<TITLE>ToonTalk Fåglar och deras bon</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>F&aring;glar och deras bon</FONT></B>
</CENTER>
<P>
<CENTER><IMG SRC="../bird.gif" ALT="A Picture of a bird"></CENTER>
<P>
Inuti <A HREF="tooly.htm">Verktygsl&aring;dan</A> kan du hitta
en stor m&auml;ngd f&aring;gelbon. Om du tar ut ett kommer du
att se ett &auml;gg i det. Om du s&auml;tter ner det kommer en
f&aring;gel att kl&auml;ckas. En f&aring;gel tycker om att ta
allt den f&aring;r och l&auml;gga det i sitt bo. &Auml;ven om
hennes bo har flyttats till n&aring;gon annan del av staden, kommer
hon att hitta det. En speciell sak med f&aring;glar &auml;r att
de bara tycker om saker som &auml;r <I>rektangul&auml;ra</I>.
Hon tar <A HREF="number.htm">sifferkort</A> och <A HREF="text.htm">textkort</A>
och <A HREF="box.htm">l&aring;dor</A> - inget annat. Som tur &auml;r,
finns det massor med andra saker som kan finnas i l&aring;dor.
Hon tar en l&aring;da med bon som tillh&ouml;r andra f&aring;glar
och till med en l&aring;da med andra f&aring;glar i. Om hon vill
l&auml;gga n&aring;got i sitt bo och det redan ligger n&aring;got
d&auml;r, l&auml;gger hon den nya saken p&aring; botten av h&ouml;gen
av det som finns d&auml;r. 
<P>
N&auml;r en f&aring;gel lagt n&aring;got i sitt bo &aring;terv&auml;nder
hon dit hon var tidigare. 
<P>
<B>F&aring;gelkopior.</B> Om du anv&auml;nder din <A HREF="wand.htm">Trollstav</A>
f&ouml;r att kopiera en f&aring;gel d&aring; tror b&aring;da f&aring;glarna
att ett och samma bo &auml;r deras. Men det &auml;r inte n&aring;got
problem faktiskt. Dom delar g&auml;rna p&aring; boet. 
<P>
<B>Kopior av f&aring;gelbon.</B> Om du anv&auml;nder staven f&ouml;r
att kopiera ett bo och sen ger f&aring;geln som kl&auml;cktes
i det boet n&aring;gonting, d&aring; f&aring;r f&aring;geln bekymmer.
Hon tror att b&aring;da bona &auml;r hennes och vill ta med sig
det hon f&aring;tt till b&auml;gge bona. Det klarar hon av genom
att kopiera b&aring;de sig sj&auml;lv och det hon h&aring;ller
i. P&aring; det viset f&aring;r varje bo en kopia. De nya kopiorna
av f&aring;geln flyger iv&auml;g n&auml;r dom lagt ifr&aring;n
sig det dom haft med sig. 
<P>
<B>Avancerat tips.</B> Om en <A HREF="robot.htm">robot</A> v&auml;ntar
sig n&aring;got i en l&aring;da och det ligger ett bo d&auml;r
i st&auml;llet, d&aring; kommer roboten v&auml;nta och hoppas
att f&aring;geln ska l&auml;gga det han v&auml;ntar p&aring; i
boet. Det &auml;r ett j&auml;ttebra s&auml;tt att f&aring; robotar
i olika hus att samarbeta och utv&auml;xla medddelanden. <A HREF="programs.htm#Primes">Ett exempel p&aring; det &auml;r n&auml;r en hel dr&ouml;s med robotar samarbetar f&ouml;r klura ut primtal.</A>
<BR>

</BODY>

</HTML>
