<HTML>

<HEAD>

<TITLE>ToonTalk Lådor</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>L&aring;dor</FONT></B> </CENTER>
<P>
<CENTER><IMG SRC="../box.gif" ALT="A picture of a box"></CENTER>
<P>
L&aring;dor &auml;r bra att f&ouml;rvara saker i. du kan l&auml;ggat
<A HREF="number.htm">sifferkort</A> och <A HREF="text.htm">textkort</A>
i dom, liksom <A HREF="bird.htm">f&aring;glar och f&aring;gelbon</A>,
<A HREF="scale.htm">v&aring;gar</A>, <A HREF="picture.htm">bilder</A>,
och till och med andra l&aring;dor. ToonTalk kommer senare att
kunna l&auml;gga mera i l&aring;dor, som <A HREF="robot.htm">robotar</A>,
<A HREF="truck.htm">lastbilar</A>, <A HREF="bomb.htm">bomber</A>,
och <A HREF="notebook.htm">anteckningsb&ouml;cker</A>. 
<P>
Du kan koppla ihop tv&aring; l&aring;dor genom att sl&auml;ppa
en l&aring;da p&aring; kanten av en annan l&aring;da. Dom m&aring;ste
t&auml;cka varandra lite grann n&auml;r man sl&auml;pper. Medan
du h&aring;ller i en l&aring;da kan du trycka 0 till 9. P&aring;
s&aring; vis kommer l&aring;dan att f&aring; s&aring; m&aring;nga
fack som du skriver. Om den nya storleken &auml;r mindre, d&aring;
kommer den extra delen av l&aring;dan till h&ouml;ger ramla av.
Du kan dela upp en l&aring;da genom att sl&auml;ppa den p&aring;
en <A HREF="number.htm">siffra</A>. Anta att att en l&aring;da
med 5 fack sl&auml;pps p&aring; en 3:a. D&aring; delas den i tv&aring;
l&aring;dor, en med 3 fack och en med 2 fack. 
<P>
<B>Tips. </B>Du kan l&auml;ra upp en <A HREF="robot.htm">robot</A>
f&ouml;r att hitta eller &auml;ndra vilken del av en l&aring;da
som helst bara genom att g&aring; till ett fack och ta ut saker
eller l&auml;gga tillbaka dom. 
<P>
<B>Avancerat tips.</B> Om du inte vet vilket fack du ska arbeta
med medan du tr&auml;nar honom men du kommer att ha fackets nummer
n&auml;r roboten arbetar, d&aring; kan du g&ouml;ra s&aring; h&auml;r.
N&auml;r du tr&auml;nar en robot ge honom en l&aring;da med siffran
och l&aring;dan du vill att han ska arbeta med (och vad han nu
kan beh&ouml;va mera). L&auml;r roboten att ta ur siffran och
l&auml;gga ner den och sen ta ut l&aring;dan och sl&auml;ppa den
p&aring; siffran. Nu &auml;r facket som roboten ska arbeta med
det f&ouml;rsta facket av den del av l&aring;dan som &auml;r till
h&ouml;ger. L&aring;t roboten g&ouml;ra det du vill med det facket
och l&auml;gg sedan ihop l&aring;dans tv&aring; delar och l&auml;gg
tillbaka den d&auml;r du hittade den. 
<P>
<B>L&aring;dor utan fack.</B> Om du trycker 0 medan du h&aring;ller
i en l&aring;da kommer du att m&auml;rka att du h&aring;ller i
en l&aring;da utan fack. Det &auml;r inte s&auml;rskilt mycket
du kan g&ouml;ra med s&aring;dana l&aring;dor. Du kan koppla ihop
dom med andra l&aring;dor och d&aring; f&ouml;rsvinner dom. Det
&auml;r s&aring;nt som dataforskare tycker &auml;r roligt. 
<P>
<B>Tomma l&aring;dor. <A HREF="dusty.htm">Dammis</A> kan hj&auml;lpa
dig att g&ouml;ra en tom l&aring;da. Dom kommer v&auml;l till
pass i en robots <A HREF="bubble.htm">tankebubbla</A> n&auml;r
du vill vara s&auml;ker p&aring; att en robot har en l&aring;da
men du inte bryr dig om hur m&aring;nga fack l&aring;dan har.
Du kan ocks&aring; anv&auml;nda dom f&ouml;r att &quot;spr&auml;nga&quot;
ett textkort. Om du sl&auml;pper ett textkort som &quot;cat&quot;
p&aring; en tom l&aring;da kommer l&aring;dan f&ouml;rvandlas
till en med 3 fack. Det f&ouml;rsta kommer att inneh&aring;lla
bara &quot;c&quot;, det andra facket &quot;a&quot;, och det tredje
facket &quot;t&quot;. </B>
</BODY>

</HTML>
