<HTML>

<HEAD>

<TITLE>ToonTalk robotens tankebubbla</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>Robotens tankebubbla</FONT></B> </CENTER>
<P>
<CENTER><IMG There will be a picture here.   SRC="../bubble.gif" ALT="A picture of a thought bubble"></CENTER>
<P>
N&auml;r du tr&auml;nat en <A HREF="robot.htm">robot</A> har hans
tankebubbla en kopia av den <A HREF="box.htm">l&aring;da</A> han
tr&auml;nades att arbeta med. N&auml;r roboten f&aring;r en l&aring;da,
ser han efter om den &auml;r samma som l&aring;dan i hans tankebubbla.
Om n&aring;got i l&aring;dan i hans tankebubbla &auml;r olika
det som finns i den l&aring;da han f&aring;r, kommer han inte
ta emot den. Om han &auml;r med i ett arbetslag, kommer han l&aring;ta
roboten bakom honom kolla den. Finns det ingen robot bakom honom
kommer han helt enkelt sluta arbeta. Han har inga problem att
arbeta med en l&aring;da som har mera saker &auml;n den som finns
i hans tankebubbla. Om det ligger n&aring;got i l&aring;dan i
hans tanke och det p&aring; samma plats i l&aring;dan han f&aring;r
ligger ett f&aring;gelbo eller det &auml;r tomt d&auml;r, d&aring;
v&auml;ntar han bara. Han b&ouml;rjar igen om f&aring;geln l&auml;gger
n&aring;got i sitt bo i l&aring;dan eller om du g&ouml;r det.

<P>
<B>Tips. </B>Robotar kan vara kinkiga. Du kan anv&auml;nda <A HREF="dusty.htm">Dammis</A>
att ta bort saker fr&aring;n deras tankebubblor s&aring; att de
tar emot flera slags l&aring;dor. Tar du bort f&ouml;r mycket
kanske de f&ouml;rs&ouml;ker arbeta med l&aring;dor, som de egentligen
inte vet vad de ska g&ouml;ra med. 
<P>
<B>Avancerat Tips.</B>Om du anv&auml;nder Dammis f&ouml;r att
ta bort bara det som ligger ovanp&aring; ett <A HREF="number.htm#BlankNumber">sifferkort</A>
i hans tankebubbla, d&aring; kommer roboten &auml;nd&aring; v&auml;nta
tills det finns ett sifferkort p&aring; samma plats i l&aring;dan
som han f&aring;r, men han kommer inte bry sig om vilken siffra
som finns p&aring; kortet. Detsamma g&auml;ller <A HREF="text.htm#BlankText">tomma textkort</A>
och l&aring;dor.<BR>

</BODY>

</HTML>
