<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Inställningar på ToonTalks kommandorad</TITLE>
<META NAME="Template" CONTENT="C:\PROGRAM FILES\MICROSOFT OFFICE\OFFICE\html.dot">
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<B><FONT SIZE=4><P ALIGN="CENTER">Inst&auml;llningar p&aring; ToonTalks kommandorad </P>
</B></FONT><P>N&auml;r du startar upp ToonTalk fr&aring;gar det efter ditt namn. Du kan ange ditt namn p&aring; kommandoraden ist&auml;llet. N&auml;stan alla inst&auml;llningar som beskrivs nedan kan &auml;ven &auml;ndras i <A HREF="options.htm">anteckningsboken f&ouml;r inst&auml;llningar</A> som finns p&aring; sidan 10 i <A HREF="notebook.htm">anteckningsboken som bor i verktygsl&aring;dan</A>. </P>
<P>Alternativt kan du st&auml;lla in ToonTalk genom att &ouml;ppna Programobjektet f&ouml;r ToonTalk (Windows 3.1) eller genv&auml;gen (windows 95) som heter "Start ToonTalk" (Alt-Enter n&auml;r ikonen &auml;r vald.) Efter delen som heter toontalk.exe kan du l&auml;gga till n&aring;gon av f&ouml;ljande inst&auml;llningar. De skiljs &aring;t med med mellanslag. F&ouml;rutom -n inst&auml;llningen nedan, borde de f&ouml;rinst&auml;llda v&auml;rdena vara passande. </P>

<UL>
<LI><A NAME="HeadLook">-n &lt;namn&gt; Namnet kan vara vilken l&auml;ngd som helst och kan inte inneh&aring;lla mellanslag eller specialtecken. De 8 f&ouml;rsta bokst&auml;verna i namnet kommer att anv&auml;ndas som filnamn f&ouml;r det sparade arbetet. Det f&ouml;rinst&auml;llda namnet &auml;r "No Name". </A></LI>
<LI>-h &lt;huvud&gt; Huvudet kan vara 0 (skallig), 1 (l&aring;ngt h&aring;r), eller 2 (keps). Det f&ouml;rinst&auml;llda &auml;r 2. </LI>
<LI>-s &lt;ljud&gt; Ljudet kan vara 0 f&ouml;r att st&auml;nga av ljudet. Om systemet krashar flera g&aring;nger beror det kanske p&aring; d&aring;liga f&ouml;rbindelser mellan ljuddrivrutinerna och ToonTalk. Testa om 0 l&ouml;ser problemet och rapportera det g&auml;rna. </LI>
<LI>-f &lt;sk&auml;rmstorlek&gt; Sk&auml;rmstorleken kan vara 0 (320x240 litet f&ouml;nster), 1 (fullsk&auml;rm med Windows grafik avslagen), eller 2 (640x480, Windows normal). 1 verkar se lite b&auml;ttre ut och &auml;r snabbare p&aring; vissa datorer men h&auml;nger sig ofta om det st&ouml;ter p&aring; ett fel i programmet. Ibland n&auml;r det h&auml;nder m&aring;ste man starta om datorn. 1 fungerar &auml;ven oberoende av uppl&ouml;sning och f&auml;rgdjup. Om man k&ouml;r i l&auml;ge 1 fungerar inte Windows &lt;alt&gt; kommandon. 1 fungerar inte i Windows NT. </LI>
<LI>-o &lt;namn som inspelning ska f&aring;&gt; Allt som g&ouml;rs spelas in i filen och kan spelas upp med -i. Det &auml;r ett j&auml;ttebra s&auml;tt att f&aring;nga ett fel i programmet. Filen f&aring;r till&auml;gget .DMO. </LI>
<LI>-i &lt;namn p&aring; inspelning man vill spel upp&gt; G&ouml;r allt som utf&ouml;rdes n&auml;r -o anv&auml;ndes. -i uppf&ouml;r sig likadant men saktas ned till den ursprungliga inspelningshastigheten om det k&ouml;rs p&aring; en snabbare dator. </LI>
<LI>-c &lt;stadens storlek&gt; Stadens f&ouml;rinst&auml;llda storlek &auml;r 10x10 kvarter (varje kvarter inneh&aring;ller 4 hus). Den st&ouml;rsta storleken en stad kan ha &auml;r 255x255. Om talet &auml;r negativt kommer staden att f&aring; husen slumpvist utplacerade. </LI>
<LI>-b &lt;0, 1, 2 eller 3&gt;. Beskriver antalet musknappar som finns tillg&auml;ngliga. Det f&ouml;rinst&auml;llda v&auml;rdet &auml;r 1. Se <A HREF="mouse.htm">Musknappar</A> f&ouml;r detaljer. </LI>
<LI>-r &lt;hastighet f&ouml;r uppl&auml;sning&gt; Hastigheten f&ouml;r uppl&auml;sning kontrollerar hur l&auml;nge text stannar i en pratbubbla. 100 procent &auml;r det f&ouml;rinst&auml;llda v&auml;rdet. St&ouml;rre siffror f&aring;r texten att stanna kortare tid. </LI>
<LI>-l &lt;bokstavsstorlek i pratbubblor&gt; 100 procent &auml;r f&ouml;rinst&auml;llt. </LI>
<LI>-e &lt;typsnitt&gt; Typsnittet som Marsm&auml;nniskan anv&auml;nder. Om det inneh&aring;ller ett mellanslag som New Modern skriv in det som new_modern. </LI>
<LI>-m &lt;minne som tilldelas cache&gt; Det f&ouml;rinst&auml;llda &auml;r 100 (det anv&auml;nder 25% av det lediga minnet). St&ouml;rre siffror b&ouml;r snabba upp systemet n&aring;got men l&auml;mna mindre minne &aring;t andra &auml;ndam&aring;l. </LI>
<LI>-u &lt;bevara anv&auml;ndarprofil&gt; 1 betyder att i *.usr h&aring;lla reda p&aring; vilka operationer anv&auml;ndaren har utf&ouml;rt och utforma hj&auml;lp d&auml;refter. 0 st&auml;nger av det. 1 &auml;r f&ouml;rinst&auml;llt. </LI>
<LI>-a &lt;hur mycket Marty pratar&gt; Kan vara mellan 0 till 5. 0 s&aring; s&auml;ger Marsm&auml;nniskan allt m&ouml;jligt. 5 s&aring; s&auml;ger han inte n&aring;gonting alls. 2 &auml;r f&ouml;rinst&auml;llt. </LI>
<LI>-t &lt;tempor&auml;r anv&auml;ndare&gt; 1 betyder att ToonTalk inte ska generera eller l&auml;sa anv&auml;ndarfiler f&ouml;r anteckningsb&ouml;cker. 0 &auml;r det f&ouml;rinst&auml;llda v&auml;rdet. </LI>
<LI>-q &lt;ToonTalks hastighet&gt; 100 &auml;r f&ouml;rinst&auml;llt. H&ouml;gre siffror snabbar upp alla animationer. </LI>
<LI>-y &lt;minimum f&ouml;rdr&ouml;jning f&ouml;r bildrutor i millisekunder&gt; 0 &auml;r f&ouml;rinst&auml;llt. 50, tex, resulterar i 20 bildrutor per sekund &auml;ven p&aring; mycket snabba datorer. </LI>
<LI>-k &lt;anv&auml;ndare &auml;r systemavbuggare&gt; Marsm&auml;nniskan och &lt;user&gt;.log filen inneh&aring;ller mer information om de problem som anv&auml;ndarenst&ouml;ter p&aring; om -k 1. Det f&ouml;rinst&auml;llda &auml;r 0. </LI>
<LI>-bird &lt;se f&aring;glar n&auml;r det &aring;terv&auml;nder utomhus&gt; Om 0 tar f&aring;glar inte n&aring;gon tid p&aring; sig att &aring;terv&auml;nda efter att de l&auml;mnat n&aring;gonting i sitt bo n&auml;r programmeraren ser p&aring; utomhus. 1 &auml;r f&ouml;rinst&auml;llt. </LI>
<LI>-j &lt;k&ouml;r Japansk version av Windows 3.1&gt; 1 betyder att titelsk&auml;rmen inte ska visas. Det verkar l&ouml;sa ett kompatibilitetsproblem mellan Win 3.1J och WinG som b&aring;da &auml;r fr&aring;n Microsoft. Vanligtvis &auml;r det svart f&ouml;rsta g&aring;ngen text visas. </LI>
<LI>-puzzle &lt;filnamn&gt; G&ouml;r s&aring; att ToonTalk startar det <A HREF="make_pzl.htm">uppdrag</A> som namngetts. </LI>
<LI>-next_puzzle 1 G&ouml;r s&aring; att ToonTalk startar med n&auml;sta uppdrag &aring;t anv&auml;ndaren. F&ouml;rsta uppdraget om inget uppdrag blivit avklarat av anv&auml;ndaren. </LI>
<LI>-autodemo &lt;0, 1 eller 2&gt; 0 &auml;r f&ouml;rinst&auml;llt och sl&aring;r av den automatiska demon. 1 betyder att ToonTalk repeterar introduktionen efter 30 sekunder. Om n&aring;gon k&ouml;r "g&ouml;ra uppdrag" eller "leka fritt" v&auml;ntar den i 2 minuter ist&auml;llet. Det kontrolleras av raden i toontalk.ini i din windowskatalog som inneh&aring;ller texten: "AutoDemoMaxIdle=120". 2 skiljer sig p&aring; s&aring; s&auml;tt att ToonTalk spelar upp alla demos en efter en. </LI>
<LI>-subtitles &lt;speed&gt; Om en demo visas och text finns s&aring; visas den med en hastighet som &auml;r f&ouml;rinst&auml;llt till 100. Om hastigheten &auml;r 0 s&aring; visas inte n&aring;gon text. Textens spr&aring;k kan &auml;ndras med "SubtitlesSuffix=ust" i delen "Executables" i ToonTalk.ini. UST st&aring;r f&ouml;r amerikansk-engelsk text. SET st&aring;r f&ouml;r svensk. </LI>
<LI>-speak &lt;0, 1&gt; 1 s&auml;tter ig&aring;ng text-till-prat om du k&ouml;r 32 bitars versionen. 0 st&auml;nger av det. 1 &auml;r f&ouml;rinst&auml;llt i 32 bitars versionen och 0 i 16 bitars versionen. </LI>
<LI>-balloon &lt;0,1&gt; 1 s&auml;tter ig&aring;ng marsm&auml;nniskans pratbubblor. Det f&ouml;rinst&auml;llda &auml;r 1. </LI>
<LI>-tts_uses_ds &lt;0,1&gt; 1 inneb&auml;r att text-till-tal maskinen anv&auml;nder DirectSound. Den g&ouml;r det m&ouml;jligt att anv&auml;nda tal och ljudeffekter samtidigt. Ursprungsinst&auml;llningen &auml;r 1. </LI>
<LI>-mouse_sensitivity <sensitivity>100 &auml;r normalt. Ett tal st&ouml;rre &auml;n 100 kommer att f&aring; sm&aring; musr&ouml;relser att bli stora r&ouml;relser i ToonTalk. Ett tal mindre &auml;n 100 kommer att f&aring; stora musr&ouml;relser att bli sm&aring; r&ouml;relser p&aring; sk&auml;rmen. </LI></UL>
</BODY>
</HTML>
