<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Att installera ToonTalk-tillägg</TITLE>
<META NAME="Version" CONTENT="8.0.4308">
<META NAME="Date" CONTENT="7/8/97">
<META NAME="Template" CONTENT="C:\Program Files\Microsoft Office\Office\HTML.DOT">
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<B><FONT SIZE=5><P ALIGN="CENTER">Att installera ToonTalk-till&auml;gg</P>
</B></FONT><I><FONT SIZE=4><P ALIGN="CENTER">Enbart f&ouml;r avancerade anv&auml;ndare:</P>
</I></FONT><P><A HREF="extend.htm"><FONT SIZE=4>ToonTalk-till&auml;gg</FONT></A><FONT SIZE=4> installeras inte som standard. En anledning till detta &auml;r att de g&ouml;r det m&ouml;jligt f&ouml;r robotar att &auml;ndra p&aring; saker utanf&ouml;r ToonTalks s&auml;kra v&auml;rld. </FONT><A HREF="extend.htm#FileExtension"><FONT SIZE=4>Arkiv-till&auml;gget</FONT></A><FONT SIZE=4> t ex, till&aring;ter ToonTalks robotar att l&auml;sa och skriva (eller radera) vilken fil som helst i din dator. Det h&auml;r &auml;r en styrka som kan anv&auml;ndas b&aring;de till gott och till ont. Om du installerar detta till&auml;gg, var d&aring; s&auml;ker p&aring; att du kan lita p&aring; de m&auml;nniskor som ger dig ToonTalk-program att k&ouml;ra p&aring; din dator.</P>
<P>An extension is installed if the DLL file starting with "TT" followed by the extension name is in your ToonTalk directory. For example, the file extension file is "TTFile.dll".</P>
<P>Om du g&ouml;r installationen fr&aring;n en CDROM, v&auml;lj d&aring; "Anpassad installation". Du ska ta bort alla kryss utom de som st&aring;r vid beteckningar p&aring; de till&auml;gg du vill ha.</P>
<P>If you are installing from a CDROM, then choose the "Custom Installation" option. Select "Program Files" and click on the "change" button. You should then remove check marks from every component except the ones that are labeled with the extensions you desire. Alternatively copy the appropriate files from the \toontalk\extend subdirectory.</P>
<P>Om du g&ouml;r installationen fr&aring;n Internet, ladda d&aring; ner </FONT><A HREF="ftp://ftp.toontalk.com/ftp/Beta11/ttfile.dll"><FONT SIZE=4>ttfile.dll</FONT></A><FONT SIZE=4> och k&ouml;r den f&ouml;r att installera Arkiv-till&auml;gget.</P></FONT></BODY>
</HTML>
