<HTML>
	<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<META NAME="generator" CONTENT="GoLive CyberStudio">
		<TITLE>Vanliga Fr&aring;gor om ToonTalk</TITLE>
		<META NAME="Template" CONTENT="C:\PROGRAM FILES\MICROSOFT
OFFICE\OFFICE\html.dot">
	</HEAD>
	<BODY LINK="#0000FF" VLINK="#800080" BGCOLOR="#FFFFFF">
		<CENTER>
			<P><B>Vanliga Fr&aring;gor</B></P>
		</CENTER>
		<P><A HREF="#question1">Fr&aring;ga #1</A>: ToonTalk verkar inte fungera
som det ska. Vad kan jag g&ouml;ra?</P>
		<P><A HREF="#question2">Fr&aring;ga #2</A>: Kan du f&ouml;rklara f&ouml;r
mig, hur jag ska &aring;stadkomma motsvarigheten
		till DO LOOP i ToonTalk?</P>
		<P><A HREF="#question3">Fr&aring;ga #3</A>: Jag vill anv&auml;nda
ToonTalk men jag &auml;r synskadad. N&aring;gra f&ouml;rslag?</P>
		<P><A HREF="#question4">Fr&aring;ga #4</A>: Vad &auml;r det f&ouml;r
skillnad mellan att radera en siffra och att
		ta bort den helt fr&aring;n en l&aring;da i en robots tankebubbla?</P>
		<P><A HREF="#question5">Fr&aring;ga #5</A>: Om man en g&aring;ng har
skrivit ett '=' p&aring; en siffra finns det d&aring;
		inget s&auml;tt att &aring;ngra det (backtangenten)?</P>
		<P><A HREF="#question6">Fr&aring;ga #6</A>: Hur kan jag hoppa till ett
uppdrag som jag vill arbeta med?</P>
		<P><A HREF="#question7">Fr&aring;ga #7</A>: Jag tycker inte om storleken
och placeringen av Verktygsl&aring;dan,
		och allt som ligger i den. Hur kan jag &auml;ndra det?</P>
		<P><A HREF="#question8">Fr&aring;ga #8</A>: Hur kan jag f&aring;
hj&auml;lp inifr&aring;n ToonTalk?</P>
		<P><A HREF="#question9">Fr&aring;ga #9</A>: Jag har en robot men jag vet
inte vad han g&ouml;r. Hur kan jag f&aring;
		reda p&aring; det?</P>
		<P><A HREF="#question10">Fr&aring;ga #10</A>: Jag vill g&ouml;ra en massa
&auml;ndringar i l&aring;dan i en robots tankebubbla
		men den &auml;r f&ouml;r liten f&ouml;r att jobba med. Vad kan jag
g&ouml;ra?</P>
		<P><A HREF="#question11">Fr&aring;ga #11</A>: ToonTalk fr&aring;gar hela
tiden efter mitt namn n&auml;r det startar upp.
		Och det kommer ih&aring;g mig. Vad &auml;r det som h&auml;nder?</P>
		<P><A HREF="#question12">Fr&aring;ga #12</A>: Jag vill att alla i min
grupp ska b&ouml;rja med en anteckningsbok
		och en stad som skiljer sig fr&aring;n den som ToonTalk har. G&aring;r
det?</P>
		<P><A HREF="#question13">Fr&aring;ga #13</A>: Ibland tar jag ut saker ur
en anteckningsbok eller Verktygsl&aring;dan
		av misstag. M&aring;ste jag anv&auml;nda Dammis f&ouml;r att bli av med
dom?</P>
		<P><A HREF="#question14">Fr&aring;ga #14</A>: Kan jag l&auml;ra en robot
att s&auml;tta ihop bilder?</P>
		<P><A HREF="#question15">Fr&aring;ga #15</A>: Kan man ge namn till
f&aring;glar? Det &auml;r j&auml;ttesv&aring;rt att komma ih&aring;g
		var olika f&aring;glar bor.</P>
		<P><A HREF="#question16">Fr&aring;ga #16</A>: Hur skriver man decimaltal
i ToonTalk?</P>
		<P><A HREF="#question17">Fr&aring;ga #17</A>: Jag har l&auml;st att man
kan &quot;l&auml;gga ut&quot; robotar p&aring; n&auml;tet, fast jag
		vet inte hur. </P>
		<P>===================================</P>
		<P><I><A NAME="question1"></A>Fr&aring;ga #1: </I>ToonTalk verkar inte
fungera som det ska. Vad kan jag g&ouml;ra?</P>
		<P><I>Svar: </I><A HREF="trouble.htm">Klicka h&auml;r</A> f&ouml;r att
f&aring; hj&auml;lp.</P>
		<P><I>----------------------------------------------------------------
		</I></P>
		<P><I><A NAME="question2"></A>Fr&aring;ga #2:</I> Fadia Markar i Schweiz
fr&aring;gar &quot;Kan du f&ouml;rklara f&ouml;r mig, hur jag
		ska &aring;stadkomma motsvarigheten till DO LOOP i ToonTalk?&quot;</P>
		<P><I>Svar:</I> DO eller FOR loop i vanliga program best&aring;r ofta av
4 delar: en
		index variabel (vi kan kalla v&aring;r &quot;i&quot;), en till&ouml;kning
som anger
		hur mycket som ska l&auml;ggas till &quot;i&quot; (eller dras bort
fr&aring;n &quot;i&quot; om
		till&ouml;kningen &auml;r negativ), ett stoppvillkor (t ex, &quot;i &lt;
100&quot;),
		och en huvuddel som k&ouml;rs upprepade g&aring;nger tills stoppvillkoret
		&auml;r uppfyllt. </P>
		<P>I ToonTalk kulle jag f&ouml;rst skapa en l&aring;da med 4 fack:<BR>
		[i | &lt; | stopp | &ouml;kning]<BR>
		d&auml;r i, stopp, och &ouml;kning &auml;r siffror och &quot;&lt;&quot;
&auml;r en v&aring;g.&nbsp; Jag skulle
		ge l&aring;dan till en robot och l&auml;ra honom att kopiera
&quot;increment&quot;
		och sl&auml;ppa den p&aring; &quot;i&quot;.&nbsp; sedan skulle jag
l&auml;ra honom att g&ouml;ra vad
		det nu &auml;r jag ville g&ouml;ra i &quot;huvuddelen&quot; av
loopen.&nbsp; n&auml;r jag l&auml;rt
		roboten f&auml;rdigt skulle jag anv&auml;nda Dammis dammsugaren f&ouml;r att
		radera &quot;i&quot; siffran i det f&ouml;rsta facket i l&aring;dan i
robotens tankebubbla).
		</P>
		<P>F&ouml;r att g&ouml;ra n&aring;got som ska h&auml;nda n&auml;r loopen
avslutats skulle jag
		tr&auml;na en annan robot och sl&auml;ppa denna robot p&aring; den
f&ouml;rsta s&aring; att
		den skulle komma efter den i en k&ouml;.&nbsp; Det inneb&auml;r att den
f&ouml;rsta
		roboten f&aring;r en chans att arbeta om l&aring;dan st&auml;mmer. </P>
		<P>Se t ex, <I>Factorial</I> exemplet i anteckningsboken f&ouml;r
<I>Exempel</I>.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question3"></A>Fr&aring;ga #3:</I> Jag vill anv&auml;nda
ToonTalk men jag &auml;r synskadad.</P>
		<P><I>Svar:</I> <A HREF="visualim.htm">Klicka h&auml;r</A> f&ouml;r tips
hur du kan st&auml;lla in ToonTalk p&aring; olika s&auml;tt som kan
		underl&auml;tta.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question4"></A>Fr&aring;ga #4: </I>Vad &auml;r det
f&ouml;r skillnad mellan att radera en siffra och att ta
		bort den helt fr&aring;n en l&aring;da i en robots tankebubbla?</P>
		<P><I>Svar: </I>det som allm&auml;nt g&auml;ller om en robots tankebubbla
&auml;r att den b&ouml;r
		inneh&aring;lla den slags l&aring;da som roboten vill arbeta med. Han arbetar
		g&auml;rna med en l&aring;da som inneh&aring;ller mera detaljer &auml;n
han &auml;r medveten
		om. S&aring; om du raderar en siffra betyder det att roboten g&auml;rna
arbetar
		med vilket sifferkort som helst p&aring; den platsen medan att ta bort
		det betyder att vad som helst (t o m textkort eller andra l&aring;dor)
		duger gott. Att radera en siffra &auml;r ett s&auml;tt att uttrycka vad
		dataprogrammerare p&aring; engelska kallar ett type test. En bra vana
		i ToonTalk programmering &auml;r att radera s&aring; lite som
m&ouml;jligt f&ouml;r
		att f&aring; roboten det du vill i alla de sammanhang du &ouml;nskar.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question5"></A>Fr&aring;ga #5:</I> Jeroen van Hilst i
Netherlochs fr&aring;gar, &quot;Om man en g&aring;ng har skrivit
		ett '=' p&aring; en siffra finns det d&aring; inget s&auml;tt att
&aring;ngra det (backtangenten)?&quot;</P>
		<P><I>Svar: </I>Backtangenten tar bort den sista siffran. Om siffran
&auml;r noll g&ouml;r
		den ingenting. Enda s&auml;ttet att ta bort '=' &auml;r att skriva '+'.
		Sifferkorten visar inte '+' men finns d&auml;r p&aring; alla siffror som
		inte har n&aring;got r&auml;knetecken.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question6"></A>Fr&aring;ga #6:</I> Hur kan jag hoppa till
ett uppdrag som jag vill arbeta med?</P>
		<P><I>Svar: </I>Du kan hitta katalogen med ToonTalks uppdrag p&aring; din
h&aring;rddisk eller
		CD-ROM och dubbelklicka p&aring; det uppdragsnummer du vill b&ouml;rja med.
		Om du ser p&aring; din loggfil i katalogen som heter Users i ToonTalk,
		ser du vilka uppdrag du gjorde senast. Vissa uppdrag bygger p&aring;
		det du gjort tidigare. Om du b&ouml;rjar med n&aring;got av dessa uppdrag
		kanske ToonTalk ber dig att g&aring; tillbaka n&aring;gra uppdrag.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question7"></A>Fr&aring;ga #7:</I> Jag tycker inte om
storleken och placeringen av Verktygsl&aring;dan,
		och allt som ligger i den. Hur kan jag &auml;ndra det?</P>
		<P><I>Svar: </I>Du kan anv&auml;nda <A HREF="pumpy.htm">Pumpas</A>
f&ouml;r att &auml;ndra p&aring; storleken p&aring; <A
HREF="tooly.htm">Verktygsl&aring;dan</A>, <A
HREF="wand.htm">Trollstaven</A>, <A HREF="dusty.htm">Dammis</A> och din
anteckningsbok. Du kan till och med &auml;ndra p&aring; Pumpas storlek
		genom att kopiera honom och och anv&auml;nda kopian f&ouml;r att
&auml;ndra hans
		storlek. Det &auml;r ett utm&auml;rkt s&auml;tt att f&aring; mera utrymme
om du hellre
		arbetar med sm&aring; saker. Du kan ocks&aring; placera verktygen vid
sk&auml;rmens
		kant och anv&auml;nda funktionstangenterna f&ouml;r att kalla dem till dig.
		(Se <A HREF="keyboard.htm">tangentbordskommandon</A> f&ouml;r detaljer.)
N&auml;r du &auml;r f&auml;rdig med dem &aring;terv&auml;nder de till sina
		ursprungliga platser. &nbsp;</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question8"></A>Fr&aring;ga #8:</I> Hur kan jag f&aring;
hj&auml;lp inifr&aring;n ToonTalk?</P>
		<P><I>Svar: </I><A HREF="marty.htm">Marty</A> ger dig en fullst&auml;ndig
beskrivning verktygen om du kallar p&aring;
		honom (via F1) medan du h&aring;ller eller pekar p&aring; ett verktyg.
S&auml;rskilt
		anv&auml;ndbart f&ouml;r att f&aring; en beskrivning p&aring; vad en
robot g&ouml;r.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question9"></A>Fr&aring;ga #9:</I> Jag har en robot men
jag vet inte vad han g&ouml;r. Hur kan jag f&aring;
		reda p&aring; det?</P>
		<P><I>Svar: </I>F&ouml;rutom att f&aring; <A HREF="marty.htm">Marty</A>
att beskriva roboten (se ovan), kan du anv&auml;nda <A
HREF="wand.htm">Trollstaven</A> f&ouml;r att f&aring; en kopia av den
l&aring;da roboten f&ouml;rst blev l&auml;rd att arbeta
		med. Trollstavens knapp ska visa 'O' f&ouml;r original om detta ska
		fungera. Du kan anv&auml;nda Trollstaven p&aring; l&aring;dan i robotens
tankebubbla
		och sedan ge kopian till roboten och se n&auml;r han arbetar. Om det
		&auml;r fr&aring;ga om ett lag med robotar kan du ser laget arbeta eller
		om du vill kolla p&aring; en speciell robot kan du bryta is&auml;r laget
		genom att suga upp dem med <A HREF="dusty.htm">Dammis</A> och sedan
spotta ut dem igen. </P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question10"></A>Fr&aring;ga #10:</I> Jag vill g&ouml;ra en
massa &auml;ndringar i l&aring;dan i en robots tankebubbla
		men den &auml;r f&ouml;r liten f&ouml;r att jobba med. Vad kan jag
g&ouml;ra?</P>
		<P><I>Svar: </I>du kan anv&auml;nda <A HREF="dusty.htm">Dammis</A>
f&ouml;r att suga ut hela l&aring;dan i en robots tankebubbla och sedan
		l&aring;ta honom spotta ut den p&aring; golvet. D&aring; b&ouml;r den bli
mycket st&ouml;rre
		och l&auml;ttare att arbeta med. Om den inte blir det, kan du l&aring;ta
		<A HREF="pumpy.htm">Pumpas</A> f&ouml;rstora l&aring;dan. G&ouml;r de
&auml;ndringar du vill och sl&auml;pp sedan tillbaka
		l&aring;dan i den tomma tankebubblan. </P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question11"></A>Fr&aring;ga #11:</I> ToonTalk fr&aring;gar
hela tiden efter mitt namn n&auml;r det startar upp.
		Och det kommer ih&aring;g mig. Vad &auml;r det som h&auml;nder?</P>
		<P><I>Svar: </I>N&auml;r du ger ditt namn till ToonTalk l&auml;ggs det in
i filer i &quot;Users&quot;
		underkataloger i ToonTalk katalogen. Dessa filer g&ouml;r att du inte
		beh&ouml;ver b&ouml;rja fr&aring;n b&ouml;rjan varje g&aring;ng du
startar ToonTalk. Filerna
		b&ouml;rjar med det namn du gav till ToonTalk. Mellanslag tas bort
		fr&aring;n ditt namn och i en del versioner kortas filnamnet om det
		&auml;r l&auml;ngre &auml;n 8 bokst&auml;ver. &Auml;r ditt namn t ex
Albert Einstein kanske
		dina filer kortas till &quot;albertei&quot;. Dessa filer inneh&aring;ller
en anv&auml;ndarprofil
		och &auml;ndringar som du gjort i din anteckningsbok. Anv&auml;ndarprofilen
		(USR filen) inneh&aring;ller de inst&auml;llningar du valt, var n&aring;gonstans
		du ligger i uppdragen och vad du gjort i ToonTalk s&aring; att Marty
		inte upprepar det som du redan kan. Har du inte anv&auml;nt ToonTalk
		den senaste tiden eller vill b&ouml;rja med uppdragen fr&aring;n
b&ouml;rjan d&aring;
		ska du antingen hitta p&aring; ett nytt namn till dig sj&auml;lv eller kasta
		USR filen med ditt namn. Din anteckningsbok finns lagrad i en
		BOK fil. Om du &aring;ngrar &auml;ndringar du gjort i din anteckningsbok
		kan du kasta eller ge ett nytt namn till BOK filen med ditt namn.
		Har du sparat saker i din anteckningsbok och och vill beh&aring;lla
		dem kan du anv&auml;nda ToonTalks <A
HREF="sensor.htm#Clipboard">urklippssensor</A>
f&ouml;r att spara. N&auml;r du sparar en stad sparas en CTY fil med ditt
		namn</P>
		<P>Om du vill l&aring;ta n&aring;gon spela ToonTalk men inte
beh&aring;lla n&aring;gra filer,
		kan du l&auml;gga till &quot;-t 1&quot; p&aring; <A
HREF="command.htm#TemporaryUser">kommandoraden</A>. Vill du alltid ha samma
namn n&auml;r du spelar ToonTalk och slippa
		bli tillfr&aring;gad varje g&aring;ng kan du l&auml;gga till &quot;-n
dittnamn&quot; p&aring; <A
HREF="command.htm#TemporaryUser">kommandoraden</A>.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question12"></A>Fr&aring;ga #12:</I> Jag vill att alla i
min grupp ska b&ouml;rja med en anteckningsbok
		och en stad som skiljer sig fr&aring;n den som ToonTalk har. G&aring;r
det?</P>
		<P><I>Svar: </I>Javisst, du kan st&auml;lla in ToonTalk under ett
anv&auml;ndarnamn, l&aring;t
		oss s&auml;ga &quot;Klass4A&quot;, och sedan skriva p&aring;
redigeringsraden i <A HREF="ttini.htm#DefaultUser">ToonTalks ini file</A>
&quot;DefaultUser=&quot; och l&aring;ta det st&aring;
&quot;DefaultUser=&quot;Klass4A&quot;&quot;. Du kan
		&auml;ndra inte bara anteckningsboken n&auml;r du &auml;r inloggad som Klass4A
		utan ocks&aring; storleken och l&auml;get f&ouml;r verktygen och du kan spara
		en stad som blir staden ToonTalk startar med. Alla &auml;ndringar en
		anv&auml;ndare g&ouml;r kommer att sparas under dennes namn -- inte
Klass4A.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question13"></A>Fr&aring;ga #13:</I> Ibland tar jag ut
saker ur en anteckningsbok eller Verktygsl&aring;dan
		av misstag. M&aring;ste jag anv&auml;nda Dammis f&ouml;r att bli av med
dom.</P>
		<P><I>Svar: </I>Om du sl&auml;pper n&aring;got p&aring; en bunt och det
&auml;r identiskt med det som
		ligger i bunten l&auml;ggs det tillbaka i bunten. Anta t ex att du
		tar en anteckningsbok ut ur din anteckningsbok och sedan vill
		l&auml;gga tillbaka den igen. Om anteckningsboken var p&aring; sidan 1
ursprungligen,
		d&aring; m&aring;ste du ha den p&aring; sidan 1 innan du sl&auml;pper
tillbaka den.</P>
		<P><I><A
NAME="PicturesOnPictures"></A>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question14"></A>Fr&aring;ga #14:</I> Kan jag l&auml;ra en
robot att s&auml;tta ihop bilder?</P>
		<P><I>Svar: </I>I m&aring;nga spel och grafikprogram beh&ouml;ver du
l&aring;ta robotar l&auml;gga <A
HREF="picture.htm">bilder</A> p&aring;
bilder. Det h&auml;r &auml;r ett s&auml;tt att g&ouml;ra detta. L&auml;gg
<A HREF="remote.htm#RemoteLooks">en
fj&auml;rrkontroll f&ouml;r bilders utseende</A> i en l&aring;da (detta
blir bakgrundsbilden) och l&auml;gg bilder du vill
		l&auml;gga p&aring; i ytterligare fack. Tr&auml;na en robot att n&auml;r
han f&aring;r denna
		l&aring;da ska han kopiera en bild och v&auml;nda den. Ta ut
fj&auml;rrkontrollerna
		fr&aring;n den nya bildens anteckningsbok som du kommer att beh&ouml;va (t
		ex kontrollerna f&ouml;r l&auml;ge och storlek). V&auml;nd tillbaka bilden och
		sl&auml;pp den p&aring; fj&auml;rrkontrollen f&ouml;r bakgrundsbildens
utseende. L&auml;r
		sedan roboten att &auml;ndra fj&auml;rrkontrollerna du tog ut som det passar.
		F&ouml;r att den h&auml;r roboten ska kunna arbeta mera allm&auml;nt beh&ouml;ver
		du nog anv&auml;nda <A
HREF="dusty.htm">Dammis</A> f&ouml;r att
radera en del av bilderna i l&aring;dan i tankebubblan.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question15"></A>Fr&aring;ga #15:</I> Lulu i London
fr&aring;gar &quot;Kan man ge namn till f&aring;glar? Det &auml;r
j&auml;ttesv&aring;rt
		att komma ih&aring;g var olika f&aring;glar bor..&quot;</P>
		<P><I>Svar:</I> Ja, det kan du, om du anv&auml;nder Pumpas f&ouml;r att
g&ouml;ra en <A
HREF="bird.htm">f&aring;gel</A> riktigt
stor och sl&auml;pper en bild p&aring; hennes T-tr&ouml;ja. Om bilden
		str&auml;cker sig utanf&ouml;r hennes T-tr&ouml;ja, tolkas det som att bilden
		ska tas till hennes bo. Om bilden helt ligger innanf&ouml;r kanterna
		p&aring; hennes tr&ouml;ja, l&auml;ggs den in d&auml;r. Du kan
f&ouml;rvandla siffror och
		text till bilder av siffror och text genom att v&auml;nda (eller flippa)
		dem. Sedan kan du l&auml;gga in dem p&aring; en T-tr&ouml;ja. Det &auml;r
ocks&aring; bra
		att f&ouml;rvara f&aring;glar och f&aring;gelbon i l&aring;dor och att
anv&auml;nda etiketter
		f&ouml;r att h&aring;lla reda p&aring; vilken som &auml;r vilken.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question16"></A>Fr&aring;ga #16:</I> Lulu i London
fr&aring;gar ocks&aring; &quot;Hur skriver man decimaltal i
ToonTalk?&quot;</P>
		<P><I>Svar:</I> Det saknas f&ouml;r n&auml;rvarande st&ouml;d f&ouml;r
decimaltal i ToonTalk. <A
HREF="http://www.toontalk.com/English/faq.htm#question16">Klicka h&auml;r</A> om du
vill veta mera om detta p&aring; engelska.</P>
		<P><I>--------------------------------------------------------------</I></P>
		<P><I><A NAME="question17"></A>Fr&aring;ga #17:</I> Tyler Breisacher
fr&aring;gar &quot;Jag har l&auml;st att man kan &quot;l&auml;gga ut&quot;
		robotar p&aring; n&auml;tet, fast jag vet inte hur. &quot;</P>
		<P><I>Svar: </I><A
HREF="contribp.htm">Klicka
h&auml;r</A>.</P>
		<P>===================================</P>
		<P><A HREF="http://www.toontalk.com/Swedish/faq.htm">Klicka h&auml;r</A>
f&ouml;r att se den senaste versionen av denna sida.</P>
		<P><A HREF="http://www.toontalk.com/Swedish/toontalk.htm">Tillbaka till
ToonTalks hemsida.</A></P>
	</BODY>
</HTML>

