<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<TITLE>Att ställa in ToonTalk</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.04z">
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
<P>
<CENTER><B><FONT SIZE=4>Att st&auml;lla in ToonTalk</FONT></B></CENTER>
<P>
P&aring; sidan 10 i din f&ouml;rsta <A HREF="notebook.htm">anteckningsbok</A>
hittar du inst&auml;llningarna f&ouml;r ToonTalk. De fungerar
som <A HREF="remote.htm">fj&auml;rrkontroller f&ouml;r bilder</A>.
och <A HREF="sensor.htm">sensorer</A>. Alla dessa kontroller anv&auml;nds
av den som just d&aring; k&ouml;r ToonTalk och inte av alla anv&auml;ndare.
Du kan f&aring; alla &auml;ndringar att g&auml;lla f&ouml;r alla
anv&auml;ndare med <A HREF="command.htm">tillval f&ouml;r kommandon</A>.
<P>
De tillval f&ouml;r kontroller som du har i anteckningsboken &auml;r:
<UL>
<LI><A NAME="HeadLooks"><B>Sidan 2.</B> Kontrollerar hur du ser
ut. Du kan peka p&aring; eller plocka upp den h&auml;r kontrollen
och trycka p&aring; mellanslag f&ouml;r att komma till n&auml;sta
tillval. Dina val &auml;r m&ouml;ssa, skallig eller l&aring;ngt
r&ouml;tt h&aring;r. Se ocks&aring; </A><A HREF="command.htm#HeadLook">tillval f&ouml;r kommandon</A>.
<LI><B>Sidan 4.</B> Kontrollerar om ljudet &auml;r p&aring;. Tryck
p&aring; mellanslag och v&auml;xla mellan &quot;yes&quot; till
&quot;no&quot; och att trycka den igen v&auml;xlar tillbaka till
&quot;yes&quot;.
<LI><B>Sidan 6.</B> Kontrollerar storleken p&aring; staden. Du
kan g&aring; fr&aring;n 1 till 255. Om du anv&auml;nder minus
blir staden ungef&auml;r halvfull med hus. Du m&aring;ste starta
omToonTalk f&ouml;r att &auml;ndringarna ska tr&auml;da i kraft.
<LI><B>Sidan 8.</B> Att anv&auml;nda musknapparna. Normalt fungerar
musknapparna likadant utom n&auml;r du k&ouml;r helikoptern. Olika
snabbkommandon kan skapas f&ouml;r mittknappen och h&ouml;gerknappen.
Se <A HREF="mouse.htm">musknappar</A> f&ouml;r mera detaljer.
<LI><B>Sidan 10.</B> Kontroll av sk&auml;rmbilden. Utg&aring;ngsl&auml;get
&auml;r full sk&auml;rm f&ouml;r den aktuella datorn. Kan vara
1x (320x240), 2x (640x480) upp till 4x. Om den st&auml;lls in
p&aring; ett l&auml;ge som &auml;r lika med eller st&ouml;rre
&auml;n sk&auml;rmen d&aring; anv&auml;nds en mjuk version av
fullsk&auml;rmsl&auml;ge. Det brukar bli l&aring;ngsammare och
animationerna kan bli ryckiga men p&aring; en del maskiner g&aring;r
det b&auml;ttre. Med Windows NT fungerar inte fullsk&auml;rmsl&auml;ge
f&ouml;r datorn (i 16bitars versionen av ToonTalk).
<LI><B>Sidan 12.</B> ToonTalks hastighet. Grundl&auml;get &auml;r
100. St&auml;ller man in p&aring; mer &auml;n 100 g&aring;r animationerna
snabbare och vid mindre &auml;n 100 g&aring;r de l&aring;ngsammare.
Anv&auml;nds i Fibonacci demon.
<LI><B>Sidan 14.</B> Minsta tidsl&auml;ngd f&ouml;r varje ruta.
Grundl&auml;get &auml;r 0. H&ouml;gre tal g&ouml;r systemet l&aring;ngsammare
men ger mjukare &ouml;verg&aring;ngar.
<LI><B>Page 16.</B> Storleken p&aring; Martys bokst&auml;ver.
Grundl&auml;get &auml;r 100. St&ouml;rre tal ger st&ouml;rre bokst&auml;ver
i hans pratbubblor.
<LI><B>Page 18.</B> Hastigheten p&aring; Martys tal. Grundl&auml;get
&auml;r 100. St&ouml;rre tal inneb&auml;r att han v&auml;xlar
pratbubbla snabbare.
<LI><B>Page 20.</B> Best&auml;mmer hur mycket Marty ber&auml;ttar.
Grundl&auml;get &auml;r 2. Kan st&auml;llas in fr&aring;n 0 till
5. P&aring; 0 kommer Marty ber&auml;tta precis allt han har att
s&auml;ga. P&aring; 5 s&auml;ger han ingenting. 2 &auml;r allts&aring;
grundl&auml;get.
<LI><B>Page 22.</B> Inst&auml;llning f&ouml;r hur Marty talar.
Han kan antingen tala h&ouml;gt, visa pratbubblor eller b&aring;da
samtidigt. Finns enbart i 32 bitars versionen. Grundinst&auml;llningen
i 16 bitars versionen &auml;r pratbubblor och i 32 bitars versionen
att han talar h&ouml;gt och visar pratbubblor samtidigt..
<LI><B>Sidan 24.</B> St&auml;ller in vilken seriell port en Hyperbot
kontroll kopplas till. Hyperbot kontroller kan styra en massa
olika leksaker av m&auml;rkena LEGO, Technic och Capsula. Skicka
mig <A HREF="mailTo:KenKahn@ToonTalk.com">epost</A> f&ouml;r mera
information. 
</UL>
</BODY>
</HTML>
