<HTML>
	<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<META NAME="generator" CONTENT="GoLive CyberStudio">
		<TITLE>Att använda bilder och animationer i ToonTalk</TITLE>
	</HEAD>
	<BODY TEXT="#000000" BGCOLOR="#ffffff">
		<CENTER>
			<P><B><FONT SIZE="4">Att anv&auml;nda bilder och animationer</FONT></B></P>
		</CENTER>
		<P>I den f&ouml;rsta <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/notebook.htm">anteckningsbokens</A>,
p&aring; sidan 2, finns det en samling bilder och animationer. Det
		&auml;r bara f&ouml;r dig att ta ut en och om det &auml;r en animation
s&aring; s&auml;tter
		den ig&aring;ng av sig sj&auml;lv. En del av dom har mer &auml;n en
slinga i animeringen.
		Du kan anv&auml;nda <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/keyboard.htm#Pictures">snabbkommandon</A
> f&ouml;r att v&auml;xla mellan dom. </P>
		<P>Om du sl&auml;pper en bild (eller en animation) p&aring; en annan
s&aring; kommer
		<A HREF="ToonTalk/%85vrigt/DOC/SWEDISH/bammer.htm">Hammarmusen</A> att
sl&aring; ihop dom. De kommer att sitta ihop om du inte l&aring;ter <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/dusty.htm">Dammis</A> dra is&auml;r
dom. </P>
		<P>Du kan flippa eller v&auml;nda p&aring; bilder genom att trycka
p&aring; &quot;f&quot; medan
		du h&aring;ller i dom. D&aring; f&aring;r du se en stor gr&aring; yta
p&aring; deras baksida
		och en anteckningsbok full med <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/remote.htm">fj&auml;rrkontroller och
sensorer</A> kommer att flyga ut. Med fj&auml;rrkontrollerna kan du
best&auml;mma var
		bilden ska vara, hur snabbt den ska r&ouml;ra sig, hur stor den ska
		vara och vilket utseende den ska ha. Du kan ocks&aring; hitta sensorer
		som visar dig n&auml;r bilden krockar med n&aring;got. Du kan l&auml;ra
<A HREF="ToonTalk/%85vrigt/DOC/SWEDISH/robot.htm">robotar</A> att arbeta
med dessa fj&auml;rrkontroller och sensorer och sedan f&auml;sta
		robotarna p&aring; baksidan av bilderna och animationerna. Sen ger du
		robotarna de l&aring;dor de vill ha. N&auml;r du v&auml;nder tillbaka bilden,
		b&ouml;rjar robotarna arbeta och kan best&auml;mma hur bilderna ska bete
		sig p&aring; alla uppt&auml;nkliga s&auml;tt. Dom kan studsa, explodera
n&auml;r de
		st&ouml;ter emot n&aring;got, dansa en liten dans eller vad du nu hittar
		p&aring;. &quot;Bordtennis&quot; demon visar hur tv&aring; barn bygger
ett Bordtennisspel.
		</P>
		<P><B>Tips. </B>Du kan v&auml;nda p&aring; en bild och sl&auml;ppa den
p&aring; en annan bild. Det g&aring;r
		mycket fortare &auml;n att flytta en bunt robotar och l&aring;dor
fr&aring;n den
		ena bilden till den andra. Det &auml;r ett bra s&auml;tt att &quot;packa
ihop&quot;
		ett programmeringsjobb och sedan &ouml;verf&ouml;ra det till en massa andra
		f&ouml;rem&aring;l.</P>
		<P><B>Tips.</B> De flesta dataspel &auml;r gjorda med vad som kallas
<I>sprites</I> - sm&aring; animationsslingor som kan r&ouml;ra sig och
uppf&ouml;ra sig p&aring; olika
		s&auml;tt. Det &auml;r s&aring;na <I>sprites</I> du g&ouml;r n&auml;r du
s&auml;tter robotar p&aring; baksidan av bilder och animationer.
		</P>
		<P><B>Tomma bilder.</B> Dammis kan t&ouml;mma eller rensa en bild. Det
&auml;r praktiskt i <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/bubble.htm">tankebubblor</A> n&auml;r
du vill att en robot ska arbeta med vilken bild som helst.
		</P>
		<P><B>Tips.</B> Du kan <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/sensor.htm#PictureFile">s&auml;tta in
egna bilder i ToonTalk</A> genom att anv&auml;nda en sensor. </P>
		<P><B>Avancerat Tips.</B> Du kan f&aring; siffror och texter att
uppf&ouml;ra sig som som bilder om
		du rensar en bild och sl&auml;pper ett textkort eller ett sifferkort
		p&aring; den tomma bilden. Du kan till och med s&auml;tta robotar
p&aring; baksidan.
		&quot;Bordtennis&quot; demon g&ouml;r en po&auml;ngr&auml;knare genom att
s&auml;tta en robot
		p&aring; baksidan av en bild p&aring; en siffra.</P>
		<P><A NAME="BirdOnTheBack"></A><A NAME="PicturesCollide"></A><B>Avancerat
Tips.</B> Du kan s&auml;tta en f&aring;gel p&aring; baksidan av en bild.
Det kan vara riktigt
		fiffigt n&auml;r du anv&auml;nder sensorn som visar <A HREF="New%20HTML%20
TT/remote.htm#WhichPicture">vad en bild kolliderar med</A>. Om
f&aring;gelns bo p&aring; baksidan av bilden ligger i en l&aring;da, som
ett
		lag med robotar v&auml;ntar p&aring;, d&aring; kan detta g&ouml;ra det
m&ouml;jligt att skapa
		vilka effekter som helst mellan f&ouml;rem&aring;l som kolliderar. Till
exempel
		kan ett lag med robotar, som sitter p&aring; baksidan av en kanin, v&auml;nta
		p&aring; att en bild med en gr&ouml;nsak ska visa sig p&aring;
kollisionsdetektorn.
		Robotarna kan sedan suga bort bilden (en kopia av gr&ouml;nsaken som
		kaninen kolliderar med), spotta ut den, v&auml;nda (eller flippa) den,
		plocka upp f&aring;geln och ge henne l&aring;da f&ouml;r att fr&aring;ga
hur den smakar.
		L&aring;dan f&ouml;rs till ett bo p&aring; baksidan av gr&ouml;nsaken,
d&auml;r en robot
		v&auml;ntar p&aring; att svara p&aring; s&aring;dana fr&aring;gor. </P>
	</BODY>
</HTML>

