<HTML>
	<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<META NAME="generator" CONTENT="GoLive CyberStudio">
		<TITLE>ToonTalk Robotar</TITLE>
	</HEAD>
	<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
		<CENTER>
			<P><IMG
SRC="../robot.gif"> </P>
			<P><I>Du kan tr&auml;na robotar att f&ouml;lja din viljas minsta
vink</I> </P>
		</CENTER>
		<P>Inuti <A
HREF="/Hard%20disk/Desktop%20Folder/ToonTalk/%85vrigt/DOC/SWEDISH/tooly.htm"
>Verktygsl&aring;dan</A> finns det en massa robotar. Om du tar ut en
s&aring; ser du att han
		har en tom <A
HREF="/Hard%20disk/Desktop%20Folder/ToonTalk/%85vrigt/DOC/SWEDISH/bubble.htm
">tankebubbla</A>. Du kan b&ouml;rja tr&auml;na en ny robot med att
sl&auml;ppa en l&aring;da p&aring; honom.
		Du kommer in i robotens tankar och kan kontrollera honom. Du kan
		f&aring; honom att plocka upp saker, anv&auml;nda verktyg och sl&auml;ppa ner
		saker. Han kommer ih&aring;g allt. Om du l&auml;r honom att ta
n&aring;got ur en
		l&aring;da eller att l&auml;gga dit n&aring;got s&aring; kommer han
ih&aring;g vilket fack
		det var genom att r&auml;kna fr&aring;n v&auml;nster sida av l&aring;dan.
N&auml;r du l&auml;rt
		honom f&auml;rdigt kan du trycka escape-knappen (den brukar heta
<I>Esc</I>). </P>
		<P>Sen kan du f&aring; roboten att g&ouml;ra det du tr&auml;nat honom
till genom
		att ge honom l&aring;dan igen. N&auml;r han &auml;r f&auml;rdig kommer
han f&ouml;rs&ouml;ka
		g&ouml;ra det igen s&aring; l&auml;nge som l&aring;dan <A
HREF="/Hard%20disk/Desktop%20Folder/ToonTalk/%85vrigt/DOC/SWEDISH/bubble.htm
">&auml;r densamma som den i hans tankebubbla</A>. </P>
		<P><B>Tips. </B>Robotar &auml;r v&auml;ldigt kinkiga. Dom arbetar enbart
med l&aring;dor som &auml;r
		likadana som de l&aring;dor som finns i deras tankebubblor. Som tur
		&auml;r kan du anv&auml;nda <A
HREF="/Hard%20disk/Desktop%20Folder/ToonTalk/%85vrigt/DOC/SWEDISH/dusty.htm"
>Dammis</A> f&ouml;r att suga bort en del saker ur l&aring;dan som &auml;r
i tankebubblan.
		En bra id&eacute; kan vara att suga bort bara s&aring; mycket att du kan
f&aring;
		roboten att arbeta n&auml;r du vill det. Ibland &auml;r det l&auml;ttare att
		suga bort l&aring;dan ur tankebubblan, spotta ut den och sedan sl&auml;ppa
		tillbaka den p&aring; tankebubblan igen.</P>
		<P><B>Hela lag med robotar.</B> Du kan g&ouml;ra ett lag av robotar genom
att sl&auml;ppa dom p&aring; varandra.
		N&auml;r du ger en l&aring;da till laget d&aring; ser roboten l&auml;ngst
fram i ledet
		efter om l&aring;dan &auml;r likadan som den i hans tankebubbla. &Auml;r
den det
		kommer han att b&ouml;rja arbeta med den och hans lagkamrater kommer
		h&aring;lla sig ur v&auml;gen. Om l&aring;dan inte &auml;r likadan,
kommer han att skicka
		den vidare till n&auml;sta robot som st&aring;r i tur. Om det saknas
n&aring;got
		i l&aring;dan eller om det ligger ett f&aring;gelbo i den och roboten vill
		ha n&aring;got annat d&aring; v&auml;ntar han. N&auml;r l&aring;dan fylls
p&aring; med det som fattas,
		eller det l&auml;ggs i boet, s&aring; b&ouml;rjar han arbeta igen. </P>
		<P><B>Tips.</B> Om du vill att en robot ska g&ouml;ra n&aring;got bara
n&auml;r n&aring;got <I>inte</I> &auml;r d&auml;r, d&aring; kan du
l&aring;ta roboten framf&ouml;r honom kolla efter n&aring;got,
		t ex talet 42 f&ouml;r att roboten efter honom bara ska f&aring; en
m&ouml;jlighet
		att k&ouml;ra ig&aring;ng om talet &auml;r n&aring;got annat &auml;n 42. </P>
		<P>&Ouml;verallt d&auml;r du beh&ouml;ver en robot kan du anv&auml;nda
ett lag av robotar
		lika g&auml;rna. Du kan sl&auml;ppa ett lag av robotar i en <A
HREF="/Hard%20disk/Desktop%20Folder/ToonTalk/%85vrigt/DOC/SWEDISH/truck.htm"
>lastbil</A> eller f&auml;sta dom p&aring; baksidan av en <A
HREF="/Hard%20disk/Desktop%20Folder/ToonTalk/%85vrigt/DOC/SWEDISH/picture.ht
m">bild</A>. Enda s&auml;ttet att l&ouml;sa upp ett lag &auml;r att
anv&auml;nda <A
HREF="/Hard%20disk/Desktop%20Folder/ToonTalk/%85vrigt/DOC/SWEDISH/dusty.htm"
>Dammis</A> f&ouml;r att dra is&auml;r dom.</P>
		<P><B><A NAME="ReTraining"></A>Tips.</B> Om du tr&auml;nat en robot att
g&ouml;ra n&auml;stan precis r&auml;tt, men st&ouml;kat
		till det en smula, d&aring; kan du tr&auml;na om honom. Sug bara ut
l&aring;dan
		ur robotens tankebubbla, spotta ut den och sl&auml;pp sedan l&aring;dan
p&aring;
		roboten (var noga med att inte sl&auml;ppa den p&aring; tankebubblan). Du
		g&aring;r tillbaka in i robotens tankebubbla, men den h&auml;r
g&aring;ngen kommer
		roboten g&ouml;ra om det du l&auml;rt honom att g&ouml;ra tills du klickar med
		musen eller en tangent p&aring; tangentbordet. Sedan kan du forts&auml;tta
		att tr&auml;na honom som vanligt.</P>
		<P>H&auml;r kommer n&aring;gra avancerade tips p&aring; engelska.</P>
		<P><B>Advanced tip. </B>You can't train a robot to give something to
other robots, but
		you can train a robot to load up a truck with other robots. Computer
		scientists would describe this as saying that while you can't
		do a procedure call, you can do a more general process spawn.
		If you want to get something back from the robots then arrange
		for them to give a reply to a bird. </P>
		<P><B>Advanced tip.</B> Computer scientists talk about <I>recursive</I>
programs - programs that use themselves. Here's how you can make
		recursive programs in ToonTalk. Put a fresh robot on a blank page
		of your <A HREF="notebook.htm">main notebook</A>.
                Then train another robot to, among other things, find the page
		with the saved robot. Train the robot to put a copy of the robot
		in the notebook into a truck along with a box for him to work
		on. After finishing your robot's training, find the page where
		you saved the robot. Use <A
HREF="dusty.htm">Dusty</A> to
remove that robot and put in his place the robot you just
		trained. </P>
		<P>The factorial of a number (1 times 2 times 3 and so on up to your
		number) can be computed recursively or <I>iteratively</I> (repeatedly
without using recursion). <A
HREF="programs.htm#SingleFacto
rial">Click here</A> to find robots to compute the factorial using
recursion once.
		<A
HREF="programs.htm#DoubleFacto
rial">Click here</A> to find robots that compute factorial using recursion
twice.
		Robots that compute factorial without recursion can found on page
		12 of the examples notebook which is on page 6 of your main notebook.
		</P>
		<P><B><A NAME="MetaProgramming"></A>Advanced tip.</B> You can put robots
in boxes and even train other robots to manipulate
		those robots. Computer scientists call this <I>meta-programming</I>.
Robots cannot train other robots, but they can re-arrange teams,
		remove, edit and replace boxes in thought bubbles, and the like.
		<A
HREF="box.htm#ExplodingTeams">
Dropping a team of robots on a blank box</A> breaks the team up -- one
robot per hole of the box. A robot
		in a box in a thought bubble will only match another robot with
		the same name. You can use Dusty to &quot;erase&quot; a robot so that it
		will only match any robot.</P>
		<P>You can also train a robot to pick up a team of robots from a
		box and put them in a truck together with a box for them to work
		on. Computer scientists call this <I>higher-order programming</I>. There
is a way of combining higher-order programming and recursive
		programming -- see if you can figure out how.</P>
	</BODY>
</HTML>

