<HTML>
	<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<META NAME="generator" CONTENT="GoLive CyberStudio">
		<TITLE>Att anv&auml;nda sensorer i ToonTalk</TITLE>
	</HEAD>
	<BODY TEXT="#000000" BGCOLOR="#ffffff">
		<CENTER>
			<P><B><FONT SIZE="4">Att anv&auml;nda sensorer</FONT></B></P>
		</CENTER>
		<P>P&aring; sidan 4 i din f&ouml;rsta anteckningsbok finns en anteckningsbok
		full med sensorer. De &auml;r bra f&ouml;r att styra saker med musen och
		tangentbordet. Det finns ocks&aring; sensorer f&ouml;r att m&auml;ta
tiden, f&aring;
		fram slumptal och adressen till huset. En del sensorer &auml;r till
		f&ouml;r att l&auml;gga in bilder, ljud, text och ToonTalk saker
utifr&aring;n.
		Sensorer fungerar ungef&auml;r likadant som <A
HREF="remote.htm">kontroller f&ouml;r
bilder</A>. </P>
		<P>Sensorerna i anteckningsboken &auml;r f&ouml;ljande: </P>
<DL>
			<DT><B>Sidan 2 - Musens hastighet åt höger.</B>
<DD>De h&auml;r sensorerna m&auml;ter hur snabbt datorns
mus (inte <A
HREF="bammer.htm">Hammarmusen</A>) r&ouml;r
sig fr&aring;n v&auml;nster till h&ouml;ger. Om talet &auml;r negativt
r&ouml;r sig
			musen fr&aring;n h&ouml;ger till v&auml;nster. Hastigheten 1000 betyder
att musen
			kan flyttas tv&auml;rs &ouml;ver sk&auml;rmen p&aring; 1 sekund.
			<DT><B>Sidan 4 - Musens hastighet uppåt.</B>
<DD>Den h&auml;r sensorn m&auml;ter hur snabbt musen kan
flyttas upp&aring;t. Om
			talet &auml;r negativt g&auml;ller det hastigheten ner&aring;t.
Hastigheten 1000
			betyder att musen kan flyttas nerifr&aring;n och upp p&aring; 1 sekund.
			<DT><B>Sidan 6 - Musens vänstra knapp.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan,
&quot;Tryckte du p&aring; den v&auml;nstra
			musknappen?&quot; Om du trycker p&aring; den v&auml;nstra musknappen
kommer den
			att v&auml;xla fr&aring;n &quot;nej&quot; till &quot;ja&quot; och sedan
tillbaka till &quot;nej&quot; v&auml;ldigt
			fort. Men en robot kan uppfatta det och reagera p&aring; att det &auml;r
			&quot;ja&quot;.
			<DT><B>Sidan 8 - Musens mitt knapp.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan,
&quot;Tryckte du p&aring; mittknappen?&quot;
			Om du trycker p&aring; mittknappen v&auml;xlar den fr&aring;n
&quot;nej&quot; till &quot;ja&quot; och
			sen tillbaka till &quot;nej&quot; v&auml;ldigt fort.
			<DT><B>Sidan 10 - Musens högra knapp.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan,
&quot;Tryckte du p&aring; den h&ouml;gra musknappen?&quot;
			Om du trycker den h&ouml;gra musknappen kommer den att v&auml;xla
fr&aring;n &quot;nej&quot;
			till &quot;ja&quot; och sen tillbaka till &quot;nej&quot; igen
v&auml;ldigt fort.
			<DT><B>Sidan 12 - Musens vänstra knapp nere.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan,
&quot;&Auml;r den v&auml;nstra musknappen
			nertryckt nu?&quot; Om du trycker den v&auml;nstra musknappen v&auml;xlar den
			fr&aring;n &quot;nej&quot; till &quot;ja&quot; och f&ouml;rblir i det
l&auml;get till dess du sl&auml;pper
			upp musknappen.
			<DT><B>Sidan 14 - Musens mitt knapp nere.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan,
&quot;&Auml;r mittenknappen nertryckt
			nu?&quot; Om du trycker mittenknappen v&auml;xlar den fr&aring;n
&quot;nej&quot; till &quot;ja&quot;
			och f&ouml;rblir i det l&auml;get till dess du sl&auml;pper upp musknappen.
			<DT><B>Sidan 16 - Musens högra knapp nere.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan,
&quot;&Auml;r den h&ouml;gra musknappen nertryckt
			nu?&quot; Om du trycker den h&ouml;gra musknappen v&auml;xlar den
fr&aring;n &quot;nej&quot;
			till &quot;ja&quot; och f&ouml;rblir i det l&auml;get till dess du
sl&auml;pper upp musknappen.
			
			<DT><B>Sidan 18 - Nyss tryckt tangent.</B>
<DD>Den h&auml;r sensorn visar vilken tangentknapp som
senast trycktes.
			N&auml;r du trycker en tangent, g&aring;r den h&auml;r sensorn
fr&aring;n att vara tom,
			till att visa vilken tangent det &auml;r du trycker, till att bli tom
			igen v&auml;ldigt fort. En robot kan tr&auml;nas till att f&aring;nga upp den
			v&auml;xlingen.
			<DT><B>Sidan 20 - Senaste tangenttryck.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan
&quot;Vilken tangentknapp trycktes
			senast ner?&quot; den visar vilken tangent det var tills den sl&auml;pps
			upp igen.
			<DT><A NAME="OLE_LINK2"></A><B>Sidan 22 - Shift nere.</B>
<DD>Den h&auml;r sensorn svarar
p&aring; fr&aring;gan &quot;&Auml;r <I>Shift</I> tangenten p&aring;
tangentbordet nertryckt just nu?&quot;
			<DT><B>Sidan 24 - Kontroll nere.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan
&quot;&Auml;r <I>Control</I> knappen (den heter ofta <I>Ctrl</I>) p&aring;
tangentbordet nertryckt just nu?&quot;
			<DT><B>Sidan 26 - Tusendels- sekunder sedan senaste filmruta.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan
&quot;Hur l&aring;ng tid har g&aring;tt sedan
			du senast svarade p&aring; den h&auml;r fr&aring;gan?&quot;. Svaret ges
i millisekunder
			(tusendelar av en sekund). Med den h&auml;r sensorn kan du skapa klockor
			och tidtagare.
			<DT><B>Sidan 28 - Tal mellan 0 och 1000.</B>
<DD>Den h&auml;r sensorn svarar p&aring; fr&aring;gan
&quot;Vilket tal mellan 0 och 1000?&quot;
			Den g&ouml;r sitt b&auml;sta att svara slumpm&auml;ssigt, <I>random</I>,
som n&auml;r du singlar slant eller kastar t&auml;rning. Om du vill ha
			en kopia av denna som inte &auml;ndras s&aring; sl&auml;pp den p&aring;
en nolla.
			<DT><A NAME="Clipboard"></A><B>Sidan 30 - Till och från andra program.</B>
<DD>Den h&auml;r sensorn
kopplar till <I>urklipp</I> i Microsoft Windows. Om du sl&auml;pper
n&aring;got p&aring; den h&auml;r sensorn n&auml;r
			den &auml;r tom (svart), d&aring; kommer Hammarmusen klippa in det du
sl&auml;ppte
			i urklippet. D&auml;refter kan du g&aring; till ett annat program i Windows,
			t ex ett a epostprogram eller en ordbehandlare och v&auml;lja <I>Klistra
in</I> fr&aring;n menyn (det brukar vara <I>Edit</I> eller
<I>Redigera</I>). Texten som sparas kan l&auml;ggas in i dokument, skickas
med epost
			eller vad nu vill g&ouml;ra med det. N&auml;r du vill g&aring; i den
andra riktningen
			och h&auml;mta in n&aring;got till ToonTalk utifr&aring;n d&aring;
&auml;r det bara att markera
			den text ToonTalk skapade och v&auml;lja <I>Copy</I> eller
<I>Kopiera</I> fr&aring;n menyraden. ToonTalk sensor f&ouml;r urklipp
kommer nu visa det
			som kopierats. Anv&auml;nd <A
HREF="dusty.htm">Dammis</A> f&ouml;r att ta
ut det fr&aring;n urklipp och spotta ut det. Du kan ocks&aring;
			kopiera in text i ToonTalk p&aring; det h&auml;r viset.
			<DT><A NAME="HandVisible"></A><B>Sidan 32 - Hand synlig?.</B>
<DD>Den h&auml;r sensorn
svarar p&aring; fr&aring;gan, &quot;&Auml;r din hand synlig?&quot;. Du kan
			h&aring;lla ner mellanslag medan du pekar p&aring; eller h&aring;ller i
den h&auml;r
			sensorn och din hand blir osynlig om den &auml;r synlig eller synlig
			om den &auml;r osynlig. N&auml;r sidan du spelar ett spel som Bordtennis
			(p&aring; sidan 24 i anteckningsboken f&ouml;r exempel p&aring; sidan 6
i din f&ouml;rsta
			anteckningsbok) vill du f&ouml;r det mesta d&ouml;lja din hand. Det h&auml;r
			&auml;r ett bra s&auml;tt f&ouml;r dig att l&aring;ta en robot g&ouml;ra
det n&auml;r spelet
			s&auml;tter ig&aring;ng. F9 g&ouml;mmer ocks&aring; din hand. Trycker du
F9 igen blir
			den synlig.
			<DT><A NAME="PictureFile"></A><B>Sidan 34. - Fil till Bild </B>
<DD>Den h&auml;r sensorn
f&ouml;rvandlar filnamn till bilder. Sl&auml;pp bara ett
			textkort med filnamnet p&aring; en Windows BMP fil p&aring; en sensor
s&aring; kommer
			<A HREF="bammer.htm">Hammarmusen</A> att
sm&auml;lla ihop dom. Sen kan du dra ur bilden med <A
HREF="dusty.htm">Dammis</A>. Du kan skapa BMP
filer p&aring; m&aring;nga s&auml;tt - Paint Brush som finns
			i Windows l&aring;ter dig g&ouml;ra dom. Du kan se till f&auml;rgen
svart i dina
			bilder blir genomskinlig med hj&auml;lp av <A
HREF="remote.htm#Visible">synlighetskontrollen
</A>.

<DT><A NAME="SoundFile"><B>Sidan 36 - Fil till ljud.</B>
<DD>Denna sensor konverterar filnamn till ljud. Sl&auml;pp bara ett
textkort med filnamnet p&aring; en Windows WAV (ljud) fil p&aring; sensorn
s&aring; kommer </A><A HREF="bammer.htm">Hammarmusen</A> och sm&auml;ller
in den. Ljudet kommer att spelas upp tills det &auml;r slut eller s&aring;
kan du anv&auml;nda <A HREF="dusty.htm">Dammis</A> f&ouml;r att suga bort
det. Du kan skaffa ett <A HREF="sound.htm">kort f&ouml;r ljud</A> som du
kan anv&auml;nda m&aring;nga g&aring;nger. Sug bara bort det fr&aring;n
sensorn och l&aring;t Dammis spotta ut det. Om din WAV-fil ligger i
underkatalogen "users" i ToonTalk, d&aring; kan du anv&auml;nda filens
korta namn. Du kan spela upp en ljudfil med fj&auml;rrkontrollen f&ouml;r
MCI.
<DT><A NAME="TextToMCI"></A><B>Sidan 38 - Media Control Interface.</B>
<DD>Sl&auml;pper du ett textkort p&aring; denna sensor, skickas texten till
<A HREF="mci.htm">Microsoft Window's Media Control Interface</A> (MCI). Det
h&auml;r &auml;r ett vanligt s&auml;tt att spela olika slags media. Du kan
suga bort det <A HREF="sound.htm">kort f&ouml;r ljud</A> du nyss gjort och
anv&auml;nda det som vilket ljud som helst. Om du t ex sl&auml;pper "play
c:\windows\media\canyon.mid" p&aring; denna kontroll kommer du att skapa
ett kort f&ouml;r att spela "canyon.mid", en MIDI fil.
			<DT><A NAME="TextToSpeech"></A><B>Sidan 40. - Text till Tal </B>
<DD>Om du sl&auml;pper ett
textkort p&aring; denna sensor kommer texten bli uppl&auml;st.
			Det fungerat bara i 32-bitarsversionen av ToonTalk. Du skapar
			ett <A HREF="sound.htm">kort f&ouml;r ljud</A> som du
kan suga bort fr&aring;n sensorn. 
			<DT><B>Sidan 42 - Vägg Utsmyckning.</B>
<DD>Denna inneh&aring;ller en bild p&aring; v&auml;ggen
i rummet. Du kan sl&auml;ppa bilder
			och text p&aring; den och v&auml;ggen i rummet du befinner dig i kommer att
			se ut precis som denna sensor.
			<DT><B>Sidan 44 - Hus Utsmyckning.</B>
<DD>Denna inneh&aring;ller en bild p&aring; husets
framsida. Du kan sl&auml;ppa bilder
			och text p&aring; den och framsidan p&aring; huset du befinner dig i kommer
			att se ut precis som denna sensor.
			<DT><B>Sidan 46 - Yttertak Utsmyckning.</B>
<DD>Denna inneh&aring;ller en bild p&aring; husets tak.
Du kan sl&auml;ppa bilder
			och text p&aring; den och taket p&aring; huset du befinner dig i kommer att
			se ut precis som denna sensor.
			<DT><A NAME="Address"></A><B>Sidan 48 - Min 
adress.</B>
<DD>P&aring; den h&auml;r sidan finns 2 sensorer som
visar <A HREF="location.htm">adressen till
huset</A> som de ligger i. Den f&ouml;rsta sensorn visar numret v&auml;gen
och den
			andra numret p&aring; gatan. V&auml;gar g&aring;r fr&aring;n norr till
s&ouml;der. Gator g&aring;r
			fr&aring;n &ouml;ster till v&auml;sterut. Du kan g&ouml;ra nya adresser
av gamla. Om
			du sl&auml;pper en adress p&aring; en lastbil, d&aring; kommer
byggjobbarna bygga
			huset s&aring; n&auml;ra den adressen dom kan. <A NAME="Joysticks"></A>
			<DT><B>Sidan 50 - ToonTalk-tillägg.</B>
<DD>Denna sensor <A
HREF="extend.htm">som kan flyga utanf&ouml;r ToonTalk</A>
och skapa f&ouml;rbindelser till operativsystemet och andra externa
			tj&auml;nster.
			<DT><B>Sidan 52 - Styrspak.</B>
<DD>En anteckningsbok f&ouml;r joystick sensorer. Denna
anteckningsbok
			visar sig bara om du k&ouml;r 32-bitarsversionen av ToonTalk i Windows
			95 och har kopplat in en joystick till datorn. Du kanske m&aring;ste
			<A HREF="joycalib.htm">informera Windows 95 om din
joystick</A>. Har du fler &auml;n en joystick kopplade till datorn kommer
de f&ouml;ljande
			sidorna f&aring; anteckningsb&ouml;cker dessa joysticks. Det finns flera
			<A HREF="joysense.htm">joystick sensorer</A>.
</DL>
	</BODY>
</HTML>

