<HTML>

<HEAD>

<TITLE>Lärare frågar, "Hur är det med ToonTalk och skolor?"</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
H&auml;r komer du f&aring; en utl&auml;ggning om hur ToonTalk
testas i skolor. En allm&auml;n beskrivning av <A HREF="toontalk.htm">ToonTalk</A>
och de <A HREF="think.htm">tankef&ouml;rm&aring;gor</A> programmet
utvecklar finns p&aring; annan plats.
<P>
Den f&ouml;rsta testen av ToonTalkinleddes i januari 1995 p&aring;
Encinal School I Menlo Park, California. En grupp fj&auml;rdeklassare
fick en halvtimmes demonstration av sin l&auml;rare Ruth Colton.
D&auml;refter fick de sitta med ToonTalk i par. Varje sittning
varade i 30 till 40 minuter och cirka sex barn anv&auml;nde ToonTalk
varje vecka. Anteckningar gjordes av hur de anv&auml;nde programmet
och systemet spelade in loggar av allt de gjorde. Loggarna kunde
senare spelas upp. N&auml;r barnen fastnade eller st&auml;llde
fr&aring;gor fick de hj&auml;lp. N&auml;r det passade blev de
ombedda att ta hj&auml;lp av de inbyggda hj&auml;lpfunktionerna
som visades av marsm&auml;nniskan <A HREF="marty.htm">Marty</A>.
I september 1995 och 1996 upprepades detta med Ruth Coltons n&auml;sta
fj&auml;rdeklass.
<P>
Syftet med f&ouml;rs&ouml;ken var inta att genomf&ouml;ra ett
noga kontrollerat vetenskapligt experiment. Skulle n&aring;gon
vara intresserad av att g&ouml;ra det s&aring; ta g&auml;rna kontakt
med <A HREF="mailto:KenKahn@ToonTalk.com">Ken Kahn</A>. Det positiva
med att arbeta med cirka 50 barn var att de tyckte mycket om ToonTalk
och hade f&ouml;ga problem med att beh&auml;rska de grundl&auml;ggande
operationerna i ett avancerat programspr&aring;k. De f&ouml;rstod
hur de skulle programmera robotar, skicka meddelanden med f&aring;glar
och s&aring; vidare. Bara ungef&auml;r 10% av dem hade sv&aring;rt
att begripa hur de skulle programmera robotar (grunden f&ouml;r
ToonTalk-programmering) till och med efter tv&aring; 30 minuters
sittningar. Dessa positiva reslultat &auml;r desto mer anm&auml;rkningsv&auml;rda
n&auml;r man bet&auml;nker att ToonTalk vid denna tid var under
utveckling och inneh&ouml;ll m&aring;nga systembuggar som barnen
fick st&aring; ut med. En hel del sm&aring;problem d&ouml;k ocks&aring;
upp. Ett exempel var att ToonTalk anv&auml;nde den v&auml;nstra
musknappen f&ouml;r att plocka upp och sl&auml;ppa ned saker med
och den h&ouml;gra f&ouml;r att p&aring;verka n&aring;got man
h&ouml;ll i. Flera barn kunde inte h&aring;lla is&auml;r v&auml;nster
och h&ouml;ger. F&ouml;ljden &auml;r att ToonTalk nu inte g&ouml;r
n&aring;gon skillnad mellan h&ouml;ger och v&auml;nster musknapp.
I st&auml;ller anv&auml;nds Shift-tangenten samtidigt med musknapparna
f&ouml;r att p&aring;verka det som man h&aring;ller i handen.
Det blev sammantaget bokstavligen hundratals s&aring;dana f&ouml;r&auml;ndringar
som resultat av att observera hur barnen anv&auml;nde ToonTalk.
<P>
I &auml;rlighetens namn ska s&auml;gas att varken Ruth Coltons
klasser eller de cirka dussinet betatestare som anv&auml;nt ToonTalk
hemma har byggt annat &auml;n mycket enkla program. Det f&ouml;refaller
som om barnen har inga problem att f&ouml;rst&aring; de grundl&auml;ggande
byggstenarna i ToonTalk men d&auml;remot brister i f&ouml;rm&aring;gan
att t&auml;nka ut eller I huvudet f&ouml;rest&auml;lla sig st&ouml;rre
och mera komplicerade program.
<P>
Det &auml;r h&auml;r goda l&auml;rare kommer in i bilden. F&ouml;r
att underl&auml;tta inneh&aring;ller ToonTalk nu en rad exempel
p&aring; program att g&ouml;ra - alltifr&aring;n enkla och lite
galna till seri&ouml;sa, programmeringstekniskt avancerade som
att konstruera ett Ping Pong spel. Exemplen &auml;r gjorda som
kommenterade demonstrationer. Ett annat s&auml;tt att att g&ouml;ra
demonstrationer under utveckling &auml;r att g&ouml;ra illustrerade
handledningar i stil med dem som anv&auml;nds f&ouml;r att bygga
med LEGO&reg;.  En interaktiv handledning har nyligen lagts till
programmet.  Vi hoppas att vi snart kommer att f&aring; se st&ouml;rre
och mer sofistikerade program som barnen har gjort.
<P>
Vi skulle varmt v&auml;lkomna flera betatestare, b&aring;de inom
och utanf&ouml;r skolan. Tv&aring; l&auml;rare vid <A HREF="raabyskl.htm">R&aring;byskolan</A>
(1-5) i n&auml;rheten av Stockholm, Sverige, har b&ouml;rjat anv&auml;nda
ToonTalk i sina klasser. Verksamheten kommer att bedrivas tillsammans
med sex studenter fr&aring;n L&auml;rah&ouml;gskolan i Stockholm
under ht 96. Betatestning har ocks&aring; inletts vid Keio University
i Tokyo, Japan och vid Taiwan National University. 
</BODY>

</HTML>
