<HTML>
	<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<META NAME="generator" CONTENT="GoLive CyberStudio">
		<TITLE>ToonTalks textkort</TITLE>
	</HEAD>
	<BODY TEXT="#000000" BGCOLOR="#ffffff">
		<CENTER>
			<P><B><FONT SIZE="5">ToonTalk Textkort</FONT></B></P>
			<P><IMG THERE WILL BE A PICTURE HERE.
SRC="ToonTalk/%85vrigt/DOC/text.gif" ALT="A picture of a text pad"></P>
		</CENTER>
		<P>Det ligger en mycket tjock bunt med textkort med bokstaven &quot;A&quot;
		inne i <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/tooly.htm">Verktygsl&aring;dan</A>. Du
kan ta upp ett och skriva ord, meningar eller vad du vill.
		Om du trycker <I>Enter</I> s&aring; ger du kortet en ny rad. Om du
sl&auml;pper ett textkort p&aring; ett
		annat kommer <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/bammer.htm">Hammarmusen</A> och
sl&aring;r ihop dom. Och om du sl&auml;pper &quot;Talk&quot; till
h&ouml;ger om &quot;Toon&quot;
		s&aring; f&aring;r du &quot;ToonTalk&quot;. Om du sl&auml;pper det till
v&auml;nster om Toon s&aring;
		f&aring;r du &quot;TalkToon&quot;. </P>
		<P><B>Tips.</B> Du kan sl&auml;ppa textkort p&aring; en <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/notebook.htm">anteckningsbok</A>
f&ouml;r att hitta sidan med just den texten. </P>
		<P><B>Tips.</B> Du kan sl&auml;ppa en <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/number.htm">siffra</A> p&aring; ett
textkort. D&aring; &auml;ndras den f&ouml;rsta eller sista bokstaven
p&aring;
		kortet (beroende p&aring; vilken sida om kortet du sl&auml;pper siffran
p&aring;)
		lika m&aring;nga steg fram&aring;t i alfabetet. Om du sl&auml;pper 2
p&aring; &quot;a&quot; f&aring;r
		du allts&aring; &quot;c&quot;. </P>
		<P><B>Tips.</B> Textkorten som du finner i <A
HREF="New%20HTML%20TT/notebook.htm">anteckningsboken</A> (till exempel,
&quot;Bilder&quot; p&aring; sidan 1) &auml;r gjorda med bokst&auml;ver som
		har&quot;variabel bredd&quot;. Ett W &auml;r till exempel mycket bredare
&auml;n ett
		I. Du kan anv&auml;nda dessa textkort precis som de vanliga med &quot;fast
		bredd&quot;. </P>
		<P><B><I>ENDAST AVANCERADE ANV&Auml;NDARE:</I></B></P>
		<P><A NAME="BlankText"></A><B>Tomma textkort</B> </P>
		<P><A HREF="ToonTalk/%85vrigt/DOC/SWEDISH/dusty.htm">Dammis</A> kan
hj&auml;lpa dig att g&ouml;ra tomma textkort. Dom kommer v&auml;l till pass
		inne i en robots <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/bubble.htm">tankebubbla</A>. En robot
tar ju bara emot l&aring;dor som liknar det som finns i hans
		tankebubbla. Det h&auml;r &auml;r ett s&auml;tt att g&ouml;ra roboten
mindre nogr&auml;knad.
		Om en l&aring;da i hans tankebubbla inneh&aring;ller textkort som det
st&aring;r
		&quot;OK&quot; p&aring; d&aring; godtar han bara l&aring;dor med textkort
som det st&aring;r &quot;OK&quot;
		p&aring;. Men om du rensar och t&ouml;mmer det s&aring; godtar han glatt
textkort
		med vad som helst skrivet p&aring;. </P>
		<P>Tomma textkort kan anv&auml;ndas f&ouml;r att konvertera ett tal till text.
		Sl&auml;pp ett <A
HREF="ToonTalk/%85vrigt/DOC/SWEDISH/number.htm">siffertal</A> p&aring; ett
tomt kort s&aring; f&aring;r du ett textkort med samma siffror p&aring;.
		Fast det ser ut som ett tal &auml;r det nu skrivet p&aring; ett textkort
		i st&auml;llet f&ouml;r ett sifferkort. </P>
		<P><B>Att &auml;ndra utseendet p&aring; texten.</B></P>
		<P>Om du v&auml;nder p&aring; ett textkort (genom att trycka ner
shift-tangenten
		och klicka med musen medan du h&aring;ller i ett textkort), d&aring; kan du
		anv&auml;nda n&aring;gra av <A
HREF="New%20HTML%20TT/remote.htm">fj&auml;rkontrollerna</A> i
anteckningsboken som flyger ut, f&ouml;r att &auml;ndra f&auml;rgen eller
		synligheten p&aring; ett textkort.</P>
	</BODY>
</HTML>

