<HTML>

<HEAD>

<TITLE>ToonTalks lastbilar skapar nya hus</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.0z">
</HEAD>

<body bgcolor="#ffffff" text="#000000">

<P>
<CENTER><B><FONT SIZE=4>Lastbilar skapar nya hus</FONT></B></CENTER>
<P>
<CENTER><IMG There will be a picture here.  SRC="../truck.gif" ALT="A picture of a truck"></CENTER>
<P>
I <A HREF="tooly.htm">Verktygsl&aring;dan</A> ligger det en massa
lastbilar. Varje lastbil har ett arbetslag med byggjobbare som
bara v&auml;ntar p&aring; att f&aring; k&ouml;ra iv&auml;g och
bygga ett nytt hus. Men dom bygger inte ett nytt hus utan att
ha en <A HREF="robot.htm">robot</A> som arbetar i huset. Och en
robot arbetar inte om han inte har <A HREF="box.htm">l&aring;da</A>
att arbeta med. S&aring; du m&aring;ste sl&auml;ppa en robot (eller
ett helt lag med robotar) och en l&aring;da i lastbilen innan
dom k&ouml;r iv&auml;g. Dom kommer sj&auml;lva hitta en ledig
tomt, bygga ett hus d&auml;r, s&auml;tta in roboten i huset och
ge honom l&aring;dan. Sen s&auml;tter han ig&aring;ng att arbeta
direkt.
<P>
Ett roligt exempel p&aring; hur hus kan byggas kan du se i &quot;Exploderande
Hus&quot; demon eller s&aring; kan du prova roboten p&aring; sidan
6 i <A HREF="notebook.htm">anteckningsboken</A> med exempel som
i sin tur &auml;r p&aring; sidan 6 i den f&ouml;rsta anteckningsboken.
<P>
<B>Tips. </B>Bygglaget i lastbilen kommer att bygga ett hus som
kommer att bli precis som det som lastbilen k&ouml;rde ifr&aring;n.
Du kan best&auml;lla vilken sorts hus de ska bygga genom att sl&auml;ppa
en <A HREF="picture.htm">bild</A> p&aring; huset du vill ha p&aring;
lastbilen innan du lastar den. Bilder p&aring; hus kan du hitta
p&aring; sidan 2 i den f&ouml;rsta anteckningsboken.
<P>
<B>Avancerat Tips.</B> Lastbilens bygglag kommer att bygga p&aring;
en ledig tomt i n&auml;rheten. Om du vet precis var du vill ha
huset byggt, kan du sl&auml;ppa en <A HREF="location.htm">adress </A>p&aring;
lastbilen innan du lastar den. Du kan hitta <A HREF="sensor.htm#Address">adresser p&aring; sidan 38</A>,
i din anteckningsbok f&ouml;r sensorer, som i sin tur finns p&aring;
sidan 4 i den f&ouml;rsta anteckningsboken. 
</BODY>

</HTML>
